{
  "itemId": 42748122,
  "name": "2)  POLK AUDIO MM651 6.5\" 200W 2 Way Car Audio Coaxial Black Speakers Pair",
  "salePrice": 249.95,
  "upc": "747192114510",
  "categoryPath": "Electronics/Auto Electronics/Car Speakers & Subwoofers",
  "brandName": "Polk Audio",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FPolk-Audio-MM651-6.5-2-way-Speakers-200W-Marine-Boat-Grade%252F42748122%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FPolk-Audio-MM651-6.5-2-way-Speakers-200W-Marine-Boat-Grade%2F42748122%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_3947_38981",
  "reviews": [
    {
      "name": "2)  POLK AUDIO MM651 6.5\" 200W 2 Way Car Audio Coaxial Black Speakers Pair",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Anchal S. T.",
      "reviewText": "I just purchased the Polk Audio DB651 6 1/2\" speakers.\nTheir on a 2006 Toyota Corolla Ce in the front door location where the factory 6 1/2\" used to be.I broken them in before I really pushed them. So far these speakers have went past my expectation for a quality pair of speakers! They are worth every penny I spent at Circuit City and the installation their was professional!They have high sensitivity rating which indicated that they will play harder and cleaner. The rated watts are good and the max watts are awesome for a pair of 6 1/2\"! They feature an internal crossover which will direct the signals to the proper driver so sound quality is un-compromised. Their marine certified which is great if U want these in the front door of your car! So far these speakers are a great choice for rock,rap,techno and soft rock music. The sound imaging is awesome. I would recommend and suggest anyone to buy thes speakers!\n\nBy: Anchal S. T.\n    ATL,GA",
      "submissionTime": "2007-10-19T00:11:42",
      "title": "19 October 2007",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "2)  POLK AUDIO MM651 6.5\" 200W 2 Way Car Audio Coaxial Black Speakers Pair",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Benjamin Franco",
      "reviewText": "I installed these in my wife's 97 Maxima Se and I was skeptical at first.  The OEM had completely disentigrated because of the sun and were under powered.  Connected them to the original HU and they sounded ok, but I Knew I needed a radio upgrade.  Once I installed the component speakers in the front 6500, the sound completely changed and I could here the bass coming from the rear.  These speakers sound awesome on the OEM radion.  Now my wife wants the radio replaced with the Avic D3.",
      "submissionTime": "2007-07-22T19:46:01",
      "title": "22 July 2007",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "2)  POLK AUDIO MM651 6.5\" 200W 2 Way Car Audio Coaxial Black Speakers Pair",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "JLfan1",
      "reviewText": "Wow, what a great set of speakers at this price point.  I installed two pairs of these in a Trailblazer.  I tested them out with head unit power first to make sure everything worked.  I immediately noticed an improvement.  I couldn't wait to hook these up to an amplifier.  I hooked up a JL a6450 to all four of these speakers and was blown away.  I thought they were well worth the money at head unit power but if you give these things some real power, that's when they really shine.  Tight, punchy midbass and silky smooth highs.  The woofer and tweeter meshed together better than many more expensive and over-engineered component sets.  The aesthetics are probably a little more appealing to the younger crowd but as long as nothing in the sound department was compromised, these get my highest rating.",
      "submissionTime": "2007-11-23T03:28:42",
      "title": "23 November 2007",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "2)  POLK AUDIO MM651 6.5\" 200W 2 Way Car Audio Coaxial Black Speakers Pair",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "biglang_liko",
      "reviewText": "I have a pair of these in the front of my 07 civic powered by a hifonix txi 6406 at 85w rms/channel. Hi pass is set at 35hz and these speakers really deliver the bass! I have a momo 8-inch sub in the back, but these speakers go so loud and low the bass seems to come from the front. Tip: Deaden your front doors if you play it loud or the door panels will rattle like crazy!",
      "submissionTime": "2007-11-04T05:48:12",
      "title": "04 November 2007",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "2)  POLK AUDIO MM651 6.5\" 200W 2 Way Car Audio Coaxial Black Speakers Pair",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "EHAZE",
      "reviewText": "DID ONLINE RESEARCH FOR THE BEST 6.5\" DRIVER TO REPLACE THE OEM SPEAKERS THAT CAME WITH MY NEW HONDA PILOT. EVERY RETAILERS SITE SAID THAT POLK DB650's were the highest rated. after hearing that Polk newest speaker in this line was the DB651, and even better. I soon found out that manying retailers were selling out as fast as they were being deliverd to their stores. I drove 35 miles to my nearest Circuit City only to find out that they too had sold out. Then I drove another 30 miles and was lucky to has purchased the last two pairs. I had the installed...what a difference!!! They are worth  every. I find myself sitting in my driver way just listning to my system.",
      "submissionTime": "2007-04-01T04:08:45",
      "title": "01 April 2007",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.95",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "20",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "21"
  },
  "availableOnline": true
}
