{
  "itemId": 27436501,
  "name": "\"$30 Rebate Available\"Neato XV Signature Robotic Vacuum, 945-0079",
  "salePrice": 299.99,
  "upc": "810841010768",
  "categoryPath": "Home/Appliances/Vacuums & Floor Care/Robotic Vacuums",
  "brandName": "Neato",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FNeato-XV-Signature-Robotic-Vacuum-945-0079%252F27436501%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FNeato-XV-Signature-Robotic-Vacuum-945-0079%2F27436501%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_4047",
  "reviews": [
    {
      "name": "\"$30 Rebate Available\"Neato XV Signature Robotic Vacuum, 945-0079",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "UniqueNom",
      "reviewText": "I have periodically hired a cleaning service, but they are very expensive.  Then I found someone to clean just the floors for half the price, but even that adds up. This Neato has already paid for itself in ~ 6 cleanings, and I (it) can clean much more often. \n\nWhen it arrived,  I turned “on” the batteries (the switch is under the dust bin, per the Quick Start Guide) and charged it over night as the online User Guide instructs.  It vacuums ~ 70 minutes the first time out before it is time to recharge the batteries. At that point it drives itself back to the charging base, recharges, and then goes right back to where it left off to continue cleaning.  It does that twice with subsequent cleaning times being ~50 min. each. That’s better than the reviews.\n\nThis is the astonishing thing:  Since it arrived four days sooner than expected, I had already vacuumed the house, and STILL this dust bin (about the size of a DustBuster bin) got totally full (three times) with cat fur and dust that my upright vacuum did not get. I was amazed! Since Neato is keeping the floors clean, the dust bin no longer gets that full and my allergies are better.\n\nIt was really interesting to watch how Neato \"looks\" around to \"map\" an area, then systematically goes to work.  It vacuums a room in sections, first outlining a chosen perimeter, then going back and forth in straight lines, around chairs and table legs, getting every nook and cranny, even returning to get areas that, at first, I thought it missed. Then it moves to the next section or room.\n\nNeato automatically adjusts from carpets to hard floors. It is so well-programmed that as it turns a corner, it will back up a bit so it can drive straight into an inside corner, and likewise to get the full length of an outside corner. If I have any complaint at all, it is the way it climbs up and over the legs of my recliners. I’m going to try putting a strip of that magnetic barrier on them to see if that prevents it.\n\nI told my husband Neato would make a good driver since it knows how to make “Y-turns”, and can also sway side to side backwards to get out of a tight spot. Amusingly, sometimes it backs up the wall just a bit to help itself turn around. This part is important: By watching Neato I learned where to adjust my furniture just slightly so that now I no longer have to watch it; I can trust Neato to do its thing and all I have to do is empty the dust bin, check the roller, and occasionally dust off the recessed sensors on the underside.\n\nBefore I bought Neato I spent considerable time researching various robot vacuums, watching videos, reading user reviews, good and bad, and comparing prices of the unit itself and its replacement batteries. I considered all those factors. Neato seems to have the most intelligent programming along with the strongest vacuum.  It just seemed like the most “intelligent” choice. . . for both Neato and me. I am certainly super pleased with its performance.",
      "submissionTime": "2014-03-11T12:09:00",
      "title": "Most intelligent programming plus strongest vacuum",
      "upVotes": "48",
      "downVotes": "3"
    },
    {
      "name": "\"$30 Rebate Available\"Neato XV Signature Robotic Vacuum, 945-0079",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "NeatoMan",
      "reviewText": "I had a Roomba for over 10 years for light pick up duty. When it broke, I decided to see what else was on the market...and I am glad I did! The Neato is awesome. Its suction is so much better and the room mapping system is a million times better than randomally bouncing around the space. The Neato is a tiny bit louder but since is not crashing into stuff every 5 seconds it actually is less annoying to have running in the background. I am amazed with how much stuff it actually picks up whether on carpet ot tile. It doesn't eat my bathroom throw rugs and easily makes the transitions from tile to carpet. What a great machine. Because it does such a good job...the dirt bin is filled up quickly (especially the first couple times that you use it) so you have to empty it often. My neighbor, sister and a coworker have all seen it and all three have since bought their own.",
      "submissionTime": "2014-05-10T06:58:23",
      "title": "Great vacuum!",
      "upVotes": "28",
      "downVotes": "5"
    },
    {
      "name": "\"$30 Rebate Available\"Neato XV Signature Robotic Vacuum, 945-0079",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "3"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Durability",
          "rating": "3"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "DANNEL",
      "reviewText": "Had to call because wouldn't hold charge. Reset batteries by disconnecting for 10 minutes and now takes charge. If this is a problem it should be mentioned in manual. It does work good but dust storage bin is to small. Holds 2 handfuls. Satisfied so far. Will have to see how it holds up long term. This survey should be sent out after 4 months of use.",
      "submissionTime": "2014-01-04T05:42:40",
      "title": "Works good but expensive. Need better info manual.",
      "upVotes": "16",
      "downVotes": "3"
    },
    {
      "name": "\"$30 Rebate Available\"Neato XV Signature Robotic Vacuum, 945-0079",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Durability",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "Jetskiman",
      "reviewText": "does ok but not so well when there is a space between rug and hardwood termination strip. If there is about a foot between the rug and hardwood termination strip then it would probably do a real good job. But satisfied with it anyway just for the easy stuff.",
      "submissionTime": "2013-12-29T17:33:24",
      "title": "Seems to do a good job",
      "upVotes": "13",
      "downVotes": "7"
    },
    {
      "name": "\"$30 Rebate Available\"Neato XV Signature Robotic Vacuum, 945-0079",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "lrp62",
      "reviewText": "I no longer have to vacuum my wood floors and my carpets.",
      "submissionTime": "2014-05-13T20:57:25",
      "title": "I love this",
      "upVotes": "6",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.38",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "1"
      },
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "1",
        "ratingValue": "3"
      },
      {
        "count": "6",
        "ratingValue": "4"
      },
      {
        "count": "15",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "24"
  },
  "availableOnline": true
}
