{
  "itemId": 21172345,
  "name": "\"$30 Rebate Available\" Neato XV-21 Pet and Allergy Robotic Vacuum",
  "salePrice": 249,
  "upc": "810841010270",
  "categoryPath": "Home/Appliances/Vacuums & Floor Care/Robotic Vacuums",
  "brandName": "Neato",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252F30-Rebate-Available-Neato-XV-21-Pet-and-Allergy-Robotic-Vacuum%252F21172345%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2F30-Rebate-Available-Neato-XV-21-Pet-and-Allergy-Robotic-Vacuum%2F21172345%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_4047",
  "reviews": [
    {
      "name": "\"$30 Rebate Available\" Neato XV-21 Pet and Allergy Robotic Vacuum",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "mortoncr",
      "reviewText": "The XV-21 exceeded all my expectations. I could not believe the dirt it removed from my carpet right after a thorough vacuuming with my Dirt Devil upright. It cleaned closer to the room perimeters than my upright. After the third week, the dirt bin did not fill as quickly, but I think it will take two more weeks of weekly cleanings before it can vacuum the entire home with out overflowing the dirt bin where I need to empty it during each charging session. It runs about 45 minutes on a carpeted area (roughly two rooms or 300 square feet) before requiring a 3 hour recharge, so it takes about 12 hours to vacuum my entire 1400 sq. ft. home. After about 5 weeks I should be able to leave it unattended (no longer emptying the dirt bin). If there is a drawback, it is having to frequently empty the dirt bin the first month since it is more efficient than any vacuum I ever owned and is extracting 9 years of dirt in the carpet that my other vacuums failed to remove.",
      "submissionTime": "2012-09-01T19:06:27",
      "title": "Amazing technology!",
      "upVotes": "127",
      "downVotes": "15"
    },
    {
      "name": "\"$30 Rebate Available\" Neato XV-21 Pet and Allergy Robotic Vacuum",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "Pamstress",
      "reviewText": "I still can't believe i dropped this much money.....but it is well worth it. Very high tech little gadget. cleans VERY well. easier to empty and keep clean than roombas. you will not be disappointed.",
      "submissionTime": "2012-08-29T00:41:36",
      "title": "worth the money...works better than roomba",
      "upVotes": "69",
      "downVotes": "2"
    },
    {
      "name": "\"$30 Rebate Available\" Neato XV-21 Pet and Allergy Robotic Vacuum",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "1"
        },
        {
          "label": "Meets Expectations",
          "rating": "1"
        }
      ],
      "reviewer": "ThisWarrantyisawaste",
      "reviewText": "I bought my current XV21 exactly 13 months ago with a 3 year extended warranty. It was awesome for the 1st 6 months and then it all of a sudden now after running a cycle it dies before finishing and the power light is half illuminated with unresponsive buttons, so i have to unscrew the battery compartments and unplug both batteries then it powers on and I have to reset the clock.\n\nI called Neato and they said they would send a replacement and I would pay a $25 fee. I said well I have an extended warranty so I'll just use that since there is no added fee. Well needless to say I have sent it to Asurion 3 times while waiting about 3 weeks each time to get the unit back in seemingly worse condition (dirty and more scratched) with the exact same issue. I run it 1 or 2 cycles and it is half lit power requiring a battery pull and reset.\n\nSo then I call Neato and the rep says I am 30 days past the 1 year warranty even though i called 4 months ago and they don't have any options for replacement. I said, \"So I paid $380 for a small vacuum that worked for less than 6 months? When I calculate the 2 times a week for 6 months that I ran it I paid over $10 a use. Unbelievably the Neato rep actually said \"unfortunately these vacuums don't have a long life.\" Well, I have a Roomba that is 5 years old that does my office and although it doesn't clean as thoroughly nor is as intelligent as my Neato it has gone over 500 cycles and hasn't even had the battery changed. So a durable Roomba cleans better than a smart but unreliable Neato that consistently doesn't work.",
      "submissionTime": "2014-05-07T08:45:42",
      "title": "AVOID NEATO ROBOTICS",
      "upVotes": "37",
      "downVotes": "3"
    },
    {
      "name": "\"$30 Rebate Available\" Neato XV-21 Pet and Allergy Robotic Vacuum",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Durability",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "4"
        }
      ],
      "reviewer": "Nannie49",
      "reviewText": "I am very pleased with my vacuum. No more pet hair! Can't wait until they start selling robots that do the rest of my cleaning for me. Only problem I have is that sometimes it gets confused and gets a little to friendly with my floor lamp. I just have to pick it up and put it back on track but other than that, no problems.",
      "submissionTime": "2012-11-15T03:36:00",
      "title": "15 November 2012",
      "upVotes": "29",
      "downVotes": "1"
    },
    {
      "name": "\"$30 Rebate Available\" Neato XV-21 Pet and Allergy Robotic Vacuum",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Durability",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "4"
        }
      ],
      "reviewer": "RapidTest",
      "reviewText": "Purchased this to deal with the constant shedding from 3 dogs. My home has a combination of wood floors, area rugs, and throw rugs. After 2 weeks of daily use it does works as advertised.\n\nIt's set to clean daily, however it does get 'stuck' at times requiring me to clear it's path or to clear it's brush, hence I don't leave it alone. I'm not so sure it actually follows an organized pattern, if it bumps up against a retrieved toy from the basket it may go around it, over it, or just turn around to vacuum another area. When it does get stuck, it will shut down and beep, if you can't get to it right away it will shut itself down.\n\nIt does get under furniture very well, the dust bin is easily emptied, battery lasts about 2 hours of continuous cleaning, the boundary marker is pliable enough to be curved, when it needs assistance the display will say please and thank you. Maintenance on the brush is same as an upright. Unlike the upright vacuum, none of the dogs bark at it, instead they ignore it. Yes, it is noisy, but not as noisy as my Hoover upright if left on for an hour. I haven't noticed an scratches or other marks on the wood floor from using it, nor has it sucked up a throw rug because of a loose string.\n\nDuring the first couple of day of use the dust bin had to be emptied a couple of times per cycle, now it's emptied at the end. It doesn't pick up every bit of dust, my upright still gets a weekly workout but the house feels and looks cleaner. For me, Gladys, (yep I named it) was a good investment.",
      "submissionTime": "2012-12-22T07:34:17",
      "title": "22 December 2012",
      "upVotes": "43",
      "downVotes": "12"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "3.98",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "25",
        "ratingValue": "1"
      },
      {
        "count": "9",
        "ratingValue": "2"
      },
      {
        "count": "6",
        "ratingValue": "3"
      },
      {
        "count": "47",
        "ratingValue": "4"
      },
      {
        "count": "96",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "183"
  },
  "availableOnline": true
}
