{
  "itemId": 35309283,
  "name": "\"$50 Rebate Available\" Neato XV Essential Bagless Vacuum, 945-0016",
  "salePrice": 199,
  "upc": "810841011468",
  "categoryPath": "Home/Appliances/Vacuums & Floor Care/Robotic Vacuums",
  "brandName": "Neato",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252F50-Rebate-Available-Neato-XV-Essential-Bagless-Vacuum-945-0016%252F35309283%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2F50-Rebate-Available-Neato-XV-Essential-Bagless-Vacuum-945-0016%2F35309283%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_4047",
  "reviews": [
    {
      "name": "\"$50 Rebate Available\" Neato XV Essential Bagless Vacuum, 945-0016",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "plamonds",
      "reviewText": "I'm a mom of 3 and I find myself constantly vacuuming our house. I am always lugging out our bulky upright vacuum and taking time out of my day to vacuum up the endless piles of sand, crumbs, stickers, etc. in the kitchen, bathroom, and family room. The Neato has made it super easy (and fun) to have clean floors on a daily basis. It's easy to program, easy to clean and most of all it gets into places I typically have to get down on my hands and knees to reach with my regular vacuum. I run it every day and it's always done a great job. My kids love it, too, referring to it as their robot named, Beep-Boo. I definitely recommend the Neato to anyone who enjoys clean floors!",
      "submissionTime": "2014-05-15T21:24:50",
      "title": "Time saving, effortless vacuum",
      "upVotes": "46",
      "downVotes": "9"
    },
    {
      "name": "\"$50 Rebate Available\" Neato XV Essential Bagless Vacuum, 945-0016",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "vhan604",
      "reviewText": "I love it! Not only it turns my least favor house cleaning project into a fun one (just pressing the a button and the whole floor is vacuumed while I'm out dinning with family). It saved me few hours to spend more quality time with my baby daughter and my family. As a working mom, this is a truly valuable, innovative product. Now I can't live without my iphone and neato!",
      "submissionTime": "2014-04-15T13:35:13",
      "title": "Time saving machine!",
      "upVotes": "24",
      "downVotes": "0"
    },
    {
      "name": "\"$50 Rebate Available\" Neato XV Essential Bagless Vacuum, 945-0016",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "ggage1050",
      "reviewText": "Pros: Does a great job cleaning. Maps out room and cleans 95% each time. Really picks up dust, hair, and debris. Cleans about half of house on single charge. Programmable to go when not home. Does not bump and go like some robots, doesn't hit furniture. Returns to base to recharge or when done. Named it Rosie after the Jetson's maid.\n\nCons: Too small of bag tray. Have to empty after half of house, maybe your home is not as dirty! Really loud, but great suction. Sometimes gets hung up on thick rug. Wish it would talk when it needs it tray emptied.",
      "submissionTime": "2014-11-18T18:16:22",
      "title": "Wife made me buy it...for once she was right!",
      "upVotes": "27",
      "downVotes": "5"
    },
    {
      "name": "\"$50 Rebate Available\" Neato XV Essential Bagless Vacuum, 945-0016",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "TheyCallMeMiguel",
      "reviewText": "I'm a bit of clean-freak, so vacuuming multiple times a week is a must. But it takes time to vacuum a 2,400 sq. ft. house, and I really don't have the time needed to truly keep my carpet and tiles clean at all times. Add in the fact we have a 70+ lb. Labrador Retriever who sheds and you can see why I was ready to go the robot vacuum route. Enter the Neato XV Essential.\n\n• Setup is a cinch and takes mere minutes to complete. They say to charge the vac overnight, but I was able to use it almost immediately since the charge bar was full upon setup.\n• The Neato takes a few initial runs to get used to the layout of your house, but seems to run quite seamlessly. Although I should note that it’s quite loud on tile floors (carpet is relatively quiet). I purchased the pet and allergy upgrade kit (new brush and filter) and the noise was greatly reduced.\n• The Neato will take itself back to the charger base when the battery is ready to be recharged. Once the battery is charged, it picks up where it left off and continues to vacuum the rest of your house.\n• Battery life on a full charge is roughly 1 hour. My 2,400 sq. ft. home takes a good three battery cycles to complete.\n• The instructions weren't kidding when they said to completely pick up your floor. If not, the Neato will get things stuck in its brush that will require you to remove before it continues.\n• It's important to note that the Neato dirt container isn't overly large, which means that you'll need to empty it every couple of cycles (maybe more if you have a shedding dog). But there's no chime that lets you know when the dirt bin is full, so you'll have to check the actual device every so often (it tells you on the screen). If you're at home most of the time, this isn't a problem. But this is definitely something to keep in mind if you plan to run the Neato while you're away for an extended period of time.\n• Overall, I love this robotic vacuum. It truly is a time-saver and keeps my floors looking clean every day.",
      "submissionTime": "2014-06-20T12:29:27",
      "title": "My floors are always clean!",
      "upVotes": "22",
      "downVotes": "5"
    },
    {
      "name": "\"$50 Rebate Available\" Neato XV Essential Bagless Vacuum, 945-0016",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "MysteryShopper22",
      "reviewText": "This vacuum fits into places where your traditional vacuum won't. It's a great time saver and is very powerful for its size. It's easy enough for my kids to use while cleaning their rooms. I'd recommend this to anyone.",
      "submissionTime": "2014-04-16T10:20:36",
      "title": "My Favorite Vacuum!",
      "upVotes": "19",
      "downVotes": "3"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.03",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "1"
      },
      {
        "count": "2",
        "ratingValue": "2"
      },
      {
        "count": "3",
        "ratingValue": "3"
      },
      {
        "count": "7",
        "ratingValue": "4"
      },
      {
        "count": "20",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "36"
  },
  "availableOnline": true
}
