{
  "itemId": 23454545,
  "name": "Asus VN247H-P 23.6\" LED LCD Monitor - 1 ms",
  "salePrice": 189,
  "upc": "886227275229",
  "categoryPath": "Electronics/Computers/Monitors",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FAsus-VN247H-P%252F23454545%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FAsus-VN247H-P%2F23454545%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_3951_110915",
  "reviews": [
    {
      "name": "Asus 24\" Widescreen LED Monitor (VN247H-P Black)",
      "overallRating": {
        "label": "Overall",
        "rating": "2"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "3"
        },
        {
          "label": "Meets Expectations",
          "rating": "1"
        }
      ],
      "reviewer": "Ricco9090",
      "reviewText": "I purchased this monitor after reading some good reviews. I would have to agree that this monitor has a great picture both in sharpness and color. When my son first saw how vivid the picture was compared to our old monitor, he thought that the image we were looking at was in 3d. However I noticed after setting it up that there is lots of bleed over from the backlighting at the bottom of the screen. Whenever I have a dark image, I can see a 2 inch blue splash of color. For normal Windows use it probably won't be noticeable but if you plan on watching movies or games with dark scenes, it will probably be pretty distracting.\n\nIn doing some research, it sounds like this isn't too uncommon for monitors but it seems like ASUS monitors are known for having issues with this. I may have just gotten a bad one so your results may vary. I'm still debating whether I want to return it or not.",
      "submissionTime": "2013-07-26T19:18:46",
      "title": "Nice Sharp Picture, Not So Nice Blue Bleedover",
      "upVotes": "22",
      "downVotes": "2"
    },
    {
      "name": "Asus 24\" Widescreen LED Monitor (VN247H-P Black)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Compuphil",
      "reviewText": "Initially was going to return it because I thought it was too large for my desktop. In addition I was concerned about the reviews from several websites. Bright pixels, missing pixels, blue bleed along the bottom edge, etc. BUT, it is perfect in every way. I especially like the thin bezel for my multiple monitor setup. Walmart has an excellent return policy so you can't go wrong in ordering from them. The attached picture is the monitor on the bottom. The top 2 monitors are Asus VE208T which Walmart also sells. Also you cannot beat the prices at Walmart.\nClick on the picture on the right to expand it.",
      "submissionTime": "2014-01-06T17:43:57",
      "title": "WOW GREAT RESOLUTION",
      "upVotes": "8",
      "downVotes": "1"
    },
    {
      "name": "Asus 24\" Widescreen LED Monitor (VN247H-P Black)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Intralux",
      "reviewText": "I searched high and low for a good quality LED backlit flat panel monitor with a slim bezel. The ASUS VN247H-P was the final choice, and it delivered. It is not only aesthetically pleasing, but also well designed in terms of functionality and practicality.\n\nFor some odd reason, currently (Spring 2013) most flat panel manufacturers are omitting VESA mounting capabilities on panels with a narrow frame, so options are as slim as these panels! This ASUS is one of the only ones with the best of both. The frame is less than 1 cm wide all the way around, AND it has VESA 100 mm mounting compatibility. This was particularly important for me because my setup requires 2 arm-mounted monitors, and when using 2 panels side by side, it's nice to have as little frame between them as possible for a more continuous display. The panel also has a a very narrow depth and is light weight (roughly 8 lbs I believe).\n\nEqually as important, the picture quality is top notch, and with just a little adjustment of brightness/contrast/color preference, you should be good to go. The extremely high dynamic contrast ratio and ultra fast response time should be more than ample for any application. ASUS was also kind enough to include a DVI-to-HDMI cable in the box in addition to the VGA cable, since the panel has 2 HDMI + 1 VGA inputs. I'm using a video card that has 1 HDMI and 1 DVI output, so this was extremely helpful, and the resulting picture on each of my 2 displays is identical despite the varying connections.\n\nOn the down side, the monitor is a little more expensive than I would have preferred, but you get what you pay for. The other downside was I had to return the first 2 I bought and order 2 new ones because clearly quality control in the US has gone downhill. One display had multiple dead pixels, and the other physical blemishes all over the frame/screen. They weren't packed all that well for protection, and I'm sure all the transit did not help any. The second 2 were fine. To be fair, the same exact thing happened with 2 monitors I had purchased from another brand, but the reason I didn't buy 2 more of those was because the construction quality felt like a child's toy compared to the ASUS. I only mentioned this to say don't be discouraged if you have similar bad luck the first round. In the end, it's worth it.\n\nWalmart service was helpful and I did not lose any money in the process of the return/repurchase using Site to Store shipping. If you're looking for a panel for similar reasons to mine, look no further than this ASUS VN247H-P 23.6\" LED.",
      "submissionTime": "2013-04-23T14:33:09",
      "title": "One of the best narrow bezel LED's available.",
      "upVotes": "10",
      "downVotes": "4"
    },
    {
      "name": "Asus 24\" Widescreen LED Monitor (VN247H-P Black)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Pinyachta",
      "reviewText": "This was a replacement for a 2 year old Samsung 2333T LCD monitor that burned out its inverter/transformer. The Samsung used fluorescent back lighting. The Samsung was a replacement for a another fluorescent monitor that blew a capacitor in the back lighting power supply. The main reason I went with the Asus VN247H-P was that it is LED backlit, which doesn't require a high voltage and unreliable power supply to operate. However, I find the brightness difference is quite noticeable and makes its use more pleasant. Also the backlighting is more uniform. Set up is fairly easy, but I found the default resolution too high for easy reading and had to use Win's \"My Settings\" to reduce it. The stand is a little flimsy compared to the Samsung's. but I can live with it. Given my experience with past monitors I found ASUS’s 3 year warranty a big plus, too..",
      "submissionTime": "2013-08-29T06:14:30",
      "title": "Bright, fast, reasonably priced moitor.",
      "upVotes": "7",
      "downVotes": "5"
    },
    {
      "name": "Asus 24\" Widescreen LED Monitor (VN247H-P Black)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Pewdiepies",
      "reviewText": "I have had this monitor for a little over 2 months and it is spectacular. If you are a game this has 5MS which is pretty close to the best you will get for monitors! 1080P videos look amazing! Highly recommend! Bro Fist!",
      "submissionTime": "2014-05-25T22:26:22",
      "title": "AMAZING!!!",
      "upVotes": "5",
      "downVotes": "3"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.51",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "1"
      },
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "7",
        "ratingValue": "4"
      },
      {
        "count": "27",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "37"
  },
  "availableOnline": true
}
