{
  "itemId": 34426658,
  "name": "Baby Trend Expedition Jogger Travel System, Electric Lime",
  "salePrice": 183.11,
  "upc": "090014016760",
  "categoryPath": "Baby/Car Seats/See all Car Seats",
  "brandName": "Baby Trend",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FBaby-Trend-Expedition-Jogger-Travel-System-Electric-Lime%252F34426658%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FBaby-Trend-Expedition-Jogger-Travel-System-Electric-Lime%2F34426658%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "5427_91365_999379",
  "reviews": [
    {
      "name": "Baby Trend Expedition Jogger Travel System, Electric Lime",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "KristanGraham",
      "reviewText": "We love this travel system stroller. It turns easily and is able to handle rougher terrain and not get stuck, like cracked sidewalks, grass, and even gravel. The MP3 hookup with speakers is also a great added feature, we can hook up our phones and play music through our phones! It is easy to collapse and is lightweight. A must have for your new bundle of joy!",
      "submissionTime": "2014-04-27T14:14:31",
      "title": "Must have travel system",
      "upVotes": "29",
      "downVotes": "10"
    },
    {
      "name": "Baby Trend Expedition Jogger Travel System, Electric Lime",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Wifemama3",
      "reviewText": "Love the lime green color.very easy to put together and car seat is great was nice for my newborn and stroller pushes smooth very happy :)",
      "submissionTime": "2014-04-19T17:01:53",
      "title": "Great jogger system!",
      "upVotes": "17",
      "downVotes": "1"
    },
    {
      "name": "Baby Trend Expedition Jogger Travel System, Electric Lime",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "Jennifer0003",
      "reviewText": "my experience/observations of the Baby trend expedition jogging stroller travel system in electric lime\nPros:\n-lockable front wheel, lock for jogging & unlock for awesome maneuverability in stores.\n-peekaboo window that can be held in place if needed-other strollers I looked at had the window but no way to keep it up with out holding it, I like to be able to check on my baby with just a glance.\n-amazing shade coverage. With the stroller sunshade and car seat canopy baby can be completely concealed and blocked from the sun/rain. An added bonus is the sunshade can be flipped toward the front if you are walking into the sun.\n-comfortable handle grip on both the stroller and car seat. <3 the triangle handle, it makes carrying the seat SO much easier as you have more than one position to carry it in.\n- construction seems sturdy, not to overly plastic feeling and seemingly durable fabric (haven't had any serious messes-yet)\n-nice gender neutral colorway. The electric lime color is reminiscent of a green highlighter, but not overly bright; Just enough to stand out in the sea of baby strollers!\n- the styling is nice, doesn't scream baby gear! I'm not one for all the Winnie the Pooh, Mickey/Minnie mouse or the likes of themed baby items.\n-easy to fold/open. It practically folds itself down when the folding tabs are pulled, just pull it apart and it pops back open.\n- additional car seat bases are available for purchase, so the car seat can easily go in either my car, hubby's or grandma's cars without having to fuss with only having one car base.\nCons:\n-My stroller sunshade makes a horrible noise when being folded out, it wakes/startles the baby with a ratcheting toy machine gun like noise! I am hoping to find a way to fix this; perhaps it will get quieter with further use or lubrication? The display model did not have this issue, and may have been my \"luck\".\n- Sometimes the car seat gets stuck on one side of the stroller and is difficult to unlatch. When it happens I have to re-latch the other side pull the red release lever (on the car seat) and be very careful to bring both sides up at the same time.\n- My car seat did NOT come with the manual!!!- Something I find annoying since they even attach a special tag to the car seat detailing where the manual should be (on the backside of the seat)... I have yet to contact Baby Trend and see about if I can have on sent to me, so I cannot say how helpful they might be on this situation.\nNot a super annoyance but kind of a bummer:\n- This model does not come with a handheld tire pump like some previous models. I think it would be handy have a pump includes for when traveling. I may just buy a small basketball pump for this purpose.\n-The stroller is a tight squeeze in some cars- it barely fits in my '08 Malibu,but fits fine in my hubby's '12 Cruze. The fit issue seems to be greatly affected by the trunk opening- the Cruze has a larger opening therefore is easier than my car which the stroller can only go in one way. The rear wheels can come of if needed, just press a button by the wheel to remove and push back in place to reassemble.\n- This model does not have the speakers-not a concern of mine just thought I'd mention it since it is detailed as having them in some other reviews.\nOverall I like this stroller, and it seems worth the investment. I only wish it did not make such noise when moving the sunshade. The issue with fitting into the trunk is a bit disappointing, but something that could possibly be resolved if the store lets you take the display outside and check the trunk spacing--- I was not permitted to do such.\nHope this helps!",
      "submissionTime": "2014-05-24T15:30:37",
      "title": "observations on the Baby Trend jogger",
      "upVotes": "14",
      "downVotes": "1"
    },
    {
      "name": "Baby Trend Expedition Jogger Travel System, Electric Lime",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "AZMommy221",
      "reviewText": "My little man was born Apirl 7th,2014 and he is so comfortable in it!!! We absolutely love it :)",
      "submissionTime": "2014-04-29T03:21:10",
      "title": "I brought my little one home in this :)",
      "upVotes": "15",
      "downVotes": "3"
    },
    {
      "name": "Baby Trend Expedition Jogger Travel System, Electric Lime",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "FitnessMommy120912",
      "reviewText": "My husband and I shopped around for weeks looking for the perfect travel system. We love this one! Super easy to get in and out of the car. Wheels on the stroller are awesome, we are a very active family and this is perfect for going on dirt tails. The speakers come in handy too when you want to jam out with your little one. Plus, since the wheels are rubber not plastic it gives us extra comfort on those rainy days and you need to maneuver on the sidewalk.",
      "submissionTime": "2014-05-08T11:49:18",
      "title": "A Must Have!",
      "upVotes": "13",
      "downVotes": "1"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.67",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "1",
        "ratingValue": "3"
      },
      {
        "count": "12",
        "ratingValue": "4"
      },
      {
        "count": "37",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "51"
  },
  "availableOnline": true
}
