{
  "itemId": 26805131,
  "name": "Brother 17 Stitch Sewing Machine, JX2517",
  "salePrice": 74.97,
  "upc": "012502635482",
  "categoryPath": "Party & Occasions/Crafts/Sewing Machines & Accessories/Sewing Machines",
  "brandName": "Brother",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FBrother-17-Stitch-Sewing-Machine-JX2517%252F26805131%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FBrother-17-Stitch-Sewing-Machine-JX2517%2F26805131%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "2637_667479_1094704",
  "reviews": [
    {
      "name": "Brother 17 Stitch Sewing Machine, JX2517",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Kat345",
      "reviewText": "I purchased the Brother JX2517 in-store today. I took it home and it already had the bottom bobbin wound and in place, and a standard size needle 14 in place. It was very easy to operate and sewed a very good stitch. I like the fact that it is a lightweight machine, yet it can handle heavy fabrics. It has a double lift on the needle presser foot bar for thick materials.\nI was surprised that it had \"preset stitches\". So, there is no fiddling with length or width dials.\nIt has 3 very nice satin stitches and something called Double Action Stitches 16, 17 for joining two pieces of fabric like in patchwork quilting. It has a left needle position stitch and also comes with a button hole making foot and button foot, and zipper foot.\nThis will be the machine I will take to quilting class. The sewing area seems extra large, yet it also has a free arm for hemming.\nI like The Brother Sewing machines and this one is one of the prettiest and easiest machines I've seen.",
      "submissionTime": "2013-10-01T16:54:19",
      "title": "Wonderful!",
      "upVotes": "562",
      "downVotes": "72"
    },
    {
      "name": "Brother 17 Stitch Sewing Machine, JX2517",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "LAMom318",
      "reviewText": "I have always wanted to learn how to sew, and when I was a child I dreamed of starting my own fashion line! So, I started sewing about 6-8 months ago (mostly just to start a new hobby) and was using my mother-in-law's machine. It was an old Singer. Within a week I knew I wanted my own machine because I was LOVING making clothes, and I knew eventually she was going to need her machine back. My husband bought me this one for Christmas and it is wonderful! It is so much quieter than the older machine I used, has more of a stitch selection, and it doesn't mess up on me like the other one did. (At least not yet!) It took some getting used to at first, but I really love it. I have already made 3 dresses and a shrug for our daughters! The stitches are holding up wonderfully (even with my rough and tough toddlers!), and the dresses are so cute. It definitely does the job, and I have already recommended it to a friend!",
      "submissionTime": "2013-12-30T12:06:28",
      "title": "This is wonderful!",
      "upVotes": "381",
      "downVotes": "58"
    },
    {
      "name": "Brother 17 Stitch Sewing Machine, JX2517",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Gabsygrl",
      "reviewText": "I am very happy with my purchase. I was apprehensive at first because I thought that at the price it would be a one time use type of product. However, I have been pleasently suprised. The manual is very easy to read.",
      "submissionTime": "2013-10-02T06:09:31",
      "title": "02 October 2013",
      "upVotes": "104",
      "downVotes": "21"
    },
    {
      "name": "Brother 17 Stitch Sewing Machine, JX2517",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "shanners64",
      "reviewText": "I'm so glad I decided to order this machine. This is my first sewing machine and so far I haven't run into any problems at all. I've been using it almost everyday since it arrived. The included instructional DVD is really helpful.",
      "submissionTime": "2013-11-12T13:02:38",
      "title": "First Sewing Machine, meets expectations.",
      "upVotes": "96",
      "downVotes": "20"
    },
    {
      "name": "Brother 17 Stitch Sewing Machine, JX2517",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "TwoGulls",
      "reviewText": "I bought this as a gift for my 9 year old daughter who has expressed an interest in sewing. She has used her grandmother's Brother Sewing Machine (which is truly built like a tank!) and we felt comfortable buying the same brand name. The bobbin came pre-loaded and after reading the directions, we were up and running in 30 minutes. I LOVED the fact that this machine has a drop-in bobbin rather than the old style where you had to load the casing and clip it back into place. Plus, the clear see-through window lets you know when the bobbin is running low....rather than finding out the hard way. I did have someone nearby to help in case of trouble, but the machine was so easy to use that we didn't need it! The pictorials on top of the machine help as well. My daughter was up and sewing for her sister's costume in no time! I think I may have found my new hobby. Would highly reccommend to anyone who needed a good, basic machine to start a wonderful new hobby.",
      "submissionTime": "2013-11-18T05:02:30",
      "title": "Easy to operate, great for beginners!",
      "upVotes": "235",
      "downVotes": "75"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.59",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "13",
        "ratingValue": "1"
      },
      {
        "count": "4",
        "ratingValue": "2"
      },
      {
        "count": "5",
        "ratingValue": "3"
      },
      {
        "count": "54",
        "ratingValue": "4"
      },
      {
        "count": "239",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "315"
  },
  "availableOnline": true
}
