{
  "itemId": 16419982,
  "name": "Camillus 6.5'' Marlin Spike Folding Knife 18670",
  "salePrice": 28.45,
  "upc": "016162186704",
  "categoryPath": "Sports & Outdoors/Outdoor Sports/Hunting/Knives & Tools",
  "brandName": "Camillus Knives",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FCamillus-7-Carbonitride-Titanium-Folding-Knife-with-G10-Handle-and-Marlin-Spike%252F16419982%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FCamillus-7-Carbonitride-Titanium-Folding-Knife-with-G10-Handle-and-Marlin-Spike%2F16419982%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4125_546956",
  "reviews": [
    {
      "name": "Camillus 7\" Carbonitride Titanium Folding Knife with G10 Handle and Marlin Spike",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "SaltyHobo",
      "reviewText": "Like many of you, I have owned countless knives. To me, a knife is a tool and I have no room for collectables. I use them hard and I expect them to perform as advertised. I also expect to pay for quality. Price is the only thing that shocked me regarding this knife. It is easily worth twice the price I paid.\n\nI needed a good knife for sailing, and the knife had to stand up to salt water and be able to survive being wet and salty for a a few days at a time before being cleaned. I fully expected some corrosion, and for forty dollars I was willing to replace the knife seasonally.\n\nAfter several months, all I have to say about this knife is \"get one.\" This knife rides in my pocket with a 550 cord lanyard that I easily attach to the locking bale with a spring clip. This knife has been soaked repeatedly with salt water and dried on its own in my pocket. Yes, that is a recipe for rust and I knew it. I wanted to know what this knife would stand up to.\n\nI regularly use this knife to cut 1/2\" doublebraid, three strand nylon, and I have even cut 14ga copper wire. (Why did I cut copper wire with it, you ask? Necessity. I was on my belly in the bilges- which took no small amount of effort to get where I was. I didn't have my wire cutters, but I had this knife.... no problem. I inspected the blade after cutting the wire and it didn't even roll the edge. No marks on the black finish. A+ grade for this knife as far as I'm concerned.)\n\nThe knife comes fairly sharp. It has the typical factory edge which was done with a grinder / sander. This is actually a good thing on a knife designed for cutting rope. You don't want a mirror-polished edge on a knife like this. You want a fine, but toothy edge to rip through rope using a draw (pull) cut. The knife edge had no burrs and wasn't ragged, just toothy. Perfect.\n\nIn all it's use, I have dressed the edge one time (!) using a medium grit ceramic stone. I did not finish it on the fine because I want that toothy edge. The steel (VG10) has proven to me it will stand up just fine like this. It is hard steel, but not brittle.\n\nThe marlinspike has performed wonderfully. It is the perfect size for knot work using 550 cord and has opened a number of shackles I couldn't turn with my hands. I use it for making eye splices and getting out frozen knots.\n\nThe scales (the handle) are top notch and provide great non-slip grip with wet hands.\n\n___\n\nresults of my salt water testing:\n\nAfter several months, during which I have NOT CLEANED THIS KNIFE even once, there is a tiny bit of corrosion where the thumb-opening knob is affixed to the blade. Probably where the coating didn't get into the crack, or possibly there is some solder there that is corroding.\n\nHad I attempted to flush this knife with fresh water even once in a while, I have no doubt that there would be zero corrosion.\n\nI can't rate this knife highly enough. It is a solid, dependable performer.",
      "submissionTime": "2012-07-13T11:58:29",
      "title": "Camillus Marlinspike knife is a winner",
      "upVotes": "7",
      "downVotes": "0"
    },
    {
      "name": "Camillus 7\" Carbonitride Titanium Folding Knife with G10 Handle and Marlin Spike",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "flocamp",
      "reviewText": "good blade, stays sharp.\n\nMarlin spike is perfect works great for camping, paracord knots are often troublesome.",
      "submissionTime": "2014-07-10T14:08:49",
      "title": "great knife",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Camillus 7\" Carbonitride Titanium Folding Knife with G10 Handle and Marlin Spike",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "CaptJohn",
      "reviewText": "This knife is very high quality. I have owned one for about 6 months prior to buying my second one. I only have bought the second to ensure if the first wears out or I lose it, I still have another. The blade holds a great edge!!",
      "submissionTime": "2015-03-04T16:52:02",
      "title": "Marlin Spike Knife",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Camillus 7\" Carbonitride Titanium Folding Knife with G10 Handle and Marlin Spike",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "wekjnbadgouiaernfkjaernas",
      "reviewText": "I really like this knife. Priced right and only the functions I need. This is not my EDC knife, but is a great special purpose knife. If you find yourself working with rope, webbing, etc. then this knife is for your. Both marlin spike and blade lock in place. Handle has a nice slip resistant texture. The VG10 steel blade is more than adequate for most people.",
      "submissionTime": "2015-01-16T09:00:25",
      "title": "Not an EDC knife, but a great knife anyway",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "5",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "5"
  },
  "availableOnline": true
}
