{
  "itemId": 15601090,
  "name": "Classic Accessories Colorado 9 ft. XT Pontoon Boat - Pumpkin",
  "salePrice": 558.71,
  "upc": "052963697742",
  "categoryPath": "Sports & Outdoors/Outdoor Sports/Fishing/Boats",
  "brandName": "Classic Accessories",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FClassic-Accessories-Colorado-XT-Pontoon-Boat-Pumpkin%252F15601090%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FClassic-Accessories-Colorado-XT-Pontoon-Boat-Pumpkin%2F15601090%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4125_546956_111667",
  "reviews": [
    {
      "name": "Classic Accessories Colorado XT Pontoon Boat, Pumpkin",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "FishinCarolinas",
      "reviewText": "The boat took about an hour the first time I put it together. I actually bought one of these for my buddy who fishes with me so the 2nd time it only took like 15 minutes. It's pretty darm simple to put together.\n\nOverall, the boat is perfect for someone looking to get out in the coves, ponds, or lightly traveled lakes. I bought the Minkota 30# thrust troller for the boats and they work perfectly for getting you around the lake without having to paddle. I don't even have the oars on my boat at this point. (hopefully the motor doesn't break while I'm on the water.# It's a very strudy boat, you feel comfortable and secure on it. The frame is sturdy and you can tell it's not made cheeply. You can adjust the foot rests to fit your body frame so you can really set this thing to your size.\n\nMy biggest suggestion for buyers of this boat:\n\n1. The seat for me sits too low to the water. When you're fishing it's better to be above the boat casting down at the water. So I purchased a 8\" pedestal that swivels #the swivel seat is key) from Wal-Mart in the store, so now I am 8\" higher and I can turn my seat as the boat turns. It's so light in the water that if you're reeling in a crank or spinner, the boat will actually turn towards your lure. The swivel seat is crucial to be comfortable in this thing for any extended periods of time...ESCPECIALLY if you're using a trolling motor. It makes it that much simpler to be able to turn back towards the troller handle to control the boat and speed. If you don't do this at first, you eventually will.\n\nMy only other critique of this boat is the seat. It's comfortable enough but it leans back to far. You're not sitting upright when you're casting if you lean back into the seat, you're more like in a slight recliner position - I personally like to be upright when I'm reeling. All I did was put a folded up rag under where the seat and the seat frame meet when it folds and that keeps the seat propped up for me. Easy enough fix but thought it was worth mentioning.\n\nI shopped quite a few different boats of this type and even Kayaks. For the weekend Angler and if you're not wanting to put a ton of money into a \"real\" boat, this is definitely a good buy. I think the price point is on on par with what you're getting.\n\nAlso - the side bags and stuff they give you are really nice. They are super durable and you can make good use of them with your tackle, etc.\n\nSuper impressed with the quality and really have no complaints at all. Nice work, Classic Accessories!",
      "submissionTime": "2012-06-28T13:04:55",
      "title": "Happy overall - Some tips for this boat",
      "upVotes": "60",
      "downVotes": "0"
    },
    {
      "name": "Classic Accessories Colorado XT Pontoon Boat, Pumpkin",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "drbob1984",
      "reviewText": "Assembly was easy, instructions were spot on. Wheel that came with boat, the tire would not inflate. Contacted manufacturor, no hassles, had new wheel in about 4 days. Boat is set up great for fishing on lake or small streams. Easy inflate/deflate, transports easily when deflated. Tire makes moving when inflated easy.",
      "submissionTime": "2012-07-22T13:47:48",
      "title": "22 July 2012",
      "upVotes": "14",
      "downVotes": "0"
    },
    {
      "name": "Classic Accessories Colorado XT Pontoon Boat, Pumpkin",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "youngfisherman",
      "reviewText": "This is my recent reviewed on the used of this Colorado XT Pontoon Boat, my order came in on late Thursday night and I am so excited to open it an read all the safety warning throught the manuel. The first available Saturday I took it out to Lake Murray in San Diego I had alot of fun with it. It handle very well, I caught my first 3,8 large mouth bass with it. Upon comming toward the on comming fast boat this pontoon handles very well, at first I would expect it to rock back and forth alot but it didn't. It just swade to the side and balance out against the on comming wave. Over all I would give this boat a 5 star. The only dislike about this product from classic accessories, for the amount of money that we spend. Classic Accessories can't even provide a nice storage case especially to protect the the pontoon blader it self.",
      "submissionTime": "2013-03-07T22:04:30",
      "title": "Bang For Your Buck",
      "upVotes": "14",
      "downVotes": "4"
    },
    {
      "name": "Classic Accessories Colorado XT Pontoon Boat, Pumpkin",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "FishingMike",
      "reviewText": "I had looked at this for the past 3 years wondering if I would really use it. This year, I got it and LOVE IT. Just came off the Spring River for a Fathers Day weekend and limited out each fishing session I enjoyed.\nThe Colorado XT has everything you need within arms reach. From preparing flys to reeling the fish in & netting them, there's no strain here. I did learn a few things while using the boat for the first time.\n#1. Purchase a swivel for the seat so you can turnaround easier to get to things you have stored behind you.\n#2. Purchase an air gauge so you can easily monitor air pressure in pontoons. In direct sun, it's easy to inflate early in the morning & let air out during the day as the temps rise.\n#3. If fishing in current, it might be best to use lead in your weigh bag or to purchase a small hook anchor. I did a little bit of sliding on the bottom with my weight bag until I put alot more weight in the bag. I could save on weight & get a hook anchor.\n#4. Make sure you put the pin in when storing the wheel in it's holder while floating.. I learned to lock it in after I saw it floating past me. They provide the pin on an elastic cord.. I just didn't use it at first. I do now.\n#6. Approx 500 people floating past me on the river LOVED this thing... Everybody wanted one.\n#7. Do a Dry Run of putting the boat together. After the first time.. it's a breeze. The 1st time took longer as everything is new, tight and unknown.\n#9. Storage is easy. I kept the box mine came in & use it in a single bay of the basement in my motorcoach.\n#10. If you're wondering if the wheel is worth it... You can bet it is.. It makes getting to and out of the water much easier. By the time you load this boat up, it's well over 100 lbs. The wheel gives you the control you need.",
      "submissionTime": "2013-06-17T06:17:57",
      "title": "This is a great product .... especially for price!",
      "upVotes": "6",
      "downVotes": "0"
    },
    {
      "name": "Classic Accessories Colorado XT Pontoon Boat, Pumpkin",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "rosebud32",
      "reviewText": "We use these on the New River and the Greenbrier River in WV. They're perfect for a good float! This will be our 4th one. We have to have enough for everyone!! Can't wait for Summer time to get here to put this one together and get out on the river to catch some fish.",
      "submissionTime": "2014-03-16T19:11:28",
      "title": "Great for a river float!",
      "upVotes": "4",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.81",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "3",
        "ratingValue": "4"
      },
      {
        "count": "13",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "16"
  },
  "availableOnline": true
}
