{
  "itemId": 24849758,
  "name": "Clearstream 2V-J3",
  "salePrice": 99.99,
  "upc": "817848011477",
  "categoryPath": "Electronics/TV & Video/TV Accessories/TV Antennas",
  "brandName": "Clearstream",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FClearstream-2V-J3%252F24849758%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FClearstream-2V-J3%2F24849758%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_1060825_133270",
  "reviews": [
    {
      "name": "Clearstream 2V-J3",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Moppel",
      "reviewText": "I had tried another antenna twice the size from Radio Shack and I was not able to pick up some of the station (e.g. PBS/KLRN). I live outside of San Antonio and more than 29 miles away from any transmitting TV station. After I installed this Antenna in my attic I received all the channels that we are supposed to get according to AntennaWeb.org (NBC, ABC, CBS, FOX, PBS, Ion, etc.). The weakest signal is 87% according to my TV setup meter. I can highly recommend this antenna. I'm also impressed with Walmart that they chose to sell this one in their stores (and could have chosen from dozends of others).",
      "submissionTime": "2013-07-03T11:54:09",
      "title": "An exceptional good antenna",
      "upVotes": "108",
      "downVotes": "8"
    },
    {
      "name": "Clearstream 2V-J3",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "icemanto",
      "reviewText": "AMAZING I HAD AN AMPLIPFIED INDOOR AND GOT 12 CHANNELS, INSTALLED THIS AND GOT 30 PLUS CHANNELS, ALL INSIDE, I PLAN TO PUT IT ON THE ROOF LATER. I GET MORE CHANNELS INSIDE THAN I DO ON A ROOF ANNTENNA ON MY GARAGE. I ALMOST RETURNED IT BECUASE IT DID NOT LOOK LIKE IT COULD DO THE JOB, I READ THE ONE REVIEW & TRIED IT AND WAS DELIGHTED",
      "submissionTime": "2013-07-13T15:37:18",
      "title": "13 July 2013",
      "upVotes": "79",
      "downVotes": "10"
    },
    {
      "name": "Clearstream 2V-J3",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "getaway18",
      "reviewText": "Im located on the shoreline area of connecticut and had trouble getting stations other than ABC(which is located local and you can get with most basic antennas). I tried several other antennas with no luck and before getting on of the huge ones wanted to give this a shot.\n\nFirst, I want to say I tried at least 5 mounting locations that did not get me much based off what antennaweb.org said about aiming. I was pointing directly at where the hartford stations and getting nothing. Then, I decided for the heck of it to aim at long island. After changing direction a few times I was able to get ABC in ct and Nbc, Cbs, ion, qubo, bounce, but no fox. For the money and the fact that I have a 1st floor apartment surrounded by trees I think it does a very good job. It is mounted outside on the rail of my deck fyi.\n\nSo, just use a map, take some time to aim, and you will be watching primetime for free in no time.",
      "submissionTime": "2013-08-12T20:26:08",
      "title": "Once you aim it right everything works fantastic",
      "upVotes": "42",
      "downVotes": "11"
    },
    {
      "name": "Clearstream 2V-J3",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "mylycha2",
      "reviewText": "I recently \"cut the cord\" and installed a RCA ANT751R antenna in the attic (they boast a 40 mile range). I live 20-30 miles north of most of the transmitting stations. I was excited to receive 12 local channels and most in HD, but did not pick up NBC or another local channel (they are the farther stations). I was reluctant to spend more than $50 for the antenna, so I almost settled for this situation.\n\nMy husband convinced me to try the Clearstream 2V before I settled. I was elated when I picked up 4 more channels including NBC and 38theSpot (the other local channel I was previously missing). Now I have all the possible OTA channels in my city. My husband is happy to be able to watch NBC sports. I highly recommend spending a few extra dollars for this antenna, especially if you live out of city limits.",
      "submissionTime": "2013-08-05T10:02:42",
      "title": "Excellent Attic Antenna!",
      "upVotes": "42",
      "downVotes": "12"
    },
    {
      "name": "Clearstream 2V-J3",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "sagbags1",
      "reviewText": "my cabin is deep in the huron national forest. I just hooked this antenna up and it works great.\nI have it only 6ft above the ground and it works unbelievably good without an amplifier.\n5 minutes from box to watching tv. Don't settle for the cheaper antennas. This one really works\nand saves you taking other ones back to the store. only 99.00 to enjoy free tv even in thick\nwoods. I don't usually endorse products but this one is a gem.",
      "submissionTime": "2013-08-02T13:10:40",
      "title": "awesome product.",
      "upVotes": "40",
      "downVotes": "10"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.38",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "1"
      },
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "4",
        "ratingValue": "3"
      },
      {
        "count": "9",
        "ratingValue": "4"
      },
      {
        "count": "40",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "58"
  },
  "availableOnline": true
}
