{
  "itemId": 13848593,
  "name": "Coleman CPX 6 Classic LED Personal Size Lantern Red 2000008554",
  "salePrice": 23.77,
  "upc": "076501230307",
  "categoryPath": "Sports & Outdoors/Outdoor Sports/Camping/Lights & Lanterns/Lanterns",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FColeman-2.00000267E9-Coleman-LED-Classic-Lantern%252F13848593%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FColeman-2.00000267E9-Coleman-LED-Classic-Lantern%2F13848593%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4125_546956_4128",
  "reviews": [
    {
      "name": "Coleman 190 Lumen LED Classic 4D Battery Latern",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "err1955",
      "reviewText": "This has the same amount of lums as the family lantern but 11.00 less. I bought this for camping\nin a cabin that has no electric and was pleasently suprised that it is nice and bright,used off and on for 6 nights inside the cabin and still using the same batteries. It doesn't look like much but it gives off a good amount of light.",
      "submissionTime": "2011-07-19T11:40:27",
      "title": "don't by family size",
      "upVotes": "90",
      "downVotes": "8"
    },
    {
      "name": "Coleman 190 Lumen LED Classic 4D Battery Latern",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "paval",
      "reviewText": "Bought this for temporary use when I had to have power shut off to the stable for some electrical work. Liked it so much, ended up using for a \"night light\" in the stable ( I don't like anything electrical turned on over night if I don't have to). Throws illumination about 19 feet, so it shines about half way down our aisle. I was using four D batteries, but then I bought the optional power pack charger. Don't waste your money on the charger, I couldn't get more than 18 hours use off one charge (chatted with Coleman after the fact and they told me up to 25 hours was average depending on what it's being used in)... which for me, wasn't worth it since leaving it on all night wouldn't get me even two nights use. I still have the charger, but I have to remember to plug it in and recharge after each night's use. Instead I would buy the Tenergy rechargeable Premium D batteries.",
      "submissionTime": "2011-07-11T12:53:31",
      "title": "Handy little lantern",
      "upVotes": "52",
      "downVotes": "5"
    },
    {
      "name": "Coleman 190 Lumen LED Classic 4D Battery Latern",
      "overallRating": {
        "label": "Overall",
        "rating": "3"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "2"
        }
      ],
      "reviewer": "cleanreviews",
      "reviewText": "This lantern does put out a pretty decent amount of light, allthough it is nowhere even close to the propane lanterns. One thing I think everyone likes about it is it does not get hot, so it is safe for the kids to carry around and to have inside the tent. The thing I do not like about it is the batteries did not even last me though a weekend. It says on the box 122 hours on lowest setting, yet i did not even get 15 hours even when mostly only used on low! I used duracell batteries which cost about $6 at walmart, so you can see how this lantern may get a little costly compared to the propane lanterns. ...... I will still use this lantern for the purpose of using inside the tent only, and maybe for power outages but will defiantely be investing in a propane lantern for the next caming trip.",
      "submissionTime": "2012-01-17T08:38:07",
      "title": "batteries lasted only one night",
      "upVotes": "48",
      "downVotes": "5"
    },
    {
      "name": "Coleman 190 Lumen LED Classic 4D Battery Latern",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "wonderingwhy",
      "reviewText": "It is a plastic replica of the original metal and glass lanterns. It worked great! Hung it from the inside top of the tent and was able to read at night. Used it for 8 nights and never needed to change the batteries.",
      "submissionTime": "2010-09-19T14:46:14",
      "title": "Not metal",
      "upVotes": "74",
      "downVotes": "29"
    },
    {
      "name": "Coleman 190 Lumen LED Classic 4D Battery Latern",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "LStrick115",
      "reviewText": "I am pleased with the light output of the lantern. Brightness rating is 190 lumens on \"high\". It has two settings - turn the switch to the right for \"high\", and left for \"low\". Lantern seems to be well made. Coleman products are known to last. The lantern handle, switch, and battery holder appear to be sturdy and not likely to break. The model that we have takes four \"D\" batteries. (A rechargeable battery pack is optional.) Lantern uses LED's so it is cool to the touch and will have longer battery life. The lantern body is plastic and lightweight, so after you put the batteries in, the lantern becomes more weighted at the bottom and is not likely to tip over. The lantern bottom is smooth, so it will slide if the object that it rests on is tilted. This did not bother me. You will need to add some adhesive rubber feet to the base if you want the bottom to be grippy. The lantern’s appearance is very nice and the looks are a reminder of the vintage Coleman lanterns.",
      "submissionTime": "2012-12-01T18:50:06",
      "title": "Lantern is sturdy,well made, has good light output",
      "upVotes": "20",
      "downVotes": "1"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.29",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "9",
        "ratingValue": "1"
      },
      {
        "count": "3",
        "ratingValue": "2"
      },
      {
        "count": "5",
        "ratingValue": "3"
      },
      {
        "count": "23",
        "ratingValue": "4"
      },
      {
        "count": "70",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "110"
  },
  "availableOnline": false
}
