{
  "itemId": 39881573,
  "name": "Etekcity Digital Infrared Thermometer Lasergrip Meat Temperature Gun Black 8550",
  "salePrice": 15.98,
  "upc": "025706347532",
  "categoryPath": "Health/Medicine Cabinet/Thermometers",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FEtekcity-DT-8550-IR-Infrared-Thermometer%252F39881573%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FEtekcity-DT-8550-IR-Infrared-Thermometer%2F39881573%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "976760_976798_641101",
  "reviews": [
    {
      "name": "Etekcity Digital Infrared Thermometer Lasergrip Meat Temperature Gun Black 8550",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "otownwalmarter",
      "reviewText": "Temperature readings are accurate, and work well for the specific purpose for which I purchased it (reading temperatures of foods cooking in pots and pans), as well as checking temps in refrigerators and freezers. As mentioned in other reviews, the optimal readings are taken at a distance of one foot or less, while focusing on a spot about the diameter of a nickle. However, readings taken from a longer distance seem accurate as well as long as you are pointing the laser beam at a large enough surface area like a wall, ceiling, window, etc. My only disappointment is that, contrary to my hope when purchasing, the laser dot does NOT scare marauding squirrels away from our bird feeder. Also, don't buy this if you are planning on using it to check the body temperatures of humans/animals. I highly recommend this item for its intended putposes, as well as the fact that it's a lot of fun to play with.",
      "submissionTime": "2015-02-13T23:50:53",
      "title": "Great item IF you learn to use it correctly!",
      "upVotes": "2",
      "downVotes": "1"
    },
    {
      "name": "Etekcity Digital Infrared Thermometer Lasergrip Meat Temperature Gun Black 8550",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Nibergie",
      "reviewText": "Easy to use, fast, pretty accurate. My neighbor paid twice as much for a Ryobi thermometer which consistently reads two degrees (F) higher. I don't know which is right. Two degrees is close enough for my purposes. I bought this as a toy, thinking it would be fun and perhaps useful. I thought I would use it for measuring machinery temps, AC output, etc. It turns out to be really handy in the kitchen. My oven thermometer takes several minutes to stabilize. Now I don't have to wait. I don't have to call with a slow responding, messy candy thermometer. I don't have to guess if the skillet or oil is hot enough. Just point and click and I have the answer.",
      "submissionTime": "2015-04-26T23:03:37",
      "title": "Handy Tool at a Great Price",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Etekcity Digital Infrared Thermometer Lasergrip Meat Temperature Gun Black 8550",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "blalbala",
      "reviewText": "Amazing! Worked really well right out of the box. Really accurate within 4-8 feet. Beyond that, will take a bit of getting used to.",
      "submissionTime": "2015-04-27T00:21:25",
      "title": "Suprisingly useful.",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Etekcity Digital Infrared Thermometer Lasergrip Meat Temperature Gun Black 8550",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "NighLon",
      "reviewText": "This thermometer is rugged and durable, making it perfect for any application. The directions are clear and precise. I figured out how to use it the first time! The temperatures are accurate and it responds to a change quickly. The LCD backlight makes it easy to read in any environment. The distance ratio is perfect. I've had a lot of fun getting used to this thermometer and I know it is going to be perfect for all of my uses.",
      "submissionTime": "2015-05-18T08:54:24",
      "title": "Amazing!",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "4"
  },
  "availableOnline": true
}
