{
  "itemId": 5706767,
  "name": "First Alert 2092DF Water and Fireproof Digital Lock with Key Override Security Safe",
  "salePrice": 189.88,
  "upc": "016247020923",
  "categoryPath": "Home Improvement/Home Security/Home Safes & Lock Boxes",
  "brandName": "First Alert",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FHoneywell-1.31-Cubic-Foot-Waterproof-Firesafe%252F5706767%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FHoneywell-1.31-Cubic-Foot-Waterproof-Firesafe%2F5706767%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "1072864_1068865_136315",
  "reviews": [
    {
      "name": "First Alert 2092DF 1.31 Cubic Foot Waterproof 1-Hour Fire Safe with Digital Lock",
      "overallRating": {
        "label": "Overall",
        "rating": "3"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "3"
        },
        {
          "label": "Meets Expectations",
          "rating": "3"
        }
      ],
      "reviewer": "FourCedarsCabin",
      "reviewText": "I researched safes well before I decided on this one. I needed a safe to store some valuables, paper documents and back-up CD's. What sold me on this safe, was that it was the right size, fireproof/waterproof and only $200. I also liked the concealed hinges, back-lit keypad, key back-up and the fact you didn't need the key to open the safe in conjunction w/your code.\n\nThe positives: The packaging was excellent from Walmart and you can't beat free shipping to home, which was fairly fast, less than 2 weeks. It's surprisingly roomy inside and the shelf and compartment in the door is handy. The back-lit keypad w/key back-up is awesome and it was a breeze to program. It's heavy, so I'm not worried about someone walking off w/it (but I would keep it out of sight). It looks nice.\n\nThe negatives: The safe arrived kind of oily and very cold and damp, inside and out. This was fairly minor and temporary, but did take 6 hours of drying (after wiping down) w/a fan and electric heater. Next, the overall quality of this safe is pretty cheap. I was expecting it to be more solid. First, the door does not shut all the way when closed. It sticks out about 1/8\" of an inch. It makes me question the integrity of this thing in a fire or from a would be criminal. Although, even w/the door fully shut, I don't think it would take much effort to pry this thing open. It states the locking bolts are solid steel, but they sure don't look or feel like it. And even if they are, I bet the plastic door would crumble fairly easily if someone had a crow bar. But my main concern is w/a fire and this thing lasting as long as they claim, especially w/a slightly ajar door. Lastly, the entire safe is made of plastic, including the whole handle and keypad assembly. It just has a cheap feel to it.\n\nI give this thing 3 stars, at best. The quality just isn't there and it didn't meet my expecations. I've had it less than a week and contemplated returning it for these issues, but I don't think it's worth the hassle. If I had to do it over though, I would probably get the First Alert 2.0 metal safe and skip this one. Hope this helps.",
      "submissionTime": "2010-12-04T15:05:23",
      "title": "Safe is just OK...",
      "upVotes": "73",
      "downVotes": "8"
    },
    {
      "name": "First Alert 2092DF 1.31 Cubic Foot Waterproof 1-Hour Fire Safe with Digital Lock",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "fairychiq",
      "reviewText": "For the price this is an excellent safe. It was easy for me and my husband to program. The space inside feels bigger than what you think when you look at it online.\nStore delivery was also very good.",
      "submissionTime": "2008-01-03T07:29:32",
      "title": "Very necessary",
      "upVotes": "21",
      "downVotes": "2"
    },
    {
      "name": "First Alert 2092DF 1.31 Cubic Foot Waterproof 1-Hour Fire Safe with Digital Lock",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "1"
        },
        {
          "label": "Meets Expectations",
          "rating": "1"
        }
      ],
      "reviewer": "PE1234",
      "reviewText": "First, let me say that I bought a Model 2087D digital safe 3 years ago to secure my guns. Being in law enforcement, I open that safe virtually 2 or more times every day. I have changed the combination several times and the batteries 3 times, and it has worked flawlessly. I wouldn't have anything but a digital safe. I bought my first Model 2092D safe in July 2011 to hold important papers. I bought it because it was like my 2087D, but .5 cu. ft. more for only $1 more. In the beginning it seemed to work great. I changed the combination...just like I did on my 2087D...as the digital lock is identical to my 2087D. It worked great for approximately a week. Then it started beeping like a heart monitor...about 1 beep per second...and all of the numbers and lights on the key pad blinked in sync with the beeping. Pressing keys had no effect, and the safe had to be opened with the tubular key. I took the batteries out, and put them back in to reset it, and a week later the beeping and blinking lights started again. Putting new, fresh batteries in the safe did not help, as a week later it did it again. As a result, I took it back to Walmart, and ordered another. On the new one, I put the batteries in and opened the safe using the preset combination a couple of times. Everything worked fine. I then changed the combination to my own, and opened it twice. Everything appeared to be fine. Then, a couple of minutes later, the safe suddenly made a continuous, solid beep sound that lasted for about 3 seconds. The sound started at a regular volume for this safe and then continuously went softer, like the battery was running down. After the 3 or so seconds, the safe went basically dead. When I pressed the numerics on the keypad, all I got was silence and the red light would blink when the numerics were pressed, and the safe would not open. Fresh batteries got exactly the same response. This one will also be going back for a refund, and there will be no third purchase.",
      "submissionTime": "2011-10-04T18:55:07",
      "title": "Digital Pad Does Not Work",
      "upVotes": "20",
      "downVotes": "2"
    },
    {
      "name": "First Alert 2092DF 1.31 Cubic Foot Waterproof 1-Hour Fire Safe with Digital Lock",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "trakfone",
      "reviewText": "This was the size we were looking for, and just what we wanted in combining digital opening, waterproof and firesafe. It also was shipped right to our home for only $4.97. That was much better than picking it up at a store (weight about 90 lbs), and so reasonable. It arrived in very sturdy packaging by Fed Ex, and arrived very quickly. The price was very reasonable (much less than a safe would have cost at a locksmith, key, and safe dealer). The only problem we had was when I went to put in my own security code, at first it would not take it. I called the manufacturers toll free number and the girl I talked to in Customer Service immediately told me what to do. I was told that my manual had the set up instructions reversed, so that I had to open up the front cover before pushing re-set button on the door. The instructions said to push the re-set button, then open the cover, then put in your own code, and this was why it originally did not work. She said that some manuals were printed wrong, so if you buy one, be aware of this sequence. The digital opening has worked fine ever since.",
      "submissionTime": "2012-09-07T12:05:36",
      "title": "Great Safe that combines digital, waterproof& fire",
      "upVotes": "21",
      "downVotes": "3"
    },
    {
      "name": "First Alert 2092DF 1.31 Cubic Foot Waterproof 1-Hour Fire Safe with Digital Lock",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "bobSpelledBackwardIsBob",
      "reviewText": "Safe is a quality product that appears to be well made. It fits in the closet, and is heavy enough that the casual thief will not walk away with it unnoticed.\n\nWe now have peace of mind when lots of people are at the house that no one will decide to slip into a bedroom and open the dresser drawer, helping themselves to what little jewelry we have. Likewise, when we are out of town for an extended period the laptop computers and external harddrives can be secured on the off chance that someone breaks in.\n\nWe've also put important papers in the safe for fire protection.\n\nOverall, a good value.",
      "submissionTime": "2009-01-08T07:53:35",
      "title": "solid",
      "upVotes": "17",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.6",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "1"
      },
      {
        "count": "5",
        "ratingValue": "3"
      },
      {
        "count": "48",
        "ratingValue": "4"
      },
      {
        "count": "128",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "185"
  },
  "availableOnline": true
}
