{
  "itemId": 27584753,
  "name": "Funai Full HD UpConvert DVD Recorder/VCR Combo",
  "salePrice": 159.77,
  "upc": "053818470565",
  "categoryPath": "Electronics/TV & Video/DVD & Blu-ray Players",
  "brandName": "Funai",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FFunai-Full-HD-UpConvert-DVD-Recorder-VCR-Combo%252F27584753%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FFunai-Full-HD-UpConvert-DVD-Recorder-VCR-Combo%2F27584753%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_1060825_95987",
  "reviews": [
    {
      "name": "Funai Full HD UpConvert DVD Recorder/VCR Combo",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Ease of Set Up",
          "rating": "4"
        },
        {
          "label": "Ease of Use",
          "rating": "4"
        }
      ],
      "reviewer": "SmartShopper2014A",
      "reviewText": "After 11 years my cheap old Emerson VCR finally drifted off to VCR heaven so it was time to buy a new TV recorder. I was considering a DVR but when I saw this Funai VCR/DVD combo for only $168 at Walmart I decided to give it a shot and I'm glad I did. I was slightly skeptical of the brand at first but after looking them up online it appears they have been making products for 50 years and actually make a lot of better known brands (Sylvania, Emerson, Magnavox, Philips) under their flagship so it's basically all the same thing. Everything is owned by one company in China now a days more or less so you might as well get the best deal. The thing that cinched it for me was this recorder and the Magnavox version look EXACTLY identical except for the name plate and the price sticker (HINT! HINT!).\nAnyway the first thing you need to know about this recorder is that is that does NOT have a built-in tuner which is stated clearly on the package. For you novices out there that means you can't just screw a coaxial cable directly into this sucker. You have to run a video cord from your cable box to this unit. Of course I don't know who DOESN'T have their TV already hooked up to a cable or satellite box in 2014 but if you are one of these people you will need a recorder with a tuner included which adds about $70 to the price depending on the model. If you already have your TV running through a cable or satellite box then that's your tuner and you can save some money! Anyway the set up isn't too difficult. I admit I'm pretty tech savvy but the instruction booklet is very helpful and you should be up and running in no time. From walking in the door I set the whole thing up in about 30 minutes and was burning DVDs.\nThis device has two input choices available for recording TV: basic composite video (your standard yellow, red and white RCA jacks about 480i quality) or S-video (one black S cord, slightly better quality). I actually prefer using composite video, the image is very sharp and you don't get the dot crawl I seem to get from an S cord. Although I already had a ton laying around from my old video game consoles, a composite video cord is thoughtfully included in the box along with a remote WITH batteries! I have since programmed the unit so most of the functions work with my universal remote.\nThe device does include an impressive array of output options. Besides the composite and S video there are component video output jacks (red, blue and green RCA jacks going up to about 1080p HD quality) and drum roll ... a HDMI output jack (1080p HD quality picture and sound). (Those cords aren't included although you could buy them for about 4 bucks. I'm quite satisfied with the composite video myself). Of course these are only OUTPUT jacks meaning the quality still depends on what you actually dump into the unit in the first place (whether you have HDTV service or HD movie disks). Everything recorded (composite or S video) will still be in standard definition.\nThis recorder has a ton of features. Probably too many for me to mention. Obviously you can record to VHS, DVD-RW and DVD-R. You can erase and record over VHS and DVD-RW over and over. You can record live TV to tape or disk. The DVD timer setting works very much like a VCR. For those of you who haven't recorded TV to DVD before I can tell that you can fit as much as 8 hours onto one disk although the quality gets much better at slower settings. There's XP 1hr, SP 2hrs, LP 4hrs, EP 6hrs and SLP 8hrs. XP is perfect quality, LP almost as good, at SLP it's a bit fuzzy but still satisfactory if you are recording long sports games like I do. You can dub from VHS to DVD or vice-versa. Right now I'm in the process over moving all my old tapes to disks. You can put chapter markers on the DVDs so you can skip ahead. There's a handy DVD commercial skip button (30, 60, 90, 120, 150, 180 seconds). You can play music CDs (both store bought and burned) on it. Once you \"finalize\" each disk it will play as a standard DVD in most other players (sometimes I swap DVDs with my friends, etc.)\nThe unit also comes with a 90 day warranty on labor and a one year warranty on parts. All in all I am extremely pleased with this recorder (especially considering the price) and would highly recommend it to anyone.",
      "submissionTime": "2014-01-23T12:00:55",
      "title": "incredible value",
      "upVotes": "483",
      "downVotes": "41"
    },
    {
      "name": "Funai Full HD UpConvert DVD Recorder/VCR Combo",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "robvs",
      "reviewText": "Does a pretty good job, too. Has features from basic to pretty advanced. Not completely intuitive, you'll need to read over the manual and remember to finalize your discs. I used it only for dubbing old VHS to dvd.",
      "submissionTime": "2013-10-09T11:19:28",
      "title": "Copies old VHS home movies to DVD",
      "upVotes": "272",
      "downVotes": "15"
    },
    {
      "name": "Funai Full HD UpConvert DVD Recorder/VCR Combo",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Ease of Set Up",
          "rating": "5"
        },
        {
          "label": "Ease of Use",
          "rating": "5"
        }
      ],
      "reviewer": "cgmp",
      "reviewText": "I recorded from vcr tape to dvd and have recorded on dvd from my tv also.",
      "submissionTime": "2014-01-02T12:02:24",
      "title": "Did everything I needed it to do !",
      "upVotes": "187",
      "downVotes": "19"
    },
    {
      "name": "Funai Full HD UpConvert DVD Recorder/VCR Combo",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Ease of Set Up",
          "rating": "5"
        },
        {
          "label": "Ease of Use",
          "rating": "5"
        }
      ],
      "reviewer": "whale508",
      "reviewText": "This product was bought with the intention of rescuing a bunch old VHS tapes and allow them to be archived on DVD media. It does that perfectly. No trouble at all getting it to work. Just read the manual. Easy to follow. The naming of \"chapters\" is a bit of a pain but for most recordings, it is not even necessary.",
      "submissionTime": "2014-03-20T20:59:40",
      "title": "Easy to make VHS to DVD",
      "upVotes": "115",
      "downVotes": "5"
    },
    {
      "name": "Funai Full HD UpConvert DVD Recorder/VCR Combo",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Ease of Set Up",
          "rating": "5"
        },
        {
          "label": "Ease of Use",
          "rating": "5"
        }
      ],
      "reviewer": "Dadxyz",
      "reviewText": "This unit was very easy to use. You can even copy multiple VHS tapes to a single hd DVD. I was impressed with the quality of the unit and it would have cost far more to take my tapes to a service to convert.",
      "submissionTime": "2014-04-17T11:14:09",
      "title": "Save all your old family VHS tapes.",
      "upVotes": "63",
      "downVotes": "3"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "3.91",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "16",
        "ratingValue": "1"
      },
      {
        "count": "2",
        "ratingValue": "2"
      },
      {
        "count": "3",
        "ratingValue": "3"
      },
      {
        "count": "19",
        "ratingValue": "4"
      },
      {
        "count": "47",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "87"
  },
  "availableOnline": false
}
