{
  "itemId": 21550188,
  "name": "Genius Foldable Gaming Headset - Stereo - Mini-phone - Wired - 32 Ohm - 20 Hz - 20 kHz - Gold Plated - Over-the-head - B",
  "salePrice": 30.28,
  "upc": "091163239000",
  "categoryPath": "Electronics/Computers/Computer Accessories/Audio & Video Components/Microphone & Headsets",
  "brandName": "Genius",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FGenius-USA-GX-HS-G550-Lychas-Headset%252F21550188%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FGenius-USA-GX-HS-G550-Lychas-Headset%2F21550188%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_3951_132959",
  "reviews": [
    {
      "name": "Genius USA GX HS G550 Lychas Headset",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "Tnfc",
      "reviewText": "This headset definitely meets all expectations. This is the best headset I have ever owned, especially at the price I paid ($28.57).\n\nMy only negative comment is that the description claims that it has \"amazing bass.\" The bass is above average, but far from amazing.\n\nThey have great sound quality, and the mic picks up voice in crystal clarity.\n\nIf you game on PC and need a decently priced headset that is pretty comfortable and has great sound, I wouldn't suggest any other product.",
      "submissionTime": "2013-12-18T11:30:54",
      "title": "Amazing value for the price.",
      "upVotes": "17",
      "downVotes": "0"
    },
    {
      "name": "Genius USA GX HS G550 Lychas Headset",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "BearNekked",
      "reviewText": "I've gone through so many headsets in the last 5 years it's pathetic. One of the best ones I ever had I gave to my ex-wife because the microphone was removable and kept coming out. I replaced it with a GIGANTIC ear Plantronics headset that my cat ended up chewing through the mic line, right at the plug level. The sound was still fine, and the headset lasted me a good 2 years, but, I wanted something slightly smaller and with a functioning mic, in case I ever bothered with voice chatting again. I had my son pick me up a pair of Frogz at the store and they were basically junk. Ordered a set from Amazon and they were fine except for sounding muffled on a game I play regularly.\n\nThis headset still sounds a tad muffled on that game, but MUCH better. The earcuffs are almost perfect sized around my ears and the headband fits my gigantic, fat head. Haven't tried the mic yet, but I do have issue with how far it sticks up when put away. After a couple hours of wear they were still comfortable and I wasn't oozing sweat from the leatherette wrapped pads. The cord for it is thick and seems strong, but I wish more companies would do the cloth wrapped cords. The rubberized or plastic ones just seem to stay kinked up, look bad, and are a pain to try and tuck out of the way.\n\nCheesy as it might seem (and is), the main reason I got this headset was the scorpion on the side. I'm a Scorpio and have always had a bit of fascination with the image of them. So this was a great fit for me in that aspect.\n\nOverall, it's a decent headset. Volume controls on the ear seem to work fine, the \"folding\" aspect of it is a bit eh. The cord is long, the sound is fine, and the mic isn't one of those bendy, wiry, crummy things. I would have given it 5 stars with a few design tweaks and maybe a little better sound, but it works fine.",
      "submissionTime": "2013-12-19T05:22:01",
      "title": "Not bad, but not perfect",
      "upVotes": "8",
      "downVotes": "1"
    },
    {
      "name": "Genius USA GX HS G550 Lychas Headset",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "3"
        }
      ],
      "reviewer": "DarthVader1999",
      "reviewText": "I bought this headset for Skype calls and gaming. When it first arrived, it worked just fine. After about three days, the left side stopped working. In order to fix this problem (temporarily), I had to pull the base of the mic away from the left side. I figure that the reason the sound cuts out is because the mic puts too much pressure on the left side.",
      "submissionTime": "2014-01-11T20:06:17",
      "title": "Left ear phone doesn't work at times.",
      "upVotes": "5",
      "downVotes": "1"
    },
    {
      "name": "Genius USA GX HS G550 Lychas Headset",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Isra2010",
      "reviewText": "Very excellent headset for the money.",
      "submissionTime": "2014-03-25T04:24:48",
      "title": "Headset",
      "upVotes": "4",
      "downVotes": "3"
    },
    {
      "name": "Genius USA GX HS G550 Lychas Headset",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "piggymamasue",
      "reviewText": "Sound is good, I like the options on them, comfortable, easy to store and easy to use! The only thing I would like to see different, is the length of the microphone, it's a little short. But, other than that, I am extremely satisfied!",
      "submissionTime": "2014-10-09T15:40:12",
      "title": "Good Headset!",
      "upVotes": "1",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "1"
      },
      {
        "count": "2",
        "ratingValue": "4"
      },
      {
        "count": "3",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "6"
  },
  "availableOnline": true
}
