{
  "itemId": 2642567,
  "name": "Heritage Oval 24' x 12' x 52\" Above Ground Swimming Pool",
  "salePrice": 1858.67,
  "upc": "087791616603",
  "categoryPath": "Toys/Outdoor Play/Swimming Pools & Waterslides/Swimming Pools/Metal Frame Swimming Pools",
  "brandName": "Heritage",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FHeritage-Oval-52-Pool-Package%252F2642567%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FHeritage-Oval-52-Pool-Package%2F2642567%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_14521_132873",
  "reviews": [
    {
      "name": "Heritage Oval 24' x 12' x 52\" Above Ground Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "2"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "3"
        },
        {
          "label": "Meets Expectations",
          "rating": "2"
        }
      ],
      "reviewer": "Bringo",
      "reviewText": "I was happy when I first received the pool. But, after trying to assemble it, I found that a lot of the pre-drilled holes do not line up correctly, and I had to either twist the steel trusses to get them to line up, or in some cases I had to re-drill the holes. It would be much easier and cheaper in the long run to buy a portable blatter pool. This pool will test your marraige during the assembly process. If you buy this pool anyway, I would recommend pouring concrete post holes where the braces are, rathar than using patio blocks. It is easier to level wet concrete than to dig the right depth for the patio blocks. Use the patio blocks to weight down the bottom brackets while attempting to unroll the steel side. Get lots of help to unroll the steel side. I could go on and on about how to assemble this pool better than they tell you in the vague instructions, but I just wanted to warn you of what you are getting in to. Good luck.",
      "submissionTime": "2007-08-10T04:01:49",
      "title": "Swimnplay Pool",
      "upVotes": "109",
      "downVotes": "3"
    },
    {
      "name": "Heritage Oval 24' x 12' x 52\" Above Ground Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "2"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "3"
        },
        {
          "label": "Meets Expectations",
          "rating": "2"
        }
      ],
      "reviewer": "dm830",
      "reviewText": "First off the pool came without the ladder, not good. Instructions to the pool are not for this brand of pool. Pool so far have come without the right parts or came with parts that dont belong. Wife called the customer service number in the instruction manuel on a wednesday all day long. Nothing but an answering machine to one guy, probably a set up. Never a call back. Will leave more as we go. But hopefully all will work out in the end.",
      "submissionTime": "2009-05-20T21:06:16",
      "title": "Are you serious",
      "upVotes": "36",
      "downVotes": "4"
    },
    {
      "name": "Heritage Oval 24' x 12' x 52\" Above Ground Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "2"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "trmarcum",
      "reviewText": "This pool was a nightmare. The instructions was writen by a 1st grader. As a gold package I would think that it would come with a skimmer and a vacuum. After waiting a month for delivery we took much longer than 2 days to install. But now all that headache is over we love the pool. We are adding a deck around it and it is great. If you have children this is worth all the headaches. Good luck to anyone without patients.",
      "submissionTime": "2009-06-20T07:50:16",
      "title": "heritage oval pool",
      "upVotes": "39",
      "downVotes": "7"
    },
    {
      "name": "Heritage Oval 24' x 12' x 52\" Above Ground Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "1"
        },
        {
          "label": "Meets Expectations",
          "rating": "1"
        }
      ],
      "reviewer": "Kapiesage",
      "reviewText": "This product is awful! It shipped quickly, which was great. However, after getting the pool partially constructed, we realized we were not given all the parts. Of course, its Friday so we probably won't even hear back from them until Monday. We have a half constructed pool in our yard and no way to finish it. We are VERY displeased with this pool and will NEVER buy from Heritage again!",
      "submissionTime": "2011-05-20T19:51:41",
      "title": "AWFUL!!",
      "upVotes": "19",
      "downVotes": "6"
    },
    {
      "name": "Heritage Oval 24' x 12' x 52\" Above Ground Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "pooslie",
      "reviewText": "Finished putting the pool up yesterday, is currently filling with water (about 10 inches in there now).\nit looks real nice and was not too difficult to put up though the directions stated 2-3 people and it would have been better if we had 4-5 because while you roll out the wall, the flat sides of the oval want to fall down (until you get the whole thing up then they stood up OK (besides when a gust of wind came and tried to knock it down on one side)\n\nthe buttresses were the hardest part to put together (took almost as long as the rest of the rails, etc combined) because the screws just did NOT want to line up to to go through the holes the whole way and it took a lot of finagling to get them through.\n\notherwise i am pleased with our purchase. i did have one question on the directions (some parts are a bit vague/not clear) and I called the company (around 8PM so they were closed for the night), the customer service rep got back to me the next day and was great though I am glad we read through the directions thoroughly before we started setting up otherwise we would have been in a pinch.",
      "submissionTime": "2012-07-09T09:31:50",
      "title": "Nice pool,mediocre directions-get frinds to help!!",
      "upVotes": "6",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "2.63",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "1"
      },
      {
        "count": "3",
        "ratingValue": "2"
      },
      {
        "count": "2",
        "ratingValue": "4"
      },
      {
        "count": "1",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "8"
  },
  "availableOnline": true
}
