{
  "itemId": 40720864,
  "name": "Intex 10' x 30\" Metal Frame Swimming Pool",
  "salePrice": 99,
  "upc": "078257311989",
  "categoryPath": "Toys/Outdoor Play/Swimming Pools & Waterslides/Swimming Pools/Metal Frame Swimming Pools",
  "brandName": "Generic",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FIntex-10-x-30-Metal-Frame-Pool%252F40720864%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FIntex-10-x-30-Metal-Frame-Pool%2F40720864%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_14521_132873",
  "reviews": [
    {
      "name": "Intex 10' x 30\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Ziminy",
      "reviewText": "I bought one of these 3 and a half years ago and it is just now time to replace it. I live in Florida. Our weather destroys everything and I was amazed it lasted this long before one of the poles rusted out. I could continue to use it through this summer and get 4 years, but I have guests coming and want a shiny new one. I can not rave about this pool enough. I'm in it every day. No an adult can not swim in it, but if you just want a pool to relax in or tan on a float, it fits 3 adults comfortably. Heaven for just one. ME! =D",
      "submissionTime": "2012-04-17T12:10:00",
      "title": "Easy - sturdy pool",
      "upVotes": "187",
      "downVotes": "15"
    },
    {
      "name": "Intex 10' x 30\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Daash",
      "reviewText": "I needed a particular size pool to fit in my Lanai. Had trouble finding one but finally used site to store and couldn't be happier. As the picture shows, it fits perfectly and remains much cleaner by being inside the screening. Easy to set up and the pump/filter runs extremely quiet.",
      "submissionTime": "2012-03-03T15:11:38",
      "title": "Exactly as expected",
      "upVotes": "325",
      "downVotes": "42"
    },
    {
      "name": "Intex 10' x 30\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewText": "We purchased this pool in lieu of another inflatable like last years. We were pleasantly surprised that the set-up was so easy (just make sure your ground surface is level). It's the perfect height for our four year old son, but not so low that he can actually get into the pool by himself. And there's plenty of room to swim without being on top of one another. Again, we are satisfied customers here!",
      "submissionTime": "2012-04-11T13:50:02",
      "title": "Great pool, lots of room, perfect for kids!",
      "upVotes": "183",
      "downVotes": "34"
    },
    {
      "name": "Intex 10' x 30\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "xrilander",
      "reviewText": "This is a great upgrade over the inflatable ring styles that seem to have problems holding air (my experience anyway). Last year this size wasn`t available at my local store, and I purchased the 12ft model. I found that one to be a little bit too large for 1 person. I also ended up with a 4\" differential in the water level, no matter how hard I tried to level it. This one is much easier to set up, and the water level is only 1\" off now. No ladder is necessary for my 5' 11\" frame, though children surly would need to use one. A ladder is NOT included with this model, so consider the extra cost. The pump takes the smaller sized \"D\" filters, and is very quiet. I would recommend purchasing a cover to keep out dirt and debris. One downside I noticed was the quality difference for the pool bottom. The 12ft model has a very heavy duty white liner bottom, while this model had a very thin blue plastic bottom. Seems it could be penetrated very easily. For the price, a very good deal!",
      "submissionTime": "2012-05-17T15:52:06",
      "title": "Great value!",
      "upVotes": "129",
      "downVotes": "21"
    },
    {
      "name": "Intex 10' x 30\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Chron",
      "reviewText": "Grandchildren ages 2-7 have enjoyed this pool immensely. Definitely worth the $100, but you need another $60 in accessories to keep the water chlorinated and clean. Two-year old can touch the bottom. Took one hour to put it together. Put it on our concrete patio because my yard is sloped. Used the power blower first to remove twigs and other items that might perforate the plastic bottom. Wish they would include a fitted tarp with the pool, but I used a tarp I already had. Pump is basically a large aquarium filter pump so it should last for a very long time; it is a very simple device. Read that some folks had problems with their pump; after three weeks my pump stopped working because I had briefly allowed some unfiltered water to run thru the pump and something jammed the spinning magnet. Easy to take apart per instructions and put together. Worked great since then and I don’t leave the pump on when I change the filter. Wish I could put the pump on a timer, but the circuit breaker device does not allow it. I ran the filter 8-12 hours per day. I bought a Aqua Chem kit ($6) to check the chlorine and PH level on a daily basis. Keeping the chlorine level steady was difficult at first. Bought a bottle of one inch tables ($18) If I ran one chlorine tabs thru the filter, the chlorine level was too high. If I cut back on running the filter less than 8-12 hours then the water was not getting filtered enough. So I bought the floating chlorine dispenser ($9) at Walmart in which I put 2 tabs to keep the level steady and I could run the pump as little or much as I wanted without it interfering with the chlorine level. Never had a mildew problem and I live in Florida. I changed the filter every two weeks and rinsed it out every day or two days with the hose. The filter does a really good job cleaning the water. You will need to buy a hose ($22) to suck up debris from the bottom and a net ($9) to remove floating debris. Just took it apart today to store for the winter. Removing the pegs from the poles can be done by putting a little Vaseline on the bottom of the peg, tapping the bottom of the peg with a hammer to get it thru the bottom hole, and then squeezing and pulling it out with a needle nose plier thru the top hole.",
      "submissionTime": "2012-09-21T19:40:39",
      "title": "Great product",
      "upVotes": "58",
      "downVotes": "1"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.41",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "19",
        "ratingValue": "1"
      },
      {
        "count": "9",
        "ratingValue": "2"
      },
      {
        "count": "15",
        "ratingValue": "3"
      },
      {
        "count": "70",
        "ratingValue": "4"
      },
      {
        "count": "233",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "346"
  },
  "availableOnline": true
}
