{
  "itemId": 39264342,
  "name": "Intex 24' x 12' x 52\" Ultra Frame Rectangular Swimming Pool",
  "salePrice": 799,
  "upc": "078257312122",
  "categoryPath": "Toys/Outdoor Play/Swimming Pools & Waterslides/Swimming Pools/Metal Frame Swimming Pools",
  "brandName": "Generic",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FIntex-24-x-12-x-52-Ultra-Frame-Rectangular-Swimming-Pool%252F39264342%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FIntex-24-x-12-x-52-Ultra-Frame-Rectangular-Swimming-Pool%2F39264342%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_14521_132873",
  "reviews": [
    {
      "name": "Intex 24' x 12' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "DivaB",
      "reviewText": "We just love this pool, and have had it for 4 years now. The first year was a bit hard to keep clean; the filter that comes with it is not the best and we did not like it at all. The second year we converted over to a saltwater filter. Best thing we ever did, plus the water is more stable and it is considerably cheaper than all the chlorine stuff needed. We also purchased a robot pool cleaner and put it in every night, it keeps the floor and walls crystal clean. We made sure that we sat it up on flat ground, put concrete walkway stones (purchased at Walmart) under the legs, and in the winter we do not take down. In the winter we drain the pool down to about 3 feet and cover real well.",
      "submissionTime": "2011-04-26T05:44:24",
      "title": "Have had this pool for 4 years",
      "upVotes": "498",
      "downVotes": "25"
    },
    {
      "name": "Intex 24' x 12' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "marschb1",
      "reviewText": "The set up dvd is not the best. The most important thing I can share is make sure you have level ground to start. Make sure you put patio block under each of the legs. And most important as you fill this pool the sides will pull in. It will look like the wall are not going to be straight.... KEEP filling it will pust them out as it fills.",
      "submissionTime": "2011-05-19T05:59:27",
      "title": "Good value but...",
      "upVotes": "277",
      "downVotes": "8"
    },
    {
      "name": "Intex 24' x 12' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Jen685965",
      "reviewText": "This pool is better than expected and a great deal for its price. The 12x24 size is the one we bought and its large enough to swim laps of 8 strokes in each direction.\nI will admit it takes more than two people to put it together. We also purchased the intex salt water system to go with the pool in addition to the sand filter that already comes with it. The two systems work great and the pool sparkles.\nYou will not waste a single penny on this purchase!",
      "submissionTime": "2011-06-01T10:56:50",
      "title": "Awesome Pool!",
      "upVotes": "277",
      "downVotes": "25"
    },
    {
      "name": "Intex 24' x 12' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "SoCalFam",
      "reviewText": "I'm a 205 lb 40 year old man with a stiff back and I was able to put this pool together myself. As you have seen in other posts, the ground should not have more than a 2% slope in the long direction, (1/4\" high over a foot long#. The pool slopes this on our backyard concrete pad and is doing fine. Follow the instructions carefully and make sure you have the pump side of the pool at the location you want, because there is no going back once it's up.\n\nsome advise:\n\n1. there is definately a technique when sliding the poles into the sleeves. Once the poles are in about 16-18 feet, they start developing a lot of friction and you might think you'll never get the rest of it in. When this happens use your off hand to hold the mouth of the sleeve while your strong hand holds the pole. Then pull mightely the sleeve and pump the pole in like your driving a stake. Repeat this until the pole reaches the end. MAKE SURE THE POLE HOLES ARE LINED UP WITH THE SLEEVE HOLES.\n\n2. When your filling up pool, the frame will bow in but then go back out once the water reaches it's ideal level.\n\n3. Once the water is in you might feel some anxiety due to having a HUGE trough of water in your backyard. I had visions of the pool structure failing and water bringing down the side of my garage. I wanted to return it but this beast was to big to return. This feeling passed once I woke up the next morning.\n\n4. make sure you use the wood blocking if your installing on soil. I have concrete so the blocking and the tarp were unnecessary.\n\n5. Call a few local pool supply merchants and find the friendliest one that has good experience. Use them exclusively in the beginning so that they get your business and develop a small relationship with you. This is important.\n\n6. The pump is working great! The pool is clean!! My family #wife who is a teacher and on vacation with my 5 year old son and 3 year old daughter# are LOVING it!!!",
      "submissionTime": "2012-06-26T21:47:52",
      "title": "Pool as good as advertised",
      "upVotes": "118",
      "downVotes": "13"
    },
    {
      "name": "Intex 24' x 12' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "JCwhitwell",
      "reviewText": "My kids love it. The wife loves it. I love it. First time ever owning a pool and setting one up as an adult. We had to prep the location where we wanted our pool. I would recommend buying cheap Blue tarps (2 of them 12X24) to be placed under the exact location where the pool will be sitting. The one that comes with it is of poor quality. Plus, this will give you added protection for your pool's bottom. We did however buy a ton of sand to put on the two blue tarps to protect our investment. We are glad we did. We did buy six pressure treated 2x12 at 12feet to rest the \"U\" legs against the ground. We are happy that we did that as one REVIEWER suggested. The pool will settle all together this way. If you have the money to waste, a concrete pad poured at 40X20 would be ideal. If you do this, please buy some padding to place under the pool. I would recommend Styrofoam pads used for insulation purposes. some suggested old carpet. Styrofoam is better. Also, as your filling up the pool it looks like the side walls are going to fall in, It scared us to death. However, once the pool was getting closer to filling up, the walls became upright and perpendicular to the ground. The sand filter pump will take 55 pounds of sand, just like someone said. You can use less sand if you get the ZeoSand. It takes about half the amount for the ZeoSand. Please build a small wooden platform for your Sand Filter Pump. It will make weed eating easier for you. I would use 2x6's to build your box for your sand filter pump. I am glad I purchased this product while it was on sale for $999.99. I have encouraged all my friends to buy it.",
      "submissionTime": "2012-05-19T06:22:26",
      "title": "First pool I have ever setup & owned as an Adult.",
      "upVotes": "117",
      "downVotes": "13"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.52",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "1"
      },
      {
        "count": "2",
        "ratingValue": "2"
      },
      {
        "count": "1",
        "ratingValue": "3"
      },
      {
        "count": "14",
        "ratingValue": "4"
      },
      {
        "count": "43",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "62"
  },
  "availableOnline": true
}
