{
  "itemId": 40720866,
  "name": "Intex 32' x 16' x 52\" Ultra Frame Rectangular Swimming Pool",
  "salePrice": 1099,
  "upc": "078257312160",
  "categoryPath": "Toys/Outdoor Play/Swimming Pools & Waterslides/Swimming Pools/Metal Frame Swimming Pools",
  "brandName": "Generic",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FIntex-32-x-16-x-52-Ultra-Frame-Rectangular-Swimming-Pool%252F40720866%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FIntex-32-x-16-x-52-Ultra-Frame-Rectangular-Swimming-Pool%2F40720866%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_14521_132873",
  "reviews": [
    {
      "name": "Intex 32' x 16' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "deadeyedoc",
      "reviewText": "This pool was more than I expected! Fairly easy to assemble, not even the couple hours that have been suggested! My wife and I spent a day and a half setting it up, to make sure every thilng was correct. Ground prep was about 2-3 days. Killing all weeds and grass, then laying down a bed of sand to set the pool on. We have been using the pool for about 10 days now and really enjoy it, and it has really impressed several of our friends. This pool is a lot larger in person than in pictures!! Terrific for swimming and cooling off in 108 temps! The quality of the pool is very good. All supports and pool liner are very strong and I know we will enjoy it for years to come.",
      "submissionTime": "2012-06-01T08:43:49",
      "title": "Great Pool",
      "upVotes": "245",
      "downVotes": "25"
    },
    {
      "name": "Intex 32' x 16' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Dukester",
      "reviewText": "It cannot be overstated that the key to this pool is getting the ground very level. I used a simple device called a water level, which made for easily insuring all sides and corners were level. You must also place 2\" or thicker patio type concrete blocks under each of the 24 u-shaped legs and be certain that the blocks are flush or level with the ground; otherwise not only will the legs sink into the ground, but also the pool sides will not straighten when the pool is filled with water. As others have noted, though not indicated in the minimal instruction manual provided, the walls WILL bow inward until about the last foot or so of water is added. This can be a somewhat scary sight if not prepared. The 2,500 GPH sand (sand not included) filter pump provided does the job, along with the Intex Krystal Clear Saltwater System I purchased separately. The water is perfectly clear with NO user added chemicals other than stabilizer (cyanuric acid). The provided ladder is a bit flimsy, but still adequate. But additionally, the also provided pool volleyball game (net and ball) is a very unexpectedly fun added treat! Consider purchasing the Intex 12 volt DC magnetic type pool light (I installed two due to the 32' length of the pool) and you can enjoy this quality pool any hour of the day or night!",
      "submissionTime": "2012-06-23T20:04:42",
      "title": "A Lot of Pool for the Money!",
      "upVotes": "220",
      "downVotes": "22"
    },
    {
      "name": "Intex 32' x 16' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "JimOfOhio",
      "reviewText": "Yes, it's a lot of pool. Had it for 2 weeks now. No problems. The chemicals are much easier to keep stable than the littler pools. We all love it.\n\nThe biggest pain in the rear end was getting the ground leveled... do yourself a favor and hire someone to level it for you. My yard was out of level by 4 inches and it took me a week to get it close.\n1 week of painstaking work = 1 grumpy dad = 3 happy kids :)",
      "submissionTime": "2012-06-09T12:25:04",
      "title": "It really is that big...",
      "upVotes": "122",
      "downVotes": "28"
    },
    {
      "name": "Intex 32' x 16' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "davhah",
      "reviewText": "As mentioned before, the pool site must be level. Be sure to level a site, that is at least 4' larger than the dimensions of the pool. I prepared the site, moving 14\" of dirt on one end. Let the site settle for a couple of rains, or use a sprinkler to settle the dirt. Use green treated lumber #2 - 2\" X 10\" X 18\"# under each side post. At first, I used cement blocks and half broke, after a 3\" rain. I took the pool down the first winter, to fix the leg support blocks, but have left it up the past three winters #Iowa#. For winter, drain the water down to the suction hose hole. This will save you about 7,500-8,500 gallons of water, plus salt, for the next season. Our pool is on its 5th season and we love the pool. My parents have a standard chlorine system and there chemical costs are triple what I spend. The salt water system is fantastic. When the pool does finally fail, I will order a new one. Very good product, spend the extra time and money at setup, it will prevent many problems down the road.",
      "submissionTime": "2013-07-21T19:02:51",
      "title": "Great value",
      "upVotes": "85",
      "downVotes": "15"
    },
    {
      "name": "Intex 32' x 16' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "3"
        },
        {
          "label": "Meets Expectations",
          "rating": "3"
        }
      ],
      "reviewer": "rachelpinkcivic",
      "reviewText": "i purchased this pool in June, i would recommend buying it in off season (i told my husband we should wait) i paid $1,600 and now it is down to $1300 , and its July, im sure by September it will be at $999\nFirst off, when you have it delivered, know that i weighs like 600 pounds, divided into 2 boxes, so you will want a dolly handy..\nMake sure you have your ground leveled, and i mean PERFECTLY . . save yourself the time and hassle and pay to have it done!!! Our ground was off by 9 inches, my husband tilled it up and then brought in a bob cat to dig, using a digital surveyor level, it was perfectly level after we brought in 6 tons of sand, which cost $150 dollars... my husband built it out an extra 5 foot and put landscape timbers around to keep the sand in... that cost another $60. We had to buy (2) 2x12 pieces of wood and (1) 2x16 all cut into 15 inch pieces to make 24, because you have to have either wood or concrete under each of those things that stick out or they will sink through the sand/ground and break in half!! The corners of this pull do not lock, i think it maybe to expand with the pool, It took almost 15,000 gallons of water to fill up, which took a day and a half to fill, it is very scary to watch as it fills, because the pool is caved in everywhere and look like its going to just bend and bust, but it literally does not fix itself until the very last few inches of water are filled, luckily we did a lot of googling/reading reviews, and saw where people drained their pools thinking it would bust, to realize they wasted all that time and water, so don't do it!!!\nWe didn't see that the pool here at walmart came with a salt water pump, and i went ahead and bought the saltwater/sand filtration pump from vminnovations.com for $389, so now i have an extra pump.. but i def. recommend getting the sand pump to go with it, all we did was buy the salt\nwhich cost $75 (cheapest place to buy is Academy Sports) and then we bought salt from a place that sold pool supplies, for $12 ... and then we bought an optional conditioning for the salt water that you put in if it gets murky, which we have yet to have to do, we have had our pool up for 3 weeks and we love it. the pump i bought has an automatic timer, and you only have to put salt in once a year (unless low when you check your salt level) and change the sand every 5 years in the filter... you don' have to buy any throw away filter/ no chemicals... all we have to do is clean out leaves since we put ours in a partially shaded area under a tree, we also bought a cheap fence from home depot to put all the way around it so our dogs would not chew on anything (better be safe than sorry) .. all together we ended up spending about $3,000 dollars by the time it was all said and done. As perfect as my parents and husband made it, with getting all the wrinkles out and all, you can't get to close to the very edge of the pool because it kind of pops out, which i read happens to alot of people, you can't push off the sides or anything when swimming, you don't want to hang out on it, and the ladder it came with is very narrow and wobbly!!!! Hope to have a deck built all the way around it next year, saw it on a youtube video, where people make it more like an inground pool!!! I feel this was a VERY good buy, it was going to be $30,000 for an inground, and we have had 8 people comfortably swim around, my 3 year old LOVES it and i enjoy swimming laps just like i would in an inground, i feel it was a great investment for 3,000 dollars. hope to just get 5 or 6 years out of it, since i hear they don't last forever. Read that two different people left them up all year, my husband said we would just drain it half way and store the pumps in a dry place!!!!",
      "submissionTime": "2012-07-23T09:39:04",
      "title": "Have an extended budget",
      "upVotes": "72",
      "downVotes": "11"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.14",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "1"
      },
      {
        "count": "3",
        "ratingValue": "2"
      },
      {
        "count": "2",
        "ratingValue": "3"
      },
      {
        "count": "13",
        "ratingValue": "4"
      },
      {
        "count": "27",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "49"
  },
  "availableOnline": true
}
