{
  "itemId": 39273127,
  "name": "Intex 18' x 9' x 52\" Ultra Frame Rectangular Swimming Pool",
  "salePrice": 799.88,
  "upc": "078257312115",
  "categoryPath": "Toys/Outdoor Play/Swimming Pools & Waterslides/Swimming Pools/Metal Frame Swimming Pools",
  "brandName": "Generic",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FIntex-18-x-9-x-52-Ultra-Frame-Rectangular-Swimming-Pool%252F39273127%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FIntex-18-x-9-x-52-Ultra-Frame-Rectangular-Swimming-Pool%2F39273127%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_14521_132873",
  "reviews": [
    {
      "name": "Intex 18' x 9' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "MominMinden",
      "reviewText": "Originally purchased this pool from Costco In the Summer of 2009. We had a special cement pad poured for it. We have had the pool for 4 Summers so far and know we can get at least one or two more Summers on the liner. When we contacted Intex to purchase a replacement liner for a later date since we now have the rectangular pad and don\"t wish to change the size or shape of the pool in the future, they wanted $629 plus $130 shipping for the liner ONLY! After doing some research I discovered Walmart had a complete set including an upgraded sand filter system for $699 with FREE Site to Store shipping! The decision was a no brainer! It is good to have extra plastic parts over the years which we have purchased directly from Intex in the past. I can honestly say as a family of Five with children ranging from 10 to 21 we have had hours of fun with this pool!!! We invested in the Intex Salt Water System which Walmart also sells and after adding the salt in the begining of the season there are NO chemicals needed!!! We also invested in a solar system and actually had the pool up to 96 degrees last Summer! A little too warm for my taste! Last year We also went online and bought a ladder that had a locking door for safety on it since we had little neighbors nearby. Only tip We have is to rub baby powder on the long metal tubes you put in the plastic liner to hold up the sides. It made it so much easier to get the tubes out at the end of the Summer when we took it down. Had a little trouble the first Summer before we knew this tip but after that smooth sailing. WELL worth the money and holds up MUCH better than the blue liner version of this pool!!! A MUST buy!!!!!",
      "submissionTime": "2013-02-21T20:29:08",
      "title": "Best purchase we ever made!!!!!",
      "upVotes": "277",
      "downVotes": "23"
    },
    {
      "name": "Intex 18' x 9' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewText": "I bought this size pool because it wouldn't take up my entire yard and seemed like a good size. Set-up was easy. I would like to say that the long sides were bowing in pretty badly until the last 9 inches of fill up. It bowed in by about 5 inches in the middle. Also, it is really important to keep periodically walking around and pullin the brace-legs taught. I would highly recommend a solar blanket to warm it up. Mine moved 10degrees in one day. The ladder is kind of flimsy but works fine. Also, you need at least 2 people to set up and be sure to use baby powder on the steel beams as it will glide them through so much easier. Love this pool!",
      "submissionTime": "2013-04-14T19:29:58",
      "title": "Perfect size for relaxing",
      "upVotes": "162",
      "downVotes": "17"
    },
    {
      "name": "Intex 18' x 9' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "AquaSkier",
      "reviewText": "This pool is great, strong pump and filter. It came with everything except the sand for the filter. $12. The narrow 9' width fits nicely in the back of the yard and takes up much less space than the round pools. Walmart.com was 1/2 the price of other online retailers and free ship to store saved us even more $. Make sure to level your ground and use a layer of sand for a perfect finish. I used 1 yard of sand over grass to make sure we had not bumps. I used the side of an extension ladder to make it perfectly smooth before laying down the included ground tarp and then the pool.",
      "submissionTime": "2013-04-18T08:33:02",
      "title": "Fantastic (Huge) pool easy installation",
      "upVotes": "111",
      "downVotes": "12"
    },
    {
      "name": "Intex 18' x 9' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "BakerSt",
      "reviewText": "We thought this pool would go down in price , it did . We ordered it with a price of 599.00 with the shipping free [ 140.00 ] but before we did I went to Lowes and purchased 3-1000 lb bags of sand @ 32.00 each, formed up a area of 11ft. X 22 ft. leveled. It took just over 2 hrs. with the wifes help , I did not like the instructions ! Very well built , but the ladder is not very good but a cheap purchase to replace. Every thing [ all prep work ] was done waiting for arrival , pilot shipping brought it to my doorstep as it weights 300 lbs in the box . even the driver was a nice person . We truley enjoyed putting up the pool , even in 93 degree sunny heat. Beore you turn on the pump be sure to check the L shaped gaskets to the INLET/OUTLET hardware to be sure no leaks. Also love the pump timer . If anyone lives in my area and needs a hand with set up I would be glad to help you . Rocky Mount , NC 27804 , Daniel .",
      "submissionTime": "2013-07-09T07:46:39",
      "title": "Great purchase",
      "upVotes": "102",
      "downVotes": "13"
    },
    {
      "name": "Intex 18' x 9' x 52\" Ultra Frame Rectangular Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Cammer64",
      "reviewText": "This particular pool was not available on locally and this was our first order from Walmart.com, since we live in Canada we had it shipped to a parcel service on the border. My wife and I set this up in the morning by ourselves. It was fairly straightforward but we had gone to the internet to get setup tips before hand. Baby powdering the bars made inserting them very easy. It took 10 hours to fill with a garden hose, our city water has a bit of brown to it this time of year and the sand filter cleaned it up over night till it is crystal clear. We also ordered the salt water system to cut down on the chemicals we put in the water. It works like a charm and we expect very little maintenance this year running the pool. It was nice that most everything was included so we weren't running around looking for a ground sheet and a quality pool cover was a wonderful surprise. The size is perfect for the two of us to float around in and have a drink, then slide off the chair and have a swim under water. If we still had kids at home we would be ordering the next size bigger however.\nWe are really happy with the pool and how much we paid for it. Good job Intex and Walmart.",
      "submissionTime": "2013-07-21T15:15:41",
      "title": "We love this pool",
      "upVotes": "92",
      "downVotes": "10"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.36",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "5",
        "ratingValue": "1"
      },
      {
        "count": "3",
        "ratingValue": "2"
      },
      {
        "count": "2",
        "ratingValue": "3"
      },
      {
        "count": "25",
        "ratingValue": "4"
      },
      {
        "count": "56",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "91"
  },
  "availableOnline": true
}
