{
  "itemId": 39264346,
  "name": "Intex 15' x 48\" Metal Frame Swimming Pool",
  "salePrice": 249,
  "upc": "078257310562",
  "categoryPath": "Toys/Outdoor Play/Swimming Pools & Waterslides/Swimming Pools/Metal Frame Swimming Pools",
  "brandName": "Generic",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FIntex-15-x-48-Metal-Frame-Pool%252F39264346%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FIntex-15-x-48-Metal-Frame-Pool%2F39264346%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_14521_132873",
  "reviews": [
    {
      "name": "Intex 15' x 48\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "EDinOBX",
      "reviewText": "I bought this pool and was very pleased with the outcome. It's not the Olympic sized pool we all crave ,but for cooling off its perfect.\nThe pool had everything in the box. Setting up took me about an hour. I suggest getting all the pins and parts in oreder to make set up go smooth. Ground level is a must, just as everyone says.\nLike the directions say, put a small amount of water in the pool (2'') and STOP. Get all the crinkles and wrinkles out. Then fill pool. I have well water and we are almost in a drought, so using 2 houses, I filled my pool in 12 hrs.. Filled pool 4hrs at a time then let pumps rest for an hour. I did this over a 3 day period, because of our drought. . Other then that pool is well worth the time and money you will spend on it.\n\nPS.. If you have an extra 40 bucks, buy a good thick tarp,not a cheap tarp, but a 10 mil or thicker tarp if this is going over sand or dirt... or even grass. A good tarp will not allow sharp little objects or stones to penetrate the liner. Its cheaper than buying a few tons of sand.\nI know my comment is long, but if your short on cash, you want to know the most about a product before you buy it.\nThank you for reading and stay cool !",
      "submissionTime": "2011-07-06T08:51:02",
      "title": "Fun Times",
      "upVotes": "987",
      "downVotes": "20"
    },
    {
      "name": "Intex 15' x 48\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "vicrogster",
      "reviewText": "I have waited 3 weeks to write my review. I felt obligated to write a review since I rely heavily on them. There were so many complaints of holes and leaks that I figured from the review ratio that I had at least a 25% chance of a leak thus waiting to review.\n\nWe set the pool up on a cement slab. Had read other reviews that used old carpet underneath. Had a ridiculous time finding enough old carpet and ended up with one 10 X 12 piece. Our slab was a bit rough and knew that we needed to put something underneath. It was going to cost $150 to buy a foam liner from a local pool company. We bought 8 sheets of 8 X 4 styrofoam insulation from Home Depot for $9 a sheet. We laid the old carpet on top which makes the floor extra soft which is nice. Checked the slab with a level and it appeared level. Wrong. It looks to be about 1 1/2 to 2 inches off on one corner. This was the source of my anxiety for several days. The poles are leaning and it made me very nervous. My husband kept telling me it wasn't going anywhere. After 3 weeks, it hasn't. We are in our 50's and haven't had any rough-housing kids in it yet.\n\nWe also opted for the Intex Saltwater Chlorinator. I really like the idea of not adding a bunch of chemicals. It is $60 cheaper to purchase it online from Wal Mart than purchasing it straight from the store like us. We seemed to have a little trouble getting one of the adapters snug enough and have rigged it on. We are newbies to the pool world and seem to be struggling with our ph levels but after 3 weeks we have not had green or cloudy water. Really enjoy the softness of the saltwater.\n\nWe purchased the Intex floating cooler/drink holder from ebay. We actually put another little soft-sided cooler inside because the ice melts quickly.\n\nMy main complaint with pool is the ladder. We are not decrepit or large but the ladder is a big enough issue that I find myself really dreading to get out to do anything. It does not seem very sturdy or stable. That was one reason we bought the cooler so it would be one less reason to get out.\n\nIt did take us 2 hours instead of 45 minutes to assemble but overall very simple. We had toyed with the idea of getting an in-ground but I have to say that for about $600 so far, we have enjoyed floating around in our little poor man's oasis vs. a $40,000 investment. If you're entertaining the idea, I say go for it! Also, I was in complete shock when the water bill came and our bill was only $40 more than last month.",
      "submissionTime": "2011-06-28T16:37:35",
      "title": "Has been great",
      "upVotes": "1001",
      "downVotes": "72"
    },
    {
      "name": "Intex 15' x 48\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "Icefire77",
      "reviewText": "After doing several weeks of researching, we decided to purchase the 15 X 48 Metal Frame Pool vs the 15 X 48 pool with air ring. A pool this size needs to be very strong and able to with stand the capacity of 4400 gallons of water. With the air ring, I was afraid that a slight puncture would deflate the ring, causing the wall to come down and pouring out 4400 gallons of water all over the place.. So the metal frame is what we went with. First of all, it takes awhile to get the pool up, so don't think its a 45 min job like the box says, and YES you do need to have your ground as level as possible, for you don't want to have too much water up against one side of the pool, which could cause it to break. I do like the metal frame poles that are constructed enough to hold the amount of water for this pool. I do like that fact it supports the extra strength you need to hold such water volume. I did level my ground and then coated it with a couple tons of sand and had it smoothed and leveled before applying a 16 x 20 extra tough tarp over the sand (ground cover did not come with my pool) bought from local hardware store. After laying sand and tarp, I put pool up and then filled a couple of inches to get as many wrinkles out as possible then layed 4 3/4 x 11 1/2 inch plywood cuts under each pole to prevent it from sinking into the sand after the pool has been filled. Some reviews don't agree with the sand, due to this issue, but it does give it a raise from the ground, preventing any type of grass, weed or root to pop up and cut into your liner. So far its been real good and I have had no issues thus far. I wish the pump could be a bit better for the pool, but its doing the job now, it turns 1000 gallons per hour. I used liquid Chlorine and algaecide in the pool and it looks great. If you jump in or so, it does push the water pretty good and rocks the side walls of the pool, but as long as you don't over do it, you should have no worries. I recommend you keep several filters on hand. You will need to clean or change out every 3 days or so, unless you have good quality water or little use. The Vac that came with this pool is a bit on the cheap side and Intex did not provide enough hose to actually spread across the pool so you will have to purchase an extra long hose for that job. Skimmer works wonderful with the pump (auto skimmer). As long as you follow basic instructions for installing the pool, you should have no issue, just make sure you have level ground before filling. Pool cover is okay, draw string on it could have been a bit better constructed so you can pull it tighter when covered, but better then going out and buying your own if your on a budget like me. Hope this helps in deciding which pool is your pool of choice. I'm very happy so far, but only had the pool up just under a week, so I guess time will tell...",
      "submissionTime": "2011-07-02T16:50:52",
      "title": "Great Pool For The Coin",
      "upVotes": "395",
      "downVotes": "51"
    },
    {
      "name": "Intex 15' x 48\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "540sailor",
      "reviewText": "This is long, but through. I've had this pool for 4 years and getting ready to replace it with another one just like it.\nWe decided to get one of these pools several years ago. Since where we live there is no flat ground, I built a large 16x16 box and filled it with sand. I covered that with a tarp and set up the pool. No directions were needed, just some common sense. It took me about an hour to get it out of the box and set up. It helps to have another person to help, but is not required. The liner can be a little heavy to move around, but that's because it's pretty thick and therefore makes the pool a lot more durable. Once you have the liner in position and the poles and rail in place, put about one inch of water in the bottom of the pool. Get all the wrinkles out NOW! If you don't, they will be there until you drain it and they will catch debris at the bottom of the pool, making it look dirty and possibly puncturing the liner. It took me two days to fill the pool. 12,000 gallons of water and i'm on a well. My water is cold (65 degrees), so plan ahead to get the water up to swimming temp. Allow a few days to a week depending on starting temp.\nThe ladder is minimal at best. It does the job. Ours broke the first year and we had to replace it. The replacement ladder was not much better. Recommend building a deck and getting a better ladder.\nWe used the pump and filter that came with the pool for the first year. You have to change the filters regularly and keep up on the chlorine or you are asking for trouble, but that's any pool.\nWe switched to the saltwater system the second year. No more chlorine. No more PH tests. No more maintenance except changing the filters and cleaning out the leaves. The problem with the saltwater system with this pool - steel poles and rails and saltwater. Bad combination. Would still do it again though. The poles and rails will start to rust eventually, even without the saltwater system.\nThe poles and rails are held together with plastic pins. They work great, but get brittle after being in the sun throughout the year. Recommend ordering extras to start and replacing them each year with new ones.\nIn four years we have only had two leaks. The patch kit that comes with the pool works very well as long as your tear/ hole is on a flat part of the liner and not in the corner where the liner meets the wall.\nIt's 48\" deep, so almost anyone can stand up in it. I've had as many as 14 people in this at one time.",
      "submissionTime": "2012-04-19T09:55:04",
      "title": "Great for the money, but don't expect the olympics",
      "upVotes": "170",
      "downVotes": "13"
    },
    {
      "name": "Intex 15' x 48\" Metal Frame Swimming Pool",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Beamanager",
      "reviewText": "This is an excellent option for families with kids ages 5 - 15. Only 4 ft deep, so most can stand up, but deep enough to \"swim\". It isn't aan in ground pool, but it's not $15,000 either. I have a friend that recommended this item as he has had his for 5 years. Not sure it will last 5 years, but even one whole summer is a great deal! Get one - easy to assemble in about 90 minutes, and it really beats the heat for less than $250 - cannot beat it! I am surprised how nice it really is for the price - I expected a cheap, flimsy, poorly made piece of plastic with a rail, but it really does do the trick. I think you'll like the pool! As for the ladder - I think a small deck is in order - the ladder really is the weak point here!",
      "submissionTime": "2011-06-28T19:06:25",
      "title": "Better than anticipated",
      "upVotes": "348",
      "downVotes": "46"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.23",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "70",
        "ratingValue": "1"
      },
      {
        "count": "31",
        "ratingValue": "2"
      },
      {
        "count": "46",
        "ratingValue": "3"
      },
      {
        "count": "278",
        "ratingValue": "4"
      },
      {
        "count": "541",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "966"
  },
  "availableOnline": true
}
