{
  "itemId": 21670040,
  "name": "Jarden BEF6500-UM Bionaire Electric Fireplaceblk",
  "salePrice": 178.22,
  "upc": "048894043970",
  "categoryPath": "Home Improvement/Heating, Cooling, & Air Quality/Heating/Indoor Fireplaces",
  "brandName": "Jarden",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FBionaire-Electric-Fireplace-Black%252F21670040%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FBionaire-Electric-Fireplace-Black%2F21670040%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "1072864_133032_1161932",
  "reviews": [
    {
      "name": "Bionaire Electric Fireplace, Black",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "moonfireangel",
      "reviewText": "I researched electric fireplaces extensively before I purchased this one and this is the best value and quality for the price. I was very pleasantly surprised when it arrived to see that it has 4 thermostat settings which most up to the price have none. The remote adjusts the thermostat to what temperature you desire or by the length of time you would like it to run and also the brightness of the flames which has 5 settings. They are separate adjustments so that you can have only the flames for atmosphere or heat only or both. The artificial flames are very real looking and certainly provide the ambiance of a real fire burning. I love the clear and opaque rocks that come with it and they create a sparkle reflection to enhance the artificial flames. The two fan speeds are very quiet which was also a very nice surprise. It also came with a 1 year warranty which many don't come with any warranty or a max of 90 days. I also purchased the 2 year extended warranty with it which makes it a total of 3 year warranty for only $19! This fireplace is so attractive and high quality that I recommend when you are purchasing it that you design the location where you intend to put it as the focal point of the room, otherwise it could look awkward because it is so attractive. Unfortunately that was my problem and I had to return it. We have a 66\" big screen which takes up the focal point of the room along with the surround sound and it did it no justice to put it along a sidewall. I am a designer so maybe I am being too critical but it is just that nice of a fireplace and fairly large with it's 35\" width.\nI am volunteering this information because I am one that makes my judgements to purchase heavily based on the reviews that others post. I am very impressed with this electrical fireplace and I highly recommend if you are in the market for a very nice one that you consider this one. I think you'll be pleasantly surprised at the quality and appearance as I was.\nIt shipped very fast to my home the only problem was that the warehouse messed up the shipping label and it was returned to Walmart. They made it right by placing the order again and then sent it expedited shipping and did not charge me the additional cost.\nI hope this helps others with making their decision.",
      "submissionTime": "2012-11-28T13:09:24",
      "title": "Beautiful High Quality Fireplace!",
      "upVotes": "73",
      "downVotes": "6"
    },
    {
      "name": "Bionaire Electric Fireplace, Black",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "parentadvocate",
      "reviewText": "My husband put it on the wall of our bedroom & it looks great! Heats up fast & has a timer & several settings for the flames.\nLOVE IT",
      "submissionTime": "2012-10-31T12:22:43",
      "title": "Fireplace",
      "upVotes": "33",
      "downVotes": "2"
    },
    {
      "name": "Bionaire Electric Fireplace, Black",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "donzter",
      "reviewText": "Did lots of research before buying an electric fireplace this is the best one hands down! Great flames, Big display window, 4 different brightness levels, Nice Dual color glass stones, clear and opaque. Slightly curved front glass is great for a corner. Heat comes out if the top, so can be placed on a dresser like we wanted. Heat and/or lighting have separate controls. This thing is awesome, and adds just the romantic ambiance any couple should desire! The soft flames lull my wife to sleep every night, instead of the TV! Thanks Bionaire!",
      "submissionTime": "2013-01-20T10:47:14",
      "title": "Best electric fireplace at any price!",
      "upVotes": "29",
      "downVotes": "7"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "4"
  },
  "availableOnline": true
}
