{
  "itemId": 16563558,
  "name": "KAZ INC HCM-350 HONEYWELL COOL MIST HUMIDIFIER",
  "salePrice": 66.98,
  "upc": "092926003500",
  "categoryPath": "Home Improvement/Heating, Cooling, & Air Quality/Humidifiers",
  "brandName": "Kaz Inc",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FHoneywell-Cool-Moisture-Humidifier-HCM-350%252F16563558%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FHoneywell-Cool-Moisture-Humidifier-HCM-350%2F16563558%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "1072864_133032_133042",
  "reviews": [
    {
      "name": "Honeywell Cool Moisture Humidifier HCM-350",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "JenSW",
      "reviewText": "I bought this to replace a leaky Vicks/Taz humidifier that I'd had for about a year. This one is twice the price, but far superior. No leaking, better design, quieter operation, UV germ-killing feature, and a different kind of fan/vaporizing action that does NOT leave a damp area around the humidifier. In fact, you can't even FEEL the mist coming out, but clearly it does, because the water level in the reservoir falls, and it's certainly not going on the carpet. That said, my only complaint about an otherwise-perfect design is that the cap to the tank can be HARD to open, even after I press the center piece to release the vacuum pressure. I even tried using rubber jar openers and have had to get my husband to open it for me sometimes (and I'm not exactly a weakling). The past few times I have tried not to screw it on so tight (so far no leaking), and it has been easier to open. Not sure how much the Protec filter replacement will cost when I have to get that -- wish it were filterless.",
      "submissionTime": "2011-11-28T13:30:38",
      "title": "Great humidifier, but tank cap can be hard to open",
      "upVotes": "76",
      "downVotes": "2"
    },
    {
      "name": "Honeywell Cool Moisture Humidifier HCM-350",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "McSprite",
      "reviewText": "This humidifier is all and more of what I expected. It's easy to operate and extremely quiet. I recommend it highly.",
      "submissionTime": "2011-09-30T09:12:09",
      "title": "Best humidifier EVER!!",
      "upVotes": "56",
      "downVotes": "0"
    },
    {
      "name": "Honeywell Cool Moisture Humidifier HCM-350",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "atthedoorstep",
      "reviewText": "I was hesitant to buy this humidifier because the filter needs to be replaced at the beginning of each winter season, but then thought that might be a good thing. (The filter is only $13.00.) I looked at a lot of humidifiers and wanted one that I didn't have to clean every day. This one has a UV light that purifies the water to remove mold and bacteria. The humidifier uses regular tap water. It is easy to fill the tank and the unit is extremely quiet. Walmart's price of $60 was the same as Amazon's - and there is no shipping if you pick it up at the store. Overall, a great investment at a reasonable price.",
      "submissionTime": "2013-02-24T08:20:25",
      "title": "Water purified by UV light, decent price, quiet",
      "upVotes": "48",
      "downVotes": "11"
    },
    {
      "name": "Honeywell Cool Moisture Humidifier HCM-350",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "TheManOnTheRadio",
      "reviewText": "I bought this cool moisture humidifier because my wife complained about it being too dry in our bedroom during the winter. We would both wake to clogged noses and inability to breath through our nose at night. The HCM-350 has really delivered on curing that problem. I read all of the reviews of various models of cool moisture humidifiers and decided on this model.\n\nWe have a rather large bedroom suite with attached bath, walk-in closets, etc. This one unit has raised the humidity in our bedroom to where it doesn't seem dry at all now in spite of outdoor temps in single digits at night. With forced air heat, the HCM-350 has even gone a long way to humidifying the entire first floor of our house. It was very simple to set up and we have not needed to replace the filter yet. I am happy with this purchase and considering purchasing one for my 98 year Mother for her retirement apartment.",
      "submissionTime": "2013-01-05T14:19:14",
      "title": "Did the trick for our bedroom",
      "upVotes": "26",
      "downVotes": "3"
    },
    {
      "name": "Honeywell Cool Moisture Humidifier HCM-350",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Energy Efficiency",
          "rating": "5"
        }
      ],
      "reviewer": "TNT001",
      "reviewText": "This humidifier does wonders for me. My nasal passages are less dry, and i have better sleep. It helps a lot in the cold dry winter, plus the heat that's being used indoors.\nIt says that this is about 25% quieter than a typical humidifier, but it's much more quiet than \"25%\" lol whatever that means. I barely notice that it's on.\nTo be honest, the size is a little big bigger than i expected. I though it'd be a little more compact. But I'm used to the size by now. Doesn't bug me as much",
      "submissionTime": "2013-11-13T19:33:37",
      "title": "Amazing!!",
      "upVotes": "22",
      "downVotes": "2"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.44",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "1"
      },
      {
        "count": "3",
        "ratingValue": "2"
      },
      {
        "count": "3",
        "ratingValue": "3"
      },
      {
        "count": "30",
        "ratingValue": "4"
      },
      {
        "count": "68",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "108"
  },
  "availableOnline": true
}
