{
  "itemId": 42910889,
  "name": "LEGO City Service Truck",
  "salePrice": 24.86,
  "upc": "673419230568",
  "categoryPath": "Toys/Building Sets & Blocks/Bricks & Blocks",
  "brandName": "LEGO",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FLEGO-City-Service-Truck%252F42910889%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FLEGO-City-Service-Truck%2F42910889%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_4186_133013",
  "reviews": [
    {
      "name": "LEGO City Service Truck",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "RadoSteve",
      "reviewText": "I love this set, a lego Chemical Toilet, thats just pure Genius, it even comes with a roll of toilet paper! The only way it could have been better would be if Lego included a Newspaper tile :)\n\nBrilliant Brilliant Brilliant!",
      "submissionTime": "2015-02-03T10:06:06",
      "title": "Yes! A lego Toilet, Brilliant!",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "LEGO City Service Truck",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "0liver23",
      "reviewText": "Love the chemical portaloo\nLove the bright yellow for the truck bodywork\nThe mini figures\nAnd the drill is cool to",
      "submissionTime": "2015-01-01T13:38:59",
      "title": "Epic",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "LEGO City Service Truck",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "amazed78",
      "reviewText": "This set is definitely worth the money. A portable toilet for minifigures?! You just have to have one. Maybe Lego should include the toilet in the Fairground Mixer set?\n\nWith those headlights the car looks a bit like a Renault Trafic or a Citroen Jumper.\n\nThe only flaw in this set is that the plates that hold the side panels of the truck bed down tend to come off when you open up the sides to get better access.",
      "submissionTime": "2015-02-21T03:39:41",
      "title": "Again a Must-Have Set",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "LEGO City Service Truck",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "VirtualMirage",
      "reviewText": "I don't usually buy the Lego City theme, I am more of a Creator Expert modular building kind of guy, but I felt it was a must have when I first laid eyes on it. I've been wanting a little something to put on a my shelf as a place holder for when I've got a new building in progress, this nailed it.\n\nThe set didn't take too long to build and is pretty sturdy once everything is put together. If anything was a challenge, it would have been the roof to the port-a-potty. The way the directions described putting it together kept causing the inverted slopes to collapse when trying to connect the pieces. Simply changing the order of what pieces go on next corrected this.\n\nThis little build has a lot of playability and works well with many different types of themes and stories. Their are a good amount of moving parts such as the doors, wheels, and crane that kids/adults like. I also appreciate the humor in having a port-a-potty and the inclusion of the boss with his expression and the employee plays well with each other.\n\nIf I have any complaints, it would be with the stickers. I am not a big fan of stickers, so there is some biased opinion here. But I do wish the sets came with two sets of stickers for those that like to reuse the pieces for other creations (thus, removing the stickers) as well as for those that don't have the steadiest of hands.\n\nAs what I expect from Lego, quality control is high and I wasn't missing any pieces (actually, there were some extras). I will say that one of my car doors has quite a noticeable indentation on the outside that I do not believe is normal (the other door has a smaller, less noticeable indentation and my older sets have none at all). But the door still opens and closes properly, and the edges sit flush with the rest of the bricks. This problem is quickly remedied by contacting Lego customer service. I have done so in the past and their customer service and speed in resolving the problem is excellent.\n\nTo summarize: Fun product. If it wasn't for the need of all the stickers and the lack of a duplicate set of stickers, it would have gotten 5 stars. I would rate it 4.5 stars, but only whole number are allowed. So I give this set a strong 4 stars!",
      "submissionTime": "2015-04-03T07:51:18",
      "title": "Fun set with a sense of humor",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "LEGO City Service Truck",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "My03Tundra",
      "reviewText": "I missed out on the Lego Movie set that had the Port-a-Potty, and that was one I may still track down. Even though this set lacks the direct potty-humor that the movie one obviously had, the novelty is still definitely there.\n\nThe set is laid out in the numbered bags, with the truck, trailer, and toilet in their own bags. The assembly is very easy to follow, and fun. There were no surprises and everything clicked into place with the typical Lego precision and quality.\n\nOnce fully assembly you have a very interactive set for the $25 price. You get a City Utility truck with bed sides that can fold down, a left side driver position (with obligatory coffee cup) and quite a few nice accessories. You get minifigure accessories such as a shovel and a broom, jackhammer, refuse/recycle can, construction barriers and even a small control panel.\n\nThe control panel is in the left rear area of the bed and adds a bit of realism for the boom used to life the toilet off of it's trailer and onto the ground. The best part is you can actually use the boom to pick up the toilet and have it hanging for display purposes! If you have a Lego City display, this set will look fantastic next to or at a work site! The only thing I think could be better, was if there was a Technic version of this set with moving parts on all elements!",
      "submissionTime": "2015-04-03T16:53:36",
      "title": "May the best toilet joke win!",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.83",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "5",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "6"
  },
  "availableOnline": true
}
