{
  "itemId": 36157511,
  "name": "Madden NFL 15 - Xbox 360",
  "salePrice": 26.99,
  "upc": "014633733068",
  "categoryPath": "Video Games/Games",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FMadden-NFL-15-Xbox-360%252F36157511%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FMadden-NFL-15-Xbox-360%2F36157511%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "2636_1040579",
  "reviews": [
    {
      "name": "Madden NFL 15 (Xbox 360)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewText": "Do you like sitting on the couch playing video games? Do you like football? Well Madden 15 is the right game for you on PlayStation3 and 4 and Xbox 360 and One. EA Sports has changed up the way you play Madden in the previous year. The graphics and sound quality on the game makes you feel like you are actually watching a real life game on TV. EA Sports has added whole new features to the game. The addictiveness to the game is so wild that you wouldn’t get off your couch.\nThe Graphics and sound on the game makes you feel like you are actually there watching a real life game on TV. Madden 15 graphics have changed from the previous Maddens. This year in Madden 15 they made the players look lifelike. They added every detail that the person has in real life like face structures, height, tattoos, skin color, hair and what type of gear they wear in the actual NFL. You can see the sweat dripping from the player’s body and the grass and dirt stains on their football jersey. In the previous Maddens, the graphics looked like you were playing in an old arcade room because the graphics were that horrible. The graphics were so horrible that the players appeared to be going through the other player’s body when they made a tackle. The graphics were so horrible that the player’s face and body didn’t look like them. When you would zoom into the players face in the previous Maddens their face looked like a blob of color. EA sports graphic designers have helped Madden 15 to make the players faces look more realistic. They also added a face scanner mode which allows you to take a picture of your face and put it in the game for a player you can create. The football stadiums used to all look alike, but the designs might be a little different. Now the football stadium graphics look like how they look in real life.\nThe sound quality of Madden 15 is so good that it makes me feel like I’m actually watching the game on TV. You can hear the fans on both sides cheering when a good play happens or hear the fans booing at you when you make a stupid decision. The commentators sound just like how they sound on TV when they criticize the players on something good or bad in the game. While playing Madden 15 you can hear the pads colliding together when they tackle or the player’s voices when they break a huddle. You can also hear the QB’s deep voice when he calls out an audible or hot route to his receiver.\nWhen Madden 15 came out, EA Sports added new features to the game. Usually in the previous Madden everyone cared about offense. Quoted by Bear Bryant, “Offense wins games, but defense wins championship.” (Bryant 1). This year in Madden, they focused more on the defensive side. They added new tackling mechanics to make the game more realistic. In the previous Madden, a player would just dive at another player and the ball carrier would fall down. In Madden 15, you have to tackle like you actually play football, which is getting lower than your opponent, or you will get ran over. In the previous Madden, the QB would throw the ball against the best defensive backs in the game, and the wide receivers would make the catch even if the defensive back is close to them. If a linebacker is close to the ball carrier, he wouldn’t react like how they do in real life. Madden 15 added a player sense 2.0 which allows the defensive player to respond much better and smarter to the ball or ball carrier. It makes the defensive side much smarter and makes them react just like how they would react in real life.\nThe addictiveness to the game is so crazy that you wouldn’t get off your couch. Madden 15 added a lot of features this year. They changed up the connected franchise mode to make it seem like you are the head coach of the team or the team captain. They added Game Prep which allows the players to make sure their team is ready for the upcoming games by practicing and going to the film room. They also added the Confidence Changes which means, depending on how the player plays that game, his confidence goes up or down if he wins or loses just like in real life. While playing Madden 15, you can go online, play against anonymous people, and get your world rank up by beating high rank players and winning games. By playing on online games, you can enter a tournament if you are one of the best and get cash prizes. The more games you win the more noticeable you get in the Madden community.\nMadden has completely changed from how it used to be back then. If you didn’t pay the cable bill and your favorite game is on TV just put in Madden 15. The graphics and sound quality is just like how the games are on TV. Throw away your old Madden games because Madden 15 added a whole lot of new features to the game. Madden 15 starts to become more addictive when you start playing it a lot and winning a lot of games. If you love American football and cash prizes, pick up Madden 15.",
      "submissionTime": "2014-10-29T20:01:42",
      "title": "BEST GAME EVER",
      "upVotes": "33",
      "downVotes": "13"
    },
    {
      "name": "Madden NFL 15 (Xbox 360)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "awilliams288",
      "reviewText": "Love the new game!",
      "submissionTime": "2014-09-13T01:24:23",
      "title": "Madden awesome as always!",
      "upVotes": "38",
      "downVotes": "17"
    },
    {
      "name": "Madden NFL 15 (Xbox 360)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        }
      ],
      "reviewer": "Karilynns",
      "reviewText": "Great game & the price was right on line with in store pickup.",
      "submissionTime": "2014-10-24T19:36:12",
      "title": "My son loves this game!",
      "upVotes": "22",
      "downVotes": "7"
    },
    {
      "name": "Madden NFL 15 (Xbox 360)",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Panaboy757",
      "reviewText": "I order my game and they give me a date to pick it on time I like how they work I will order from here more",
      "submissionTime": "2014-10-12T20:18:10",
      "title": "Love it",
      "upVotes": "6",
      "downVotes": "4"
    },
    {
      "name": "Madden NFL 15 (Xbox 360)",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "greeneyes1218",
      "reviewText": "bought this for my son. the graphics are amazing.",
      "submissionTime": "2014-09-28T20:02:13",
      "title": "like being there in person",
      "upVotes": "4",
      "downVotes": "1"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.51",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "7",
        "ratingValue": "1"
      },
      {
        "count": "5",
        "ratingValue": "3"
      },
      {
        "count": "17",
        "ratingValue": "4"
      },
      {
        "count": "84",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "113"
  },
  "availableOnline": true
}
