{
  "itemId": 42371639,
  "name": "Monster High Haunted Faceless Ghost Doll",
  "salePrice": 15.74,
  "upc": "887961037555",
  "categoryPath": "Toys/Dolls & Dollhouses/Fashion Dolls",
  "brandName": "Monster High",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FMonster-High-Haunted-Faceless-Ghost-Doll%252F42371639%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FMonster-High-Haunted-Faceless-Ghost-Doll%2F42371639%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_4187_133047",
  "reviews": [
    {
      "name": "Monster High Haunted Faceless Ghost Doll",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "5"
        }
      ],
      "reviewer": "Gingerbreadforest",
      "reviewText": "Kiyomi Haunterly is the Daughter of the Noppera-bo – a faceless Japanese ghost. Kiyomi has a very different look for a Monster High doll. Because she is faceless, her features are painted with a metallic silver/white paint and can only be seen close up. Kiyomi is a ghostly shade of pale sky blue, and she has long hair in shades of pink, purple, and magenta.\n\nKiyomi loves fashion, especially anything “floaty”. She is wearing a purple plaid dress with sheer details. All MH ghosts wear some kind of chain accessories to help keep them grounded. Kiyomi has a purple chain necklace and pink chain belt. She carries a purple handbag that has a pink face painted on it. Her other accessories include a pink bracelet, blue hair ornament, pink anklets, and gray high heeled mary jane shoes that have a black heels that are made to look like a face. Kiyomi comes with a hairbrush and a doll stand made up of translucent blue chain. The stand is meant to hold her in a position that will help her to look like she is floating.\n\nKiyomi has a very interesting diary. Her character can change colors according to her mood and she can also change her face to match others. Kiyomi loves fashion and has been spying on Draculaura through a magic portal. She loves calligraphy, udon noodles, and the color purple. She also has a pet baby Kaiju (translation: strange creature) that is not included with the doll. Kiyomi is a very interesting new addition to the Monster High universe. I am not sure how she will be received with her delicate, almost invisible features. Personally, I think she is very cool and unique and I was happy to add her to my collection.",
      "submissionTime": "2014-12-15T08:13:08",
      "title": "Kiyomi Haunterly - Facelss Fashionista",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Monster High Haunted Faceless Ghost Doll",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "5"
        }
      ],
      "reviewer": "Kathy",
      "reviewText": "Received this doll for Christmas. I love her! Her face is very unusual. I am a goth doll collector so she fits in nicely with the rest of the MH collection and others that I have acquired. I like the spookness of her appearance.",
      "submissionTime": "2015-01-09T09:31:42",
      "title": "Another great Xmas gift received",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Monster High Haunted Faceless Ghost Doll",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "5"
        }
      ],
      "reviewer": "Amanda1985",
      "reviewText": "Kiyomi Haunterly is a perfect addition to any Monster High collector and fan. My daughter has been a huge Monster High fan since she was 2 in 2008 and fell in love with Monster High instantly. This was her top choice for Christmas and she was so happy to finally get Kiyomi. Although this doll is faceless the details of her face is beautiful and classy. Her outfit is incredible! My daughter wants to be a fashion designer and her words was \"Kiyomi has killer fashion!\" Thank you Mattel for making my daughter's Christmas the best and for making mine for seeing her beautiful smile while she opened it for Christmas!",
      "submissionTime": "2014-12-26T07:48:01",
      "title": "Haunterly Charming!",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Monster High Haunted Faceless Ghost Doll",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "5"
        }
      ],
      "reviewer": "kuthinks",
      "reviewText": "For me, she's perfect - color scheme, adorable clothing + accessories, amazing details and great pose-ability. A notable improvement about the Haunted line is the doll stand-- not only is it pretty in itself, it is much more stable and will effectively hold the doll. Like the other dolls in this line, their plastic skin is slightly translucent. I find this gives the doll a very life-like quality that's a step above the usual plastic (ironic, because they're ghosts, right?). I can't get enough of her!",
      "submissionTime": "2014-11-29T21:04:08",
      "title": "My Favorite Monster High Doll.",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Monster High Haunted Faceless Ghost Doll",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "5"
        }
      ],
      "reviewer": "Mommykcbb",
      "reviewText": "My daughter absolutely loved it. Very colorful doll!",
      "submissionTime": "2015-01-02T15:37:29",
      "title": "Great Product!",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "7",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "7"
  },
  "availableOnline": true
}
