{
  "itemId": 15137637,
  "name": "Mothers Carpet and Upholstery Cleaner",
  "salePrice": 11.83,
  "upc": "078175054241",
  "categoryPath": "Auto & Tires/Auto Detailing & Car Care/Interior Care/Car Leather, Vinyl & Upholstery Cleaners",
  "brandName": "Mothers",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FMothers-Carpet-and-Upholstery-Cleaner%252F15137637%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FMothers-Carpet-and-Upholstery-Cleaner%2F15137637%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "91083_1212910_1212918",
  "reviews": [
    {
      "name": "Mothers Carpet and Upholstery Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "MissDeon",
      "reviewText": "I bought this in order to clean out my carpet and upholstery in my car after my seats had begun to get stained by water, and my back seat floor had flooded several times from the hurricane season in the Florida. I used this the other day and I was amazed. My driver seat was horrible and now it looks new again. It didn't get everything cleaned in the back seat floor because they were really tough, but it got most of them out. This product definitely exceeded what I expected. I really was just hoping it worked, but it actually worked. I can only speak for myself with this. It worked for me, might not work for someone else, but it did for me. It also had a pleasant enough smell. Didn't seem too strong to me.",
      "submissionTime": "2012-08-14T06:39:42",
      "title": "My First Carpet Cleaner",
      "upVotes": "14",
      "downVotes": "0"
    },
    {
      "name": "Mothers Carpet and Upholstery Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Towne",
      "reviewText": "I purchased this to clean 9 used chairs I bought for my game room. Some chairs were in pretty bad shape, but when I sprayed this with the Mother's Cleaner, rubbed them with a soft bristle brush and wiped them with a clean rag, they looked brand new and the cleaning was effortless. As a side note the chairs were cloth. I normally never write reviews, but this product exceeded my expectations and I would give it 10 stars if they were available!",
      "submissionTime": "2013-11-21T07:22:03",
      "title": "Great Product",
      "upVotes": "3",
      "downVotes": "0"
    },
    {
      "name": "Mothers Carpet and Upholstery Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "JohnnyO1955",
      "reviewText": "I had really bad coffee and soda stains on my carpet and upholstery.This product did what it said.It is a great product now my car looks new again and smells great.This is the best product out there.The only problem was I had to order this on the internet and wal-mart has the best price.Advance Auto - Auto Zone do not carry this product on their shelves and Amazon was to HIGH OF A PRICE.The only other cleaner that is equal to Mothers is Meguiars carpet and upholstery cleaner I have used them all and these are the only two cleaners that do the JOB and only TRUST.",
      "submissionTime": "2014-01-12T02:54:48",
      "title": "The Best",
      "upVotes": "1",
      "downVotes": "0"
    },
    {
      "name": "Mothers Carpet and Upholstery Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Raptozilla",
      "reviewText": "This product works great right out of the box if your carpets aren't too dirty. If they are really dirty, it still works great, but you have to use a little elbow grease to get the stains out. The rear passengers carpet in my car was much dirtier than the rest of the carpet.\n\nWhat I did to get the carpet in this area looking almost new was:\n\n1. Spray the Mother's on the carpet as directed.\n\n2. Use a wet cloth to rub in the Mother's so that the carpet becomes wet and starts foaming. The foam turns brown as it brings the dirt out of the carpet.\n\n3. Rinse out the cloth and wring it out so that it's damp and mop up the foam with the dirt in it.\n\n4. Repeat steps 2 & 3 several times without using more Mother's, just the wet cloth and then the damp cloth.\n\n5. Do a final mop up of the foam with a clean, dry cloth.\n\n6. Allow the carpet to dry for 24 hours or more and repeat steps 1 through 5. If your carpet is still dirty, repeat again after waiting another 24 hours. Do this as many times as needed to get the dirt out.\n\nThe idea is to allow the water and foam to soak the dirt out of the carpet and then mop up the foam that contains the dirt; the more foam you can generate, the better it works.\n\nOn the first application of Mother's on this area, the rinse water became the color of cola or coffee, but by the time I was done, it was almost clear. It worked beautifully in my case.",
      "submissionTime": "2014-12-14T20:05:42",
      "title": "I was impressed.",
      "upVotes": "1",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "5",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "5"
  },
  "availableOnline": true
}
