{
  "itemId": 16491180,
  "name": "Multi - Band World Receiver Radio - SY-ICF-SW7600GR",
  "salePrice": 149.46,
  "upc": "027242580084",
  "categoryPath": "Electronics/Other Electronics",
  "brandName": "Sony",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSony-ICFSW7600GR-Portable-FM-Stereo-World-Band-Receiver-Radio%252F16491180%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSony-ICFSW7600GR-Portable-FM-Stereo-World-Band-Receiver-Radio%2F16491180%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944",
  "reviews": [
    {
      "name": "Sony ICFSW7600GR Portable FM Stereo World Band Receiver Radio",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Spike111111",
      "reviewText": "I owned this radio 20 years ago. The Walmart page on this shows several other computerized multi-band radios, and while there might be some of the same chips inside, every one is a little different.\n\nSony's most unremarked, and most valuable, value added is that USB/LSB switch, which does more than just sideband shortwave. When you are in Boston listening to 760 Detroit, set it to LSB and it will reject interference from 770 New York City. If there were a stronger station on 750 (and \"strong\" varies from day to day), you'd flip the switch to USB. As the feature summary indicates, you can also set the radio to 761 or 759 or whatever.\n\nThe 0 through 9 buttons are station presets (and there are now many \"pages\" of presets). Two extra presets (the A and B buttons) have not just a frequency but a time-of-day: an elegant way of doing a dual alarm clock. That radio (with battery back-up) was the most dependable way of waking up to catch a plane. I also liked the backlit screen--I stuck a piece of plastic inside to make it stay lit all the time.\n\nMy old Sony got dropped once too often and I'm limping along with a similar model from Panasonic that has none of the above features and isn't even stereo, but I will eventually buy this Sony. I deduct one Value point because the price of Sony radios never seems to come down, as it should have by now.",
      "submissionTime": "2011-12-22T14:05:59",
      "title": "Sony-specific extras sets it apart",
      "upVotes": "7",
      "downVotes": "0"
    },
    {
      "name": "Sony ICFSW7600GR Portable FM Stereo World Band Receiver Radio",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "astevens",
      "reviewText": "This is my first Sony SW radio and I could not be happier with initial quality and reception. Has a nice quality to the build, seems like good materials and does not feel flimsy. The design looks like a 10 dollar radio but the sound and reception make up for it. Would be nice to have a dial to adjust channels but they seem to break on lower end units anyways and since it is a pll tuner not analog, the buttons do just fine. Kudos to the quality control at Sony on this unit.",
      "submissionTime": "2009-08-24T13:21:56",
      "title": "Way to go Sony...",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony ICFSW7600GR Portable FM Stereo World Band Receiver Radio",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "ASMO",
      "reviewText": "The quality of this unit is exceptional. The dials and buttons all work smoothly.\nI purchased this radio specifically for the shortwave functions. This model can pick up continous shortwave coverage through all bands including single side band (ham radio) and CB. This is the only small portable with synchronous detection which reduces fading on shortwave and AM bands. If you like talk radio, ham radio, and shortwave broadcasts then this is the radio for you. FM on this radio is ok but the single speaker was not made for high fidelity sound although there is stereo through the use of headphones.\nThis is one of the few Sony products that is still made in Japan and you can tell immediately the heft and quality of the unit when holding it. Nice job Sony!",
      "submissionTime": "2009-02-12T08:29:57",
      "title": "Excellent Portable Radio",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony ICFSW7600GR Portable FM Stereo World Band Receiver Radio",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "Trebor",
      "reviewText": "It was dissapointing to find that this product ships without an AC Adapter as part of the package when purchased in the U.S.!!! Consequently, I had to buy one from a different company ($25.00) that is designed for this unit. Sony can do better",
      "submissionTime": "2011-11-04T19:17:02",
      "title": "ICF=SW7600GR",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony ICFSW7600GR Portable FM Stereo World Band Receiver Radio",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Pianoman",
      "reviewText": "Great product and I love the radio. Really solid build and looks and feels really well built. Having good performance. It would be better to have a ac adapter for the radio.",
      "submissionTime": "2011-12-24T04:41:06",
      "title": "Great Solid product",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.64",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "9",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "11"
  },
  "availableOnline": true
}
