{
  "itemId": 39604131,
  "name": "Nikon SB-500 AF Speedlight Camera Flash",
  "salePrice": 246.95,
  "upc": "018208048144",
  "categoryPath": "Electronics/Cameras & Camcorders/Accessories/Flashes",
  "brandName": "Nikon",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FNikon-SB-500-AF-Speedlight-Flash-LED-Video-Light%252F39604131%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FNikon-SB-500-AF-Speedlight-Flash-LED-Video-Light%2F39604131%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_133277_132913",
  "reviews": [
    {
      "name": "Nikon SB-500 AF Speedlight",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "ClassicDigital",
      "reviewText": "I bought this flash as a small compact alternative to my two SB-700's. Those flashes work fine, however when mounted on a smaller DSLR such as my D3100 or D5100 they make for a top heavy setup. This flash fixes that. It runs on two AA batteries and is good for about 150 shots. The front facing LED lights do an amazing job of providing additional light for shooting video in poor lighting conditions or to provide fill light for contrasty outdoor situations (The flash head and LED's can do the same for still photography). The flash head is fully adjustable just like on my SB-700. I always put off buying the SB-400 and SB-300 because of the limited movement those flash heads provide. To adjust settings the SB-500 is controlled in the cameras menu just like the popup flash and the SB-300/SB-400. So the range of adjustability is limited by the camera body your shooting with not the flash. The flash head unfortunately isn't able to zoom like my SB-700's but this flash was designed to be a simple to operate compact unit. As for using this flash in i-TTL and commander modes? It does a fantastic job at both. In i-TTL modes this flash provides just the right amount of light for most indoor situations you might encounter. It will work better then the built in flash for outdoor conditions to as its coverage and power is far greater then the built in flash on your camera.\n\nTo put this flash in commander mode simply flick the switch to either group A or B, then put your D80, D90, D7XXX or most FX bodies in commander mode and set it to either Group A or B and set either to channel 3. If you have an old Nikon D70 or D70s your in luck to as the SB-500 is fixed to channel 3 in both Group A and B. The D70 will only work in Group A and is also fixed to channel 3 (Thanks Nikon for continuing to support my old D70 and D70s !). The flash can now be used as a slave on those bodies.\n\nUnfortunately the SB-500 has no flashing lights to indicate that its in slave mode. If Nikon could fix this in a firmware update so that maybe one or all three of the front LED lights flashed dimly in slave mode that would be great. Otherwise thats the only thing I can nitpick about this flash. Getting back to using this flash in Commander mode. You basically set the flash power in camera or set the commander mode to i-TTL. It can't get any easier then that. If you have a D750 or D810 the SB-500 can be used to command other flashes which improves the range of the cameras built in commander (Older bodies don't have this option which is a shame. I'd like to see this in a firmware update on my D7000).\n\nSo in conclusion the SB-500 is a great little flash that has one little bug that hopefully can be fixed with a firmware update.",
      "submissionTime": "2014-12-21T08:29:41",
      "title": "The perfect upgrade to the old SB-400!",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Nikon SB-500 AF Speedlight",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "789Rick",
      "reviewText": "Smaller lighter smarter addition to fleet of awesome Nikon flashes. Also has LED video light making this a versatile addition to Nikon tool kit.",
      "submissionTime": "2015-01-05T05:49:35",
      "title": "Nikon's new fixed focus TTL a winner!",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Nikon SB-500 AF Speedlight",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "JWBFlorida",
      "reviewText": "This flash is amazing. Swivel head allows fantastic lighting for photos.",
      "submissionTime": "2015-01-05T12:08:18",
      "title": "Speedlight worth the money",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "3",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "3"
  },
  "availableOnline": true
}
