{
  "itemId": 14895654,
  "name": "Ninja Master Prep Food Processor - As Seen On TV-NINJA MASTER PREP",
  "salePrice": 35.98,
  "upc": "622356527088",
  "categoryPath": "Home/Appliances/Kitchen Appliances/Food Prep and Processors",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FNinja-Master-Prep-Food-Processor%252F14895654%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FNinja-Master-Prep-Food-Processor%2F14895654%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_90546",
  "reviews": [
    {
      "name": "Ninja Master Prep Food and Drink Maker",
      "overallRating": {
        "label": "Overall",
        "rating": "3"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Features",
          "rating": "3"
        },
        {
          "label": "Durability",
          "rating": "1"
        },
        {
          "label": "Appearance",
          "rating": "3"
        }
      ],
      "reviewer": "SnowedinWy",
      "reviewText": "I bought this product so I could make protein shakes daily, crushing ices was a major factor in the purchase decision. I have used the product almost daily for over three months and a few days ago the plastic drive cracked and broke, rendering the power pod useless. The blades are marvelous and I've chopped vegetables and nuts in the smaller container and it worked like a charm. Cleaning the containers and blades is quick and easy. The rubber rim on the bottom make it so there's no slippage. The lids are a bit difficult to clean, especially the pitcher's. After three months of use the plastic has stained and there's grit stuck where I can't get to it. Bottom line, this product worked great, made ice into snow every time, love the blade design, but it just isn't durable. It's almost all plastic- and will crack under pressure. If this product had glass containers and a metal drive, then I might think about buying that.",
      "submissionTime": "2010-12-09T13:11:36",
      "title": "Great product initially",
      "upVotes": "376",
      "downVotes": "32"
    },
    {
      "name": "Ninja Master Prep Food and Drink Maker",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "primalspy",
      "reviewText": "My wife had been wanting one of those Montel Williams Health Master blenders but $200.00?! Are you kidding me? She loves making vegetable & fruit smoothies every morning & with a regular blender it was taking about 10 minutes. I bought this Ninja as a surprise for her. I hid it where we normally kept the blender & she was thrilled when she found it! The Ninja has been amazing! It has saves us time! Now our smoothies are smooth with no more chunks. I used the small container to make some of the best guacamole I’ve ever tried. You don’t have to cut everything up too small. The blades are extremely sharp & cut through very efficiently. The motor seems to be quite powerful & doesn’t hesitate at all. Not too difficult to clean. I highly recommend this!",
      "submissionTime": "2010-09-07T13:19:08",
      "title": "Works better than expected!",
      "upVotes": "479",
      "downVotes": "53"
    },
    {
      "name": "Ninja Master Prep Food and Drink Maker",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "4"
        },
        {
          "label": "Durability",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "giglyn",
      "reviewText": "I love my smoothies in the morning. But none of the blenders I've purchased have made them as well as the Ninja. My smoothies completely rival my favorite smoothie shop. I buy fruit on sale and freeze it on cookie sheets. Once frozen, I put them in plastic bags in the freezer. When I'm ready to make a smoothie, I drop a handful of ice cubes in the Ninja and give it a couple of pulses. Then open it and add about a 1/2 C to 3/4 c of my fruit of choice and about 1/2 cup of liquid. You can use juice, water, milk, coffee - whatever you like. Give it about a 15 second spin and you're ready to fill a glass and run out the door. The downside is that you have to remove the top to add the ingredients. But it's so fast, it's really not that big of a deal. I love my Ninja. I have to admit I'm a little concerned about durability. I haven't had any problems yet after 3 months of daily use, but the area on the lid where the gears fit in look like they are starting to wear. I'm keeping my fingers crossed it will last for a long time to come.",
      "submissionTime": "2010-09-18T19:12:10",
      "title": "Best smoothie maker yet!",
      "upVotes": "301",
      "downVotes": "26"
    },
    {
      "name": "Ninja Master Prep Food and Drink Maker",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "punkstermom",
      "reviewText": "This is my favorite kitchen appliance now! We have made smoothies, and made soooo many things in the food processor! It chops veggies for our veggie pizza perfectly, it chops through pecans and frozen cream cheese with ease, and it was so fast chopping up a whole block of cheese for a pasta salad! I just love love loved the results from everything we have put it to the test with. I will be using it to make baby food in a few months and have not one doubt it can make every baby food I want it to and save me tons of time and money. This will save you HOURS of time and food prep. Only pulse it once at a time (its super sharp!!!) and this is for sure a product that goes over well if you have a dishwasher. I would be terrified to clean it without one since it is so sharp and has tiny grooves. I would recommend this a million times over!",
      "submissionTime": "2011-03-28T17:32:48",
      "title": "In LOVE!",
      "upVotes": "186",
      "downVotes": "41"
    },
    {
      "name": "Ninja Master Prep Food and Drink Maker",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "RaeRaeMo",
      "reviewText": "Bought this to make frozen drinks, smoothues, shakes...any sort of cold beverage. I was amazed at how smooth it blended the ice. No more struggles with my old blender with 10 different buttons. One button, very easy to use and I get great results every time!!!",
      "submissionTime": "2013-07-31T19:31:15",
      "title": "Great vale, great performance!!",
      "upVotes": "131",
      "downVotes": "24"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.61",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "19",
        "ratingValue": "1"
      },
      {
        "count": "8",
        "ratingValue": "2"
      },
      {
        "count": "14",
        "ratingValue": "3"
      },
      {
        "count": "78",
        "ratingValue": "4"
      },
      {
        "count": "407",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "526"
  },
  "availableOnline": true
}
