{
  "itemId": 39322878,
  "name": "Nutri Ninja 2-in-1 Blender",
  "salePrice": 89,
  "upc": "622356536448",
  "categoryPath": "Home/Appliances/Kitchen Appliances/Blenders & Juicers",
  "brandName": "Ninja",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FNutri-Ninja-2-in-1-Blender%252F39322878%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FNutri-Ninja-2-in-1-Blender%2F39322878%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_90546",
  "reviews": [
    {
      "name": "Nutri Ninja 2-in-1 Blender",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Marciara",
      "reviewText": "The reason I decided to try this blender was a weird one. I fell in love with coffee blended with butter and MCT oil, and was using a blender made by Hamilton Beach. All I needed for this blender to do was blend my coffee along with these two ingredients, but I hated dragging out my big plastic blender. It just seemed like overkill, and it was too much clean-up. I was tired of the little Hamilton Beach blender spewing coffee out from the top of the lid, burning my hand. The final straw was after pressing down on the lid to ensure it was tight, the coffee blew through the lid again, spewing coffee all over my kitchen! Time to send that baby to the trash. Gotta get something else to complete the job.\n\nI originally bought the Ninja blender that had just the two cups, and was shocked at what it could do. However, for $100, it had better do more than just blend my coffee! So, I saw this one on Walmart.com, and bought it instead since it has a processor PLUS two cups. Granted, the cups are a little smaller and so is the blade and the watts, but how much power do you really need to blend a drink?!\n\nLet me say that I love this blender! I read reviews about the Magic Bullet and NutriNinja, and this brand had the best reviews. I love the power it has, I like the portability for the cups for my morning protein shakes...and I LOVE the clean-up. It's so easy to use, washes up nicely and feels sturdy. This blender is smaller than the one with the two cups, and that's fine since I don't have much space anyway. Honestly, I have not tried the processor yet, but I will. I just blend my coffee drink every day, so i tend to use the cups a little more.\n\nThis 2 in 1 makes a fantastic addition to any home, or would make a great gift. Since there were no reviews, I thought I would post one to let others know how fantastic this product is. It's still $80 on sale, but by the quality, I am pretty sure I will be enjoying it for years to come!",
      "submissionTime": "2014-12-18T18:32:04",
      "title": "Best blender EVER!",
      "upVotes": "60",
      "downVotes": "2"
    },
    {
      "name": "Nutri Ninja 2-in-1 Blender",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "kf4624",
      "reviewText": "I love this machine..i got it for xmas to start making green smoothies in the morning I needed it to cut the veggies up. it works great! haven't used the dough blades yet. the mugs are heavy duty and nothing leaks out of them. I also love the idea of using it as a food processor too.",
      "submissionTime": "2015-01-23T02:10:52",
      "title": "green smoothies",
      "upVotes": "15",
      "downVotes": "0"
    },
    {
      "name": "Nutri Ninja 2-in-1 Blender",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Linda",
      "reviewText": "I haven't used the dough blades yet, but I'm lovin' the smoothies I've made. Some with protein and some with kale/fruit and various other greens and fruits.\nSmall enough not to be in the way when I leave it out, yet it does and AWESOME job making the smoothies in just seconds!",
      "submissionTime": "2015-01-25T08:03:08",
      "title": "LOVE IT!",
      "upVotes": "15",
      "downVotes": "0"
    },
    {
      "name": "Nutri Ninja 2-in-1 Blender",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Earthjewelz",
      "reviewText": "I have actually lost weight using this great product! I make a smoothie twice a day and love the way it liquefies all the ingredients I use. I even made snow from ice cubes without a problem. I have used it to make rice flour from white whole grain rice, almond paste from whole almonds, (added extra virgin olive oil with almonds).\nI've used the processor for great salsa, soups, (cold, never hot liquids), also does cookie dough well and you have to scrape the sides with a spatula, but that's not a problem for me, have to do it with a hand mixer too. Tried the Nutri Bullet and it leaked all over & the cups are too large around. These cups are just right and love the top with the closure to take with me. It has a 700 watt motor and that's plenty for what it's supposed to be used for.\nTry it, you'll really like it!",
      "submissionTime": "2015-02-04T15:28:35",
      "title": "Makes Fantastic Smoothies",
      "upVotes": "11",
      "downVotes": "0"
    },
    {
      "name": "Nutri Ninja 2-in-1 Blender",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "wmhart",
      "reviewText": "For the mid price range of this product - it really performs. I've made shakes with spinach, kale, fruits, etc and it completely breaks down everything in 10-15 seconds. The attachment processor can easily make snow (shaved ice) for snow cones and mixed drinks. Simple to clean and not very loud.",
      "submissionTime": "2015-02-24T14:35:11",
      "title": "Gets the job done!",
      "upVotes": "2",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.63",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "3"
      },
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "6",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "8"
  },
  "availableOnline": true
}
