{
  "itemId": 14668248,
  "name": "Original Curved-Jaw/Cutter Locking Pliers, 10\" Tool Length, 1 7/8\" Jaw Capacity",
  "salePrice": 10.94,
  "upc": "038548005041",
  "categoryPath": "Home Improvement/Tools/Hand Tools/Pliers",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FIrwin-10-inch-Locking-Pliers-10WR%252F14668248%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FIrwin-10-inch-Locking-Pliers-10WR%2F14668248%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "1072864_1031899_1067609",
  "reviews": [
    {
      "name": "Irwin Original Curved-Jaw/Cutter Locking Pliers, 10\" Tool Length, 1 7/8\" Jaw Capacity",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Wilder Hatch",
      "reviewText": "I carry the 5WR with me on a daily basis and have worn out several pair.  They are the only type of locking pliers in my toolbox at work and home.  I have tried several other types including Snap-On and have never found an adequate replacement.  I will continue to use these pliers as they are the only brand that continues to keep their quality and usefulness as the most important part of their history.",
      "submissionTime": "2011-06-05T10:39:15",
      "title": "Technician",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Irwin Original Curved-Jaw/Cutter Locking Pliers, 10\" Tool Length, 1 7/8\" Jaw Capacity",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Matt Ehrenberg",
      "reviewText": "I have a older set of 5wr vise grip pliers I have used them for a little bit of everything I have used them when mounting my bench vise  to a home made stand to put the vise on. The stand that the vise is on the base is a 13\" steel rim with a piece of pipe then a flat piece of metal that the vise is bolted to I used the 5wr when i was tighting the bolts on the vise so i could use my ratchet on the top they were small enough to fit under the steel plate to hold the nut so that i could tighten dwn the bolts. They have saved me more than once",
      "submissionTime": "2011-11-03T09:12:17",
      "title": "Vise Grip 5wr locking adjustable pliers",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Irwin Original Curved-Jaw/Cutter Locking Pliers, 10\" Tool Length, 1 7/8\" Jaw Capacity",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "jim hart",
      "reviewText": "i have been using the vice-grip locking tools for years and find them to be a tough tool of superior quality. Every one i own has paid for itself many times over thanks to their rugged construction and wide variety of applications. No, i don't work for irwin, nor ever have. i just believe they make a better product than all the other locking pliar look-a-likes. the \"original\" vice-grip is the only locking pliar brand for me. Thanks irwin.",
      "submissionTime": "2010-07-30T18:34:19",
      "title": "10 yrs electrician/maintenance-industrial",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Irwin Original Curved-Jaw/Cutter Locking Pliers, 10\" Tool Length, 1 7/8\" Jaw Capacity",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Mad Dog",
      "reviewText": "As a police officer I have seen many strange things. On a busy road I came to a stop at an intersection. The green left turn arrow for an oncoming vehicle came on and as the car began it's left turn it went out of control up onto and across a sidewalk and into a ditch. I investigated and the driver hopped out of the cars exclaiming, \"It wasn't my fault, the Vice-Grips popped off!\" The car had no steering wheel and this guy had been driving with a pair of off brand locking (sort of) pliers clamped onto the steering wheel shaft! A quick glimpse of the offending tool showed that they were an inferior imported copy of you product. I am also a part time mechanic and have an appreciation of quality tools. Of course my tool box includes an assortment of your products, man are 20 years old and perform as new. As the driver received his traffic citation I mentioned we may not have had this encounter had he been using Vice-Grip brand tools",
      "submissionTime": "2014-10-24T07:48:40",
      "title": "Should have used a real Vice-Grip!",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Irwin Original Curved-Jaw/Cutter Locking Pliers, 10\" Tool Length, 1 7/8\" Jaw Capacity",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "BUCKSHOT 322",
      "reviewText": "JUST GOT AN OLDER SET OF 7 WR VISE GRIPS PETERSEN DEWITT NEB ONES TO KEEP IN MY SMALLER HUSKY TOOLBAG FOR GOING FROM MY HOUSE TO A FEW OF THE NEIGHBOR'S HOUSE'S . I TRADED MY NEIGHBOR WHO IS 75 YEARS OLD MY NEW 7 R STRAIGHT JAW TO GET THE OLDER SET OF 7 WR. I JUST GOT THEM TODAY I HAVE NOT HAD A CHANCE TO TRY THEM OUT YET BUT I FIGURE THEY WILL COME IN VERY HANDY WHILE FIXING MY NEIGHBOR'S CHAIN LINK FENCE AND WILL USE THEM FOR WORKING ON MOWERS AS WELL. A FEW YEAR BACK I BROKE A SPARK PLUG ON A MOWER AND MY RATCHET WOULD NOT TAKE IT OUT SO I HAD TO USE MY 5 WR VISE GRIPS TO TAKE IT OUT CAUSE THE 7 WR WAS TO BIG TO USE AND THEY WORKED VERY WELL . VISE GRIP BRAND HAS SAVED ME MORE THAN ONCE WHEN NOTHING ELSE WAS AVALIABLE TO BE USED AT THE TIME. I HAVE SEVERAL NEWER SETS AS WELL AND THEY ARE HOLDING UP GREAT WITH NO ISSUES WHAT SO EVER. THE VISE GRIP BRAND PLIERS ARE MY GO TO TOOL WHEN I AM AROUND THE HOUSE I EITHER USE THE 5 WR, 7 CR, 7 WR, 10 R OR THE 10 WR OR 10 CR DEPENDING ON WHAT I AM WORKING ON AT THE TIME ALONG WITH A SET OF CEE TEE PLIERS MADE BY CRESCENT TOOL COMPANY.",
      "submissionTime": "2014-10-06T12:25:00",
      "title": "MY 7 WR PETERSEN DEWITT VISE GRIPS",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "5",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "5"
  },
  "availableOnline": true
}
