{
  "itemId": 15054780,
  "name": "Panasonic WhisperCeiling Bathroom Fan, 80 CFM, <0.3 sone  APPA08VQ5",
  "salePrice": 149.13,
  "upc": "885170005600",
  "categoryPath": "Home/Decor/Lighting & Light Fixtures/Ceiling Fans",
  "brandName": "Panasonic Exhaust Fans",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FPanasonic-Exhaust-Fans-WhisperCeiling-80-CFM-Ceiling-Mounted-Ventilation-Fan%252F15054780%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FPanasonic-Exhaust-Fans-WhisperCeiling-80-CFM-Ceiling-Mounted-Ventilation-Fan%2F15054780%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_133012_133113",
  "reviews": [
    {
      "name": "Panasonic WhisperCeiling Bathroom Fan, 80 CFM, <0.3 sone  APPA08VQ5",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Natureshots",
      "reviewText": "Easier installation method was never mentioned in the manual and I've cursed at Panasonic until I found an easier way. I have now installed four of these Panasonic fans (50, 80 & 110 cfm) and will be installing two more (yes, the house has too many fans). I eventually found the installation process bearable but the removal of the old fans still dreadful.\n\nMy joist spacing is 16\" so it was not difficult building a frame with a 10.5x10.5\" hole. If one edge of the hole is next to one joist, sometimes simply putting a 2x4 at the other joist would make a perfect fit and sometimes would required shimming. I would fasten the 2x4 to the other joist with a few screws and would have myself a frame for the fan. Build a frame for 24\" joist spacing is a bit more of a challenge but not difficult. I installed all fans from the bottom so the brackets were useless.\n\nIt is impossible to fit the fan assembly through the 10.5x10.5\" hole but by removing ONE screw inside the fan body, the adapter and junction box plate can be removed. With the fan body removed, connect the wires and close the junction box. Connect the adapter and seal with foil tape. With the wires connected and adapter attached, move the junction/adapter plate into place and fasten the flange to the joist with a screw to hold it in place; I typically tilt the top plate about 3 degrees towards the hole instead of having it completely vertical. Push the fan body up the hole to reconnect it to the adapter/junction plate. The tilt from vertical of the adapter/junction plate was to help ease the fan body and the plate back together. If there were no misalignments of the fan body and plate edges, then I was confident that the fit was good. Fasten the flange to the frame; I tilted the screws just a little towards the joist or 2x4, just to make sure.",
      "submissionTime": "2014-10-12T22:43:49",
      "title": "Incomplete instructions caused installation issues",
      "upVotes": "2",
      "downVotes": "0"
    },
    {
      "name": "Panasonic WhisperCeiling Bathroom Fan, 80 CFM, <0.3 sone  APPA08VQ5",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Binkx62",
      "reviewText": "Our hallway bathroom fan was beginning to make strange noises. It had always been loud and for all of the noise it made, you would think it could easily remove the steam from the hottest shower or odor from, well you get my point. The Panasonic fan however, is built for the aforementioned task and it does so, quietly. I had to cut a slightly larger hole in the ceiling but no biggie. The remainder of the installation was easy as well. I did have to remove the fan assembly from the housing to place a couple of screws through the housings pre-drilled holes, into the rafter for extra support. But, this too was easy; remove three screws and the fan assembly slides right out of the housing.\nI will be replacing the master bath fan with a slightly larger cfm Panasonic due to my total satisfaction of this purchase.",
      "submissionTime": "2014-12-09T05:27:06",
      "title": "Affordable and Easy Upgrade",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Panasonic WhisperCeiling Bathroom Fan, 80 CFM, <0.3 sone  APPA08VQ5",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "TPT01",
      "reviewText": "Great fan you hardly know the fan is working I would recommend this item to all my friends.",
      "submissionTime": "2013-09-14T06:54:27",
      "title": "14 September 2013",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Panasonic WhisperCeiling Bathroom Fan, 80 CFM, <0.3 sone  APPA08VQ5",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "scng",
      "reviewText": "Good product specially if you look for quiet fan for the bathroom.\nI have a contractor to install it for about 1 hour.\nThe price is reasonable and worth for it.\nThank you.",
      "submissionTime": "2015-02-09T11:04:57",
      "title": "Very quiet and easy to install",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.75",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "3",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "4"
  },
  "availableOnline": true
}
