{
  "itemId": 17420450,
  "name": "Panasonic Fv11vhl2 Whisperwarm 110 Cfm Ceiling Mounting Vent/fan/heater/lite",
  "salePrice": 295.49,
  "upc": "037988870660",
  "categoryPath": "Home/Decor/Lighting & Light Fixtures/Ceiling Fans",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FWhisperWarm-110-CFM-Ceiling-Mounted-Fan-Heat-Combination%252F17420450%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FWhisperWarm-110-CFM-Ceiling-Mounted-Fan-Heat-Combination%2F17420450%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_133012_133113",
  "reviews": [
    {
      "name": "Panasonic WhisperWarm fan-heat, 110 CFM, 0.7 sone  APPA11VHL2",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "5"
        },
        {
          "label": "Ease of Set Up",
          "rating": "5"
        }
      ],
      "reviewer": "jjsoule",
      "reviewText": "Love how much heat it gives off. You turn it on before you shower or bathe and within 5 mins its already warm the room.\nHaven't had any problems with it so far!",
      "submissionTime": "2013-11-08T06:29:48",
      "title": "Love the heat.",
      "upVotes": "3",
      "downVotes": "0"
    },
    {
      "name": "Panasonic WhisperWarm fan-heat, 110 CFM, 0.7 sone  APPA11VHL2",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Jhkh6",
      "reviewText": "It's big, so be aware of that and it requires a 20A circuit. It moves air out of the bathroom so we don't have any issue with moisture and the mirror getting fogged up. The heater works well and the lights are nice and bright.",
      "submissionTime": "2014-04-28T03:39:29",
      "title": "Nice bathrrom fan!",
      "upVotes": "1",
      "downVotes": "0"
    },
    {
      "name": "Panasonic WhisperWarm fan-heat, 110 CFM, 0.7 sone  APPA11VHL2",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "AverageGuyInstaller",
      "reviewText": "I purchased this fan because it had great reviews. What attracted me to it was that it was supposed to be quiet and still move quite a bit of air. Yes, it was more money than other fan/light combinations, but as the subject said, you get what you pay for.\n\nI'm just a normal guy and not a handyman or electrician. I have an average ability to figure things out and installed this fan after some studying and going slow. I consulted the internet quite a bit as well for things like removing the old junction box at the switch and installing a new one after I ran new wire through the attic and plumbed it through the wall.\n\nAlso, I did not have a 20amp breaker in my breaker box which this requires. Removing and installing a 20a can be done by anyone, just make sure you watch a youtube video on how to do it so you don't end up getting electrocuted. If you touch the wrong thing in a breaker box, it's going to hurt.\n\nI read other reviews about making sure you cut the installation hole for the ceiling unit pretty tight, otherwise you'll have to do some drywall work on the ceiling. Some reviews said there was no way to install it without having to do drywall work. Therefore, I used a piece of cardboard and made a template for the cut. Yeah, you could use the measurements they provide in the instruction manual for the cut, but I liked using the cardboard template as I knew I could cut it tight and rounded like the flange on the corners. I'm glad I did as the plastic light/fan cover that you install only hides about a half inch on each side of the flange once installed.\n\nBe sure to remove the aluminum exhaust port before installation. There's a sticker indicating you do so, but some might over look it. It's easily removed with a phillips and 4 screws. It goes back on after you get it installed, removing it helps you get the unit in the tight hole you cut. If you end up building a frame in the attic to mount the unit, make sure you give yourself enough space to fit the exhaust flex hose to the exhaust port and it's not blocked by the 2x4 frame.\n\nI ended up running flex hose from the exhaust port to the soffit. I didn't want to cut an exhaust port in my roof and risk creating a leak. There's a really cheap vent cover you can get at a certain hardware store whose name starts with an L and ending in S.\n\nWiring it up was simple with the correct wall switch. I ended up running new 12-3 wire from the unit to the wall switch. I read that if you're using a 20 amp breaker, you should use 12 gauge wire. Since I only had a light in the ceiling and this is a 4 function fan/light/nightlight/heater, I didn't have enough wires to wire each function separately to the switch. I purchased a 4 function, panasonic, 3 toggle switch. Basically, the top toggle if pushed left runs the light, the middle is neutral (off) and to the right is the night light. The bottom two toggles will run the vent and the heater. It was an expensive switch, around $50-$70 depending on how hard you search, but it was worth buying to get the install done correctly.\n\nI did this as a one man job, but I could see where it would be handy having a helper to crawl up in the attic and assist pulling wire, holding the box in the ceiling while you screw it in, etc. I certainly got tired of making trips back and forth, but I didn't have any other option.\n\nAs far as function, the exhaust fan is super quiet and really sucks out the air. I can now take showers and the mirrors are not foggy.\n\nThe heater works pretty well and is the only reason I gave it 4 stars for function instead of 5. I expected it to be a bit warmer. It still heats the room but in my head I was expecting a dry sauna, lol. Once the element gets warm, there's a fan that kicks on to blow the heat down in to the bathroom. If there wasn't a fan to blow the heat down, the exhaust fan would just end up sucking it out before it was able to heat the room. Overall, it still works really well for a 8x10 bathroom.\n\nThe lights work as expected. The night light is nice when you don't want full blast light for 2am trips to the bathroom.",
      "submissionTime": "2014-12-23T20:57:01",
      "title": "Great product and you get what you pay for",
      "upVotes": "1",
      "downVotes": "0"
    },
    {
      "name": "Panasonic WhisperWarm fan-heat, 110 CFM, 0.7 sone  APPA11VHL2",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "1Joel1",
      "reviewText": "The Panasonic WhisperWarm 11VHL2 is equipped with a very quiet vent fan, a moderate 1400 watt heater with blower, two florescent lights and a night light. Because of the heater, this unit needs to be wired to a 20 amp breaker using a minimum of 12 gauge wire. I replaced an existing vent fan that sounded similar to a fan boat or leaf blower. This vent is very quiet and works very well. The heater is adequate as a supplement to warm a smaller bathroom. The only complaint is that the vent cover is not designed so the heat disperses in all directions, but rather blows straight down from the ceiling. This unit does not include any switch. Each component of this unit will need to be wired to an individual switch. I had this wired using two dual switches. Decals were included to label individual switches.\nOverall I'm very happy with this product and would recommend it.\n\nDual Switch example\nhttp://www.walmart.com/ip/Leviton-R62-05634-0WS-Leviton-R62-05634-0WS-15-Amp-White-Decora-Dual-Switch/21796930",
      "submissionTime": "2015-01-16T12:49:51",
      "title": "Panasonic WhisperWarm fan-heat with light",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.75",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "3",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "4"
  },
  "availableOnline": true
}
