{
  "itemId": 26603156,
  "name": "Pragmatic Adjustable Bed Frame Head and Foot, Multiple Sizes",
  "salePrice": 269,
  "upc": "810240020412",
  "categoryPath": "Home/Furniture/Bedroom Furniture/Beds",
  "brandName": "Pragma Bed",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FPragmatic-Adjustable-Bed-Frame-Head-and-Foot-Multiple-Sizes%252F26603156%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FPragmatic-Adjustable-Bed-Frame-Head-and-Foot-Multiple-Sizes%2F26603156%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_103150_102547",
  "reviews": [
    {
      "name": "Pragmatic Adjustable Bed Frame Head and Foot, Multiple Sizes",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Chuffed",
      "reviewText": "After reading the lengthy review, among others, from the gentleman that highly recommended this bed I took the plunge and ordered it a couple of weeks ago. It arrived this morning and I so wanted to like this bed :)\n\nIt took me longer to put together than some of the reviews, partly due to not too great instructions, partly to not following said instructions (my bad). I'm also 58 with arthritic knees and hips so crawling around on the floor to put together made it a little harder for me - but I did put it together on my own. It is heavy not light as one reviewer stated but they may have purchased a smaller size. (This one weighs 80lbs total pieces). It comes in two pieces - i.e. you put the 2 sides together identically, place them side by side, connect the electronics and finally attach brackets to ensure the bed stays together and so that both sides raise and lower at the exact same height - these worked well and were necessary. It was not difficult to put together just awkward for me due to my physical abilities.\n\nWell as I said I so wanted to like this bed but have to confess that I love it! It is sturdy and seems to be well made. Only time will tell the longevity of the motors. The motors (4 total - 2 for each foot end and 2 for each head end) are quiet (once the mattress was on I couldn't hear them at all). The remote is wired and clips onto the frame. I purchased this cheaper bed frame so that I could afford the best organic latex mattress which is quite expensive. You can only use a memory foam, latex, futon or similar type mattress on this frame (no sprung mattresses). The finished height of the bed with an 8 inch mattress is the same as my previous box spring and spring mattress combined. All in all I'm one happy shopper in this instance and highly recommend if you want an adjustable but think you can't afford it to try this one.",
      "submissionTime": "2014-06-03T14:45:53",
      "title": "Pragma adjustable bed (Queen split)",
      "upVotes": "36",
      "downVotes": "0"
    },
    {
      "name": "Pragmatic Adjustable Bed Frame Head and Foot, Multiple Sizes",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        },
        {
          "label": "Comfort",
          "rating": "5"
        }
      ],
      "reviewer": "polishsausag",
      "reviewText": "So I stumbled upon this bed when upgrading to a king size, and at the time it had no reviews so I took a gamble. This bed is solid, sturdy, reasonably heavy metal and fits inside the boarder of our king sized bed perfectly, even with the side rails. The adjustability is great (head and foot), and its nice to put your feet up or sit up to watch tv or whatever. Assembly instructions werent the best, but anyone with reasonable mechanical ability should be able to do it. It involves unfolding, hand screwing some support brackets and the mattress support using supplied wing nuts. They give you a sleeve for the lower mattress support in black which is not pictured above, it just looks like a bar at the foot of the mattress in the picture. The sleve looks nice. The rest of the assembly is unfolding the pistons and removing then re-inserting supplied pins and cotter pins. A pair of pliers makes this easier. Two (or 1 per bed, king comes with 2 of these frames) of the piston shafts were a little difficult to get the pins through by hand, so we had to use a little motivator (hammer / Pliers) to push it through the hole and wiggle it around a little to widen the hole. The Otherwise very easy and no tools really required. These are solid and heavy frames, and should hold up to anyone of any size. One thing of note: the motors do have a warning on them that they should only be used for 2 minutes solid, then be allowed to rest for 10 min. This should be fine for all normal applications, but dont let the kids go nuts playing with the motors / adjustments, or they may burn out / get hot.\n\nConsidering every other automatic frame I've seen is $800 to $1600, these are a tremendous value.\n\nOther things of note: The 14 inches of clearance and no box spring make the mattress sit where you would normally expect. The motors and lift mechanisms probably consume 4 inches of storage or so. We went with a 10\" memory foam USA made split king mattress which is pleanty comfortable. I will be cutting 4x4 blocks to raise bedframe and this product up a bit (each boxed bed has 6 feet so 12 total, plus the 4 of my bed frame#, but one might consider a thicker mattress as well. #Only memory foam or air (think sleep number# will work with adjustables, spring matresses wont#. A bed skirt will have to be cut and velcroed around the boarder of the frame due to the movement of the bed itself. Motors are reasonably quiet #wont wake someone up# but not silent. According to a call with the manufacturer, the king and anything else that comes with 2 boxes, works in a split system, meaning there are two mattresses with independednt adjustment #for king = 2 twin xl mattresses). Finding sheets can be a challenge and there is no way to have them both sync so you can just use 1 big mattress #though the directions seem to depict such an option and I didnt look that close so it may be possible). But I find split is much much nicer. The king kit comes with 2 spacers and boltswhich join the 2 frames side by side. The other brackets shaped kind of like an M are meant for either the manual model which can be tied together so you just use one mattress that all moves together.\nFinal thoughts, Love it.",
      "submissionTime": "2014-03-03T07:45:53",
      "title": "Best value out there",
      "upVotes": "46",
      "downVotes": "5"
    },
    {
      "name": "Pragmatic Adjustable Bed Frame Head and Foot, Multiple Sizes",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        },
        {
          "label": "Comfort",
          "rating": "5"
        }
      ],
      "reviewer": "Jimled",
      "reviewText": "Nice bed very quiet when adjusting head and foot levels. Fairly easy to assemble. I would recommend to a friend. Great for my lower back.y",
      "submissionTime": "2014-02-11T07:30:23",
      "title": "Very good bed frame",
      "upVotes": "23",
      "downVotes": "1"
    },
    {
      "name": "Pragmatic Adjustable Bed Frame Head and Foot, Multiple Sizes",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "5"
        },
        {
          "label": "Comfort",
          "rating": "5"
        }
      ],
      "reviewer": "FieryJudge",
      "reviewText": "This is for the full size. I had an adjustable bed before at a little more than twice the price. This time I decided to give this one a try. I will list the pros and cons here.\nPros: Strong and seems durable. Motors are extremely quiet. Relatively easy to assemble. Note: When assembling the foot motor you must raise the foot part of the bed up. It will remain in that position until you hook up the remote and lower it. This is so you can attach the pins easily to the piston. This also leads me to the cons\nCon: The wired remote has no battery backup so if the power goes out there is no way to adjust the bed. This is the only problem I can see.\nAlso this company's service department is fantastic. I was short one wing nut to secure the mattress retainer. I called and after giving my name to a machine I was almost immediately connected to a representative. He not only offered to send me the wingnut ( he actually sent several along with some regular nuts#, he also advised me of the correct headboard brackets to purchase. I received the items in a couple of days. I also ordered the correct brackets # Pragma Bed 2-Pack Headboard/Footboard Bed Brackets# which I installed and then attached a Mainstays Full/Queen Metal Headboard, Black # also purchased from Wal-Mart and a great headboard as well#. I can not recommend this company enough. If you want a good adjustable bed at less than half the price of competitors and don't mind a wired remote # which has a very long cord and clips right on to the frame) get this bed!",
      "submissionTime": "2014-07-22T22:12:47",
      "title": "Definately worth the inexpensive price",
      "upVotes": "10",
      "downVotes": "0"
    },
    {
      "name": "Pragmatic Adjustable Bed Frame Head and Foot, Multiple Sizes",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "4"
        },
        {
          "label": "Comfort",
          "rating": "4"
        }
      ],
      "reviewer": "Trio541",
      "reviewText": "My 13 year old daughter assembled this bed with very little help from me. The frame is sturdy yet light. The motors are not very powerful but they get the job done. Overall I would recommend this product.",
      "submissionTime": "2014-04-25T00:48:14",
      "title": "Great product for the price.",
      "upVotes": "8",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.79",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "3"
      },
      {
        "count": "10",
        "ratingValue": "4"
      },
      {
        "count": "45",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "56"
  },
  "availableOnline": true
}
