{
  "itemId": 38237213,
  "name": "Pulse Performance Products PX-13 Electric Scooter",
  "salePrice": 134.1,
  "upc": "085955096261",
  "categoryPath": "Toys/Kids' Bikes & Riding Toys/Scooters",
  "brandName": "Pulse Performance Products",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FPulse-Performance-Products-PX-13-Electric-Scooter%252F38237213%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FPulse-Performance-Products-PX-13-Electric-Scooter%2F38237213%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4171_133073_132589",
  "reviews": [
    {
      "name": "Pulse Performance Products PX-13 Electric Scooter",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        },
        {
          "label": "Durability",
          "rating": "4"
        }
      ],
      "reviewer": "leedad06",
      "reviewText": "This scooter is a lot of fun to ride, but it is only for a flat areas and has a weight limit of 150 pounds. My youngest son who is 15 years old and over the weight limit rode it and was having fun on it, but the battery ran down pretty quick. The battery is one thing that worries me, because it says to let it charge for 14 hours before use, but it also says that the charger will turn from red to green when it is charged and not to let it over charge. It turns green after about four hours, so I don't know if it is charged or over charging. It would be nice to have it automatically stop charging as it is hard to not forget to check it and unplug it when it is done. The only other thing I worry about is that the brake is on the front wheel and if he were to slam on the brake would he fall forward like a bike when you only use the front brake and go over the handlebars. Of course as long as he stays on flat land and not go down hill it should be fine, because it doesn't go that fast. It looks to be well made and nothing looks or feels cheap on it. It has a good size deck to stand on and I'm sure my grandson will love it. Looks like I used more words on the two negative things, when I'm actually very impressed by the quality look and feel of it. I've looked at other ones and I think this is the best looking one, fit and finish.",
      "submissionTime": "2014-10-03T06:25:46",
      "title": "Fun Scooter",
      "upVotes": "10",
      "downVotes": "0"
    },
    {
      "name": "Pulse Performance Products PX-13 Electric Scooter",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        }
      ],
      "reviewer": "kdkboy",
      "reviewText": "The PX-13 is a well built, powerful scooter. I loved the color as it could be used for a boy or girl. I was stunned that it could pull my 75 pound grandson 13 MPH that was claimed, and at times I clocked it at 15 MPH. It is solid and heavy, not cheap built. It came pretty much put together, which is good because I don't have much patience with many pieces! You just have to put the front handle assembly on. Now, that was the only hard part as you had to get handlebar centered and all four bolts on tight. It took me an extra few minutes, but it was worth it. We charged it overnight and then rode it about 50 minutes until it need a recharge. It has air up tires that make the ride smooth, and the brakes worked well. I am very satisfied with this product and would recommend it to anybody!",
      "submissionTime": "2014-09-28T10:09:25",
      "title": "Well Built!!!! Grandson Loved it",
      "upVotes": "9",
      "downVotes": "0"
    },
    {
      "name": "Pulse Performance Products PX-13 Electric Scooter",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        }
      ],
      "reviewer": "reviewMD",
      "reviewText": "Product Reviewed: Pulse Performance PX13 Scooter\n\nShipping time: on time\n\nPackaging: Cardboard box and plastic wrapping. CAUTION: Box is very heavy! Have at least 2 people to move it.\n\nItems included: Scooter, AC charger, wrench\n\nAdditional Item(s) needed to operate: none, though the rider should wear helmet\n\nInstruction Manual: yes\n\nAssembly: This involves assembling the handle bar and fork together. Total about 8 screws to tighten with the provided wrench. My son, who is almost 12 years old, did the entire assembly by himself. It took about 15 minutes. Instructions were easy to understand.\n\nUsage/Performance: The unit does require charging before it can be used. The manual suggest a 14 hour charge on the first charge. Subsequent charges will take about 10 hours. The battery holds approximately 40 min run time. My son LOVED this scooter! He does know how to ride a bike but never used a scooter before. He immediately got the hang of it and was able to balance on the scooter. The scooter comes with a throttle control on the right side of the handlebar. It is a variable throttle controller so you can adjust the speed you want. It also has a front disc brake system that’s operated by the lever on the left side of handlebar. It is very responsive. There is also a sturdy kick stand that is a nice touch. We ran this scooter in an empty parking lot. We were out there for about an hour. In between the laps, my son did stop several times. We had a least 40 minutes of run time and even a few more minutes beyond that. By the way, the scooter can handle up to 150 lbs.\n\nSummary:\n\nPositives: Sturdy built, long run time, easy assembly. Kickstand is a plus.\n\nNegatives: Not a true “con”, but be aware it is heavy. But then again, it’s probably due to the large battery capacity.\n\nOverall this scooter seems very sturdy and well built. Its easy assembly and kickstand made it that much better. But the best part is that it is fun!",
      "submissionTime": "2014-10-04T07:07:49",
      "title": "Super fun scooter!",
      "upVotes": "4",
      "downVotes": "0"
    },
    {
      "name": "Pulse Performance Products PX-13 Electric Scooter",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "reviewer": "Kajahagafadas",
      "reviewText": "My granddaughter loved the scooter at first, but it doesn't stay charged. I bought 3 different ones and this was by far the most expense, like double. But the other two last 3 times as long as hers. She is very disappointed and so are we.",
      "submissionTime": "2014-12-25T20:15:46",
      "title": "Battery doesn't stay charged",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Pulse Performance Products PX-13 Electric Scooter",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "reviewer": "EFBrown",
      "reviewText": "there was no manual in the box, there was no charger, now tool kit to put it together.Did not make for a good Christmas gift at all",
      "submissionTime": "2015-01-05T15:25:30",
      "title": "dissatisfied",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "3.2",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "1"
      },
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "2",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "5"
  },
  "availableOnline": true
}
