{
  "itemId": 15140194,
  "name": "Schumacher XC6 6/4/2-Amp Battery Charger",
  "salePrice": 29.98,
  "upc": "026666709712",
  "categoryPath": "Auto & Tires/Auto Body Tools & Auto Equipment/Car Battery Chargers & Accessories",
  "brandName": "Schumacher",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSchumacher-XC6-6-4-2-Amp-Battery-Charger%252F15140194%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSchumacher-XC6-6-4-2-Amp-Battery-Charger%2F15140194%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "91083_1074767_1043587",
  "reviews": [
    {
      "name": "Schumacher XC6 6/4/2-Amp Battery Charger",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "VespaRider",
      "reviewText": "Inexpensive little charger/maintainer worked for me. Performed as described. I connected to my Vespa battery that would not turn over the starter. This unit automatically sensed proper voltage and set charge rate for lowest 2A rate. Charged overnight, and by morning charge light and cooling fan were off and was showing monitor mode. Scooter fired right up. So far it has performed exactly as I expected. I intend to keep it connected to the Vespa during periods of non-use.",
      "submissionTime": "2011-01-24T12:44:28",
      "title": "Did what it promised",
      "upVotes": "62",
      "downVotes": "4"
    },
    {
      "name": "Schumacher XC6 6/4/2-Amp Battery Charger",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "MattinRockford",
      "reviewText": "A great price on a very good, light-use charger. I've used it to quick charge my dying car battery, so I could drive it to Wal*Mart to get a replacement, trickle charge my lawnmower battery, and slow-charge a car battery.\n\nDefinitely recommended for the price. Just don't throw the box away - when you go to register the charger online, they ask for the UPC code for some odd reason....",
      "submissionTime": "2011-08-29T17:14:33",
      "title": "Great multi-use charger.",
      "upVotes": "34",
      "downVotes": "1"
    },
    {
      "name": "Schumacher XC6 6/4/2-Amp Battery Charger",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "MysteryDetectives",
      "reviewText": "My 2011 gas Yamaha golf cart had a dead battery. I had left the key on and didn't use the cart for a couple of weeks. I didn't realize it would drain the battery since only the brake lights stay on and then go out after a minute. Anyway, I picked up this charger for just under $30 and read the instructions. It said you can leave the battery in the cart but disconnect the terminals. Also if the ground wire is connected to the cart, connect the ground wire from the charger to the frame and not the battery. I had plugged in the unit and let it run for about 12 hours. Nothing happened, the red light meaning it had good contact with a good battery was lit as well as the amber light for my selection of 6 amps. I called the Schmacher customer service line and after about ten minutes a female came on the phone. First she said to connect the ground directly to the battery. Then unplug the unit and hold down the amp button, the only button on the face of the unit, and plug in the unit into the wall outlet at the same time you're holding down the button. All six lights came on and began flashing and also the fan came on, the fan had not come on before. She said leave it like that for ten minutes then unplug the unit for one minute. Then repeat plugging the unit into the electrical outlet while holding down the amp button. I did that, and this time the lights were steady in all the right places, I selected 6 amps and the fan also came on again. An hour later the green light came on, meaning it was charged. I disconnected the charging unit and reconnected the cart terminals to the battery. The cart worked fine and everything was in good order.",
      "submissionTime": "2013-02-28T13:19:25",
      "title": "28 February 2013",
      "upVotes": "27",
      "downVotes": "9"
    },
    {
      "name": "Schumacher XC6 6/4/2-Amp Battery Charger",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "jfarrar",
      "reviewText": "Despite what others here may have posted, this charger works GREAT! I used on a completely dead larger batter in my Mini Van. In less than 2 hours it was fully charged and putting out 14.9\n\nThere are SPECIFIC instructions for connecting this charger to different types of applications (such as lawn mowers, motorcycles, scooters etc and I suspect those that found this charger to not work on their applications were not connecting it as instructed to do so in the manual.",
      "submissionTime": "2013-05-05T09:29:49",
      "title": "Great Charger - Others Probably Did Not Read Inst.",
      "upVotes": "16",
      "downVotes": "2"
    },
    {
      "name": "Schumacher XC6 6/4/2-Amp Battery Charger",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "farfromstock",
      "reviewText": "dont listen to these guys it worked great on my sulfated optima yellow top battery. as you know not a cheap one at that. if they where to cheap to buy higher end schumacker there fault. but im on a budget and it works good.... i would buy a xc10 or xcs model if i had more money but still works for me... better than the h.f. one i bought that overheated and stopped working in the same day",
      "submissionTime": "2011-07-17T17:05:37",
      "title": "xc6 charger",
      "upVotes": "15",
      "downVotes": "3"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "3.8",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "9",
        "ratingValue": "1"
      },
      {
        "count": "4",
        "ratingValue": "2"
      },
      {
        "count": "2",
        "ratingValue": "3"
      },
      {
        "count": "8",
        "ratingValue": "4"
      },
      {
        "count": "27",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "50"
  },
  "availableOnline": true
}
