{
  "itemId": 23597956,
  "name": "Scotts Turf Builder Tall Fescue Mix",
  "salePrice": 18.94,
  "upc": "032247183468",
  "categoryPath": "Patio & Garden/Other Patio & Garden",
  "brandName": "Scotts",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FScotts-Turf-Builder-Tall-Fescue-Mix%252F23597956%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FScotts-Turf-Builder-Tall-Fescue-Mix%2F23597956%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "5428",
  "reviews": [
    {
      "name": "Scotts Turf Builder Grass Seed Tall Fescue Mix, 7 lbs.",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "5"
        },
        {
          "label": "Value",
          "rating": "5"
        }
      ],
      "reviewer": "jpcrichie",
      "reviewText": "I had a few bare spots in my front lawn and used this product and within 3-4 days with a little rain my spots were filling in. I reccomend this product for the area I live in Maryland.",
      "submissionTime": "2012-05-18T07:55:30",
      "title": "very quick results",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Scotts Turf Builder Grass Seed Tall Fescue Mix, 7 lbs.",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "jbaldesweiler",
      "reviewText": "I purchased this grass seed approx. one month ago and the results are great. The grass is growing strong and is quite lush and thick. Thank you!",
      "submissionTime": "2012-05-18T08:10:33",
      "title": "Great product!",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Scotts Turf Builder Grass Seed Tall Fescue Mix, 7 lbs.",
      "overallRating": {
        "label": "Overall",
        "rating": "2"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "1"
        },
        {
          "label": "Value",
          "rating": "3"
        }
      ],
      "reviewer": "BarBQLvr",
      "reviewText": "I have rated the Turf Builder® Tall Fescue Mix 2-star because of the inconsistency of the product and the resulting problems it causes the consumer. Last year I reviewed this grass seed giving it a 5-star rating with the view that it was the best grass seed that I had used. What happened this year? I began re-seeding several patches where unwanted Bermuda grass had invaded. I still had a small amount of the grass seed from last year. I then began planting using up this bag and then continuing with a bag purchased this year. The area where last year’s seed was used had grass seed germinating within a week whereas the area with the new seed showed only a few blades of grass after 17 days. I noticed that the bag that I had purchased this year had an out-of-date sell-by date so I returned it for a fresh bag thinking that was the problem. In calling Scott’s help line, the assistant did not think that it would cause the kind of problem that I was having. I replanted all the areas that I had planted with grass seed from this year. After about 2½ weeks, I had only marginally improved germination - and nowhere near what would be needed to be acceptable. By this time, I was becoming frustrated and annoyed because the optimum time for seeding fescue grass was rapidly disappearing. I noticed with the bag from last year that the seed covering was smooth. The seed covering for the two bags that I purchased this year was rough. I decided to try one more time because of my great success last year. Upon opening the third bag for this year, I noticed that the seed covering was smooth, so I was hopeful. Just to be sure that I was not doing something wrong, I replanted one area with seed from bag 2 and another area from bag 3. After one week, the seed from bag three germinated as thickly as one would expect. The area from bag 2 shows no sign of germination. Since there was a correlation between the outer surface of the seed and its ability to germinate, I hypothesize that the manufacturing process is not consistent, and that the rough water-smart coating covering the seeds prevented them from germinating. Since the non-germinating seed resulted in a considerable duplication of my time and a waste of water, I can no longer recommend this product. If you are lucky, and think that you will pick a good bag, then it should be fine. Just be aware, if you do not, you will likely become frustrated.",
      "submissionTime": "2012-10-08T13:12:16",
      "title": "Inconsistent Quality",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Scotts Turf Builder Grass Seed Tall Fescue Mix, 7 lbs.",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "5"
        },
        {
          "label": "Value",
          "rating": "5"
        }
      ],
      "reviewText": "I've been using the Tall Fescue Mix to repair bare spots and to overseed my 20 year old blue grass lawn since the spring of 2010. The mix germinates rapidly and once established provides a green lawn even during the hot central Ohio summers without additional watering. Although the tall fescue grass blades are courser in appearance than the blue grass, the fescue seems to blend in well.",
      "submissionTime": "2012-05-28T11:52:28",
      "title": "Grows well in hot, dry cental Ohio summer",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Scotts Turf Builder Grass Seed Tall Fescue Mix, 7 lbs.",
      "overallRating": {
        "label": "Overall",
        "rating": "2"
      },
      "productAttributes": [
        {
          "label": "Quality",
          "rating": "1"
        },
        {
          "label": "Value",
          "rating": "1"
        }
      ],
      "reviewer": "Medmo",
      "reviewText": "I watered this product very diligently and still only saw about 5% sprout after Day 14. We also received good rain and one snow during those two weeks, so the seeds were adequately moist. I do have a sun and shade mix where I planted, but even in sunny areas I did not have good results.",
      "submissionTime": "2014-04-06T06:13:11",
      "title": "5% Germination after 14 Days",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.17",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "1"
      },
      {
        "count": "2",
        "ratingValue": "2"
      },
      {
        "count": "9",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "12"
  },
  "availableOnline": false
}
