{
  "itemId": 26819545,
  "name": "Seagate Technology RY4481B Seagate Barracuda 500 GB HDD SATA 6 Gb/s NCQ 16MB Cache 3.5-Inch Internal Bare Drive ST500DM002",
  "salePrice": 44.55,
  "upc": "763649032046",
  "categoryPath": "Electronics/Computers/Computer Components/Hard Drives",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSeagate-Bulk-ST500DM002-500GB-Barracuda-SATA-HD%252F26819545%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSeagate-Bulk-ST500DM002-500GB-Barracuda-SATA-HD%2F26819545%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_3951_1073804",
  "reviews": [
    {
      "name": "Seagate Barracuda 500GB HDD SATA 6Gbps 3.5\" Internal Hard Drive",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Nitewisher123",
      "reviewText": "I have had Seagate drives in the past and if this one proves to be as dependable as they was,. i will have many years of trouble free service from it. The reason i only gave it four stars is because its listed on the website as a retail package, which includes the installation disk and cables. It arrived ahead of schedule well packaged, but in OEM packaging only. This means that you get the hard drive only. I had to download the installation software from the web and supply my own cables. They should state on the description that this is OEM packaging, and not a retail box. For experienced computer users who are use to working with various components its not a problem, but someone who never changed out a hard drive before, it could be a problem for them. I would not hesitate to buy another one from Wal-Mart.com, the prices was good, and with free shipping, cant be beat. Was shipped out fast.",
      "submissionTime": "2014-03-03T22:30:20",
      "title": "Dependable hard drive, but its OEM packagaing",
      "upVotes": "3",
      "downVotes": "0"
    },
    {
      "name": "Seagate Barracuda 500GB HDD SATA 6Gbps 3.5\" Internal Hard Drive",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "RMH2",
      "reviewText": "Our tech had no problem installing the product. We searched several different web sites of stores that carry this hard drive and Walmart did not let us down. They had it in stock, ready to ship and at the best price!",
      "submissionTime": "2014-04-23T08:33:45",
      "title": "Easy to install & great price.",
      "upVotes": "1",
      "downVotes": "0"
    },
    {
      "name": "Seagate Barracuda 500GB HDD SATA 6Gbps 3.5\" Internal Hard Drive",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "urbanweasel",
      "reviewText": "exactly as described, i needed a hd for my dvr and it went right in works great",
      "submissionTime": "2014-08-20T05:32:47",
      "title": "works great in dvr",
      "upVotes": "1",
      "downVotes": "0"
    },
    {
      "name": "Seagate Barracuda 500GB HDD SATA 6Gbps 3.5\" Internal Hard Drive",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "CriticGuru",
      "reviewText": "I was shopping for a replacement hard drive for my HP Pavilion S5000 desktop. The original PC came with a western Digital 640 GB/3GBPS internal hard drive. The hard disk crashed and prompted me to replace the hard drive. I shopped online for few days to find the exact match. I was able to find it but it costed fortune, even the grey market ones. Fortunately I came across this hard drive through google search that too for an excellent price even compared to the grey market products. Even though the capacity is slightly smaller but the performance factors were far superior than the one I had. So I decided to buy this at Walmart. Even though the order said that the delivery time is 10 days, I got the shipment exactly in 4 business days (Excellent!!!) with very good packing. I followed the instructions available on HP website to replace the hardrive. The hard drive did not come with any cables (you can use the ones already there in the computer). This hard drive was a perfect fit into bay and I was able to replace within 15 mins. I would strongly recommend this hard drive if it matches your current hard drive specification except for the capacity. Thank you WalMart!",
      "submissionTime": "2014-05-28T21:00:03",
      "title": "Value for Money",
      "upVotes": "1",
      "downVotes": "0"
    },
    {
      "name": "Seagate Barracuda 500GB HDD SATA 6Gbps 3.5\" Internal Hard Drive",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "JNSofTheHighDesertCA",
      "reviewText": "Installed without problems. My computer responds much faster than with the prior hard drive. Would recommend to anyone as the product appears to improve the performance.\n\nThis hard drive is an excellent product for the price I paid. It had been marked down, ie price roll back, and helped with my budget to get my computer up and running due to old hard drive crashing. The speed of this hard drive appears to be much faster than the old hard drive it replaces, loads take 1 second or less while the older SATA hard drive seemed to hesitate to about 2 secs to load.\n\nThis hard drive meets my needs. I do not need a hard drive in the TB size at this time, so I got good value for the money spent.",
      "submissionTime": "2014-11-13T00:45:28",
      "title": "Value for the money",
      "upVotes": "1",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.82",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "4"
      },
      {
        "count": "9",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "11"
  },
  "availableOnline": true
}
