{
  "itemId": 24076854,
  "name": "Seville Classics Expandable Steel Wire Closet Organizer, SHE05813BZ",
  "salePrice": 119,
  "upc": "017641988130",
  "categoryPath": "Home/Storage & Organization/Closet Storage & Organizers",
  "brandName": "Seville Classics",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSeville-Classics-Expandable-Steel-Wire-Closet-Organizer%252F24076854%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSeville-Classics-Expandable-Steel-Wire-Closet-Organizer%2F24076854%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90828_132948",
  "reviews": [
    {
      "name": "Seville Classics Expandable Steel Wire Closet Organizer, SHE05813BZ",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "BILLIONAIRE",
      "reviewText": "I've tried every closet out there, which all of them happen to be plastic and broke after two weeks. I saw this metal closet from Walmart and knew it was perfect. It was easy to assemble and and so STURDY. I was shocked when I found out that it can be expanded. I actually couldn't use the full length of the rack because I didnt have anymore room to expand it further. The closet is PERFECT. Everyone that comes over loves it. Nice chrome color and real metal. Nice compartments on each side to put folded clothes and shoes. And I still have extra room to put more clothes. I would highly recommended this if your looking for a perfect closet. It doesnt get any better than this and its under priced if you ask me. I would have paid way more for this closet.\n\nThe only small con is that if you put pants or shirts on the bottom rack they will be on the floor. Not a big issue but just wish the bottom rack was a little higher as I dont like my clothes touching the floor. But hey my carpet is clean so no biggie. I also did site to store, where they shipped to a Walmart near me and I went to pick it up to save on shipping but this thing is HEAVY in the box. So shipping would probably be expensive. Its at least 90lbs in the box.\n\n****I've included a pic of my closet.*****",
      "submissionTime": "2011-02-01T14:17:06",
      "title": "BEST CLOSET EVER!!",
      "upVotes": "287",
      "downVotes": "17"
    },
    {
      "name": "Seville Classics Expandable Steel Wire Closet Organizer, SHE05813BZ",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "4"
        }
      ],
      "reviewer": "fantasticShopper23",
      "reviewText": "Reluctantly, I purchased this expandable closet organizer. I have purchased 2 others previously, not at walmart.com and have been disappoinedx2. This product is PERFECT. My home has unusually sized closets and the Expandable Closet organizer works perfectly. The metal shelves are nice to organize bedding, the top rack is perfect for purses and hats and the bar that holds clothes seems to hold all of my clothes and I have a lot!!! My closet walls are made of a cheap drywall that crumbles so it is the perfect closet organizer for that reason alone.\nPLEASE note that target.com has the itentical item but walmart.com's is $60.00cheaper and with .94cent shipping.\nI am so pleased with this product!!!\n1. great for unusual sized closets\n2. great little shelves\n3. VERY sturdy\n4. good for closets made with cheap drywall\n5. cheaper than target",
      "submissionTime": "2010-05-17T02:01:19",
      "title": "VERY sturdy a Perfect Product",
      "upVotes": "194",
      "downVotes": "13"
    },
    {
      "name": "Seville Classics Expandable Steel Wire Closet Organizer, SHE05813BZ",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "Raine64",
      "reviewText": "This item exceeded my expectations. I turned a small bedroom into my dressing room. I did not want to affix anything permanately to the walls. I ordered two of the closet organizers and could not be more pleased with the results. They do attach to the walls with two straps and screws inorder to prevent the unit from tipping over. It is no more damaging to a wall than hanging a heavy painting. I have the dressing room I have always wanted at a fraction of the cost. I assembled the unit by myself and am not a very handy person. If I can assemble it anyone can.",
      "submissionTime": "2010-10-27T18:33:56",
      "title": "Very pleased!",
      "upVotes": "135",
      "downVotes": "28"
    },
    {
      "name": "Seville Classics Expandable Steel Wire Closet Organizer, SHE05813BZ",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Features",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "MiaShop13",
      "reviewText": "I was skeptical when purchasing this unit so I only purchased 1 knowing I would need another one but just in case, I only ordered one. I am very glad I purchased it. It is a great value. I used it in a spare bedroom which I have turned into a laundry, closet and guest room. I only wish I would've purchased both of them at the same time because now they are out of stock. This unit can hold a lot of clothes and does not look cheap. It matches with the other solid wire shelving I have in the room. I definately recommend this product!",
      "submissionTime": "2010-10-21T12:54:53",
      "title": "Great Buy",
      "upVotes": "51",
      "downVotes": "0"
    },
    {
      "name": "Seville Classics Expandable Steel Wire Closet Organizer, SHE05813BZ",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "ebonyheart",
      "reviewText": "This item was more value-inclusive than I imagined. I was expecting a prissy, thin gauge tub ular steel frame. But, let me tell you something: this is heavy duty. It's not heavy in weight but it's like an ant...it holds 10x its weight. Also, I was expecting this to be a rigidly designed frame, but it is flexible in its configuration. By that, I mean, you can set it up to extend up to 7 ft. Wide. This option allows for unique setup. I am a big guy and my clothes are long. I expected my clothes to hang on the floor, but no, they don't. The side shelving was used to hold sweaters and t-shirts and other odd items that don't need or resist hangers. I use this in combination with the closet space which I couldn't get authorization to modify. I wanted to build a closet system, which would've looked exactly the way this was designed, except that it would've been wooden and I wouldn't have been able to take it with me when I moved. Oh, and the setup isn't one of those that requires tools to build and break down. It uses gravity to lock in place. There are just 4 screws to use on the hanger poles (Phillips head). It might take 10 minutes to complete once you get the flow of things. The instructions could've been a bit more clear, but keep an eye on the picture on the box to keep your direction. Be sure to do the poles then clip the plastic stoppers before laying the shelves and it almost puts itself together. You will be happy with it. Check out my pictures for ideas of my configuration.",
      "submissionTime": "2012-10-17T11:13:56",
      "title": "Provides space for items I hadn't thought about",
      "upVotes": "49",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.76",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "7",
        "ratingValue": "1"
      },
      {
        "count": "5",
        "ratingValue": "2"
      },
      {
        "count": "9",
        "ratingValue": "3"
      },
      {
        "count": "74",
        "ratingValue": "4"
      },
      {
        "count": "459",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "554"
  },
  "availableOnline": true
}
