{
  "itemId": 38598812,
  "name": "Shark Rotator Powered Lift-Away Bagless Vacuum, NV650",
  "salePrice": 298,
  "upc": "622356537438",
  "categoryPath": "Home/Appliances/Vacuums & Floor Care/Bagless Uprights",
  "brandName": "Shark",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FShark-Rotator-Powered-Lift-Away-Bagless-Vacuum-NV650%252F38598812%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FShark-Rotator-Powered-Lift-Away-Bagless-Vacuum-NV650%2F38598812%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_4047",
  "reviews": [
    {
      "name": "Shark Rotator Powered Lift-Away Bagless Vacuum, NV650",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Tomfromfreeport",
      "reviewText": "This machine has all the possible features imaginable for an upright. The control is right on the handle with brush and turbo power control. The brush also acts as the self-propel wheel that it practically drags itself forward. The lift-away is the first ever seen on an upright and almost make the canister part unnecessary. I said almost because it is kind of heavy so some may need to use the caddy from time to time. The twist and turn feature works really well. Dustbin is easy to clean as well. All the connectors are well designed and easy to take apart and put together. The suction is really strong. In turbo mode, it is impossible to push without the brush on. The construction seems of very high quality and the fits and finishes are very good. The only complaints I have are the weight and the lack of cord rewind (maybe I am asking too much?)\n\nOverall this is a truly amazing machine with a reasonable price. Anyone serious about vacuuming should take a look.",
      "submissionTime": "2014-10-25T11:42:47",
      "title": "This vacuum is near perfection",
      "upVotes": "97",
      "downVotes": "10"
    },
    {
      "name": "Shark Rotator Powered Lift-Away Bagless Vacuum, NV650",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "SpottedLeopard",
      "reviewText": "Wow is all I can say. I debated getting another Dyson as my smaller Dyson was just not cleaning the way it used to. I decided to give the Shark a try. Don't spend the $$$$$ for a Dyson. This one is easy to handle and picks up great. Great design, Highly recommend.",
      "submissionTime": "2014-11-01T14:55:22",
      "title": "Absolutely Awesome Machine",
      "upVotes": "30",
      "downVotes": "2"
    },
    {
      "name": "Shark Rotator Powered Lift-Away Bagless Vacuum, NV650",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "KristyfromPA",
      "reviewText": "I bought this after researching and needing a new vacuum. This vacuum is a little heavy I think. The suction is awesome. It comes with the caddy, 11 inch wand, small brush, upholstery wand(which is just a flat head with 2 strips of material on each side like a lint brush), and Hardwood floor genie. This does not come with the small rotating pet brush. At first I was upset with this but then I just lifted the sweeper head up to the couch and realized that this worked probably better but I don't have carpeted stairs. The cord is 30 ft which is great, but wish it automatically winded up. The sweeper comes apart easy and doesn't feel cheaply made. the hose was suppose to be softer and made to stretch easy but I don't think it's that great b/c it recoils fast. I've never had a canister vacuum, but when you put it on the caddy I think it gets in the way bc of the hose recoil. I liked the canister on the vac head better and just took it off when I have to vacuum under things. The lights are amazing. The vac head is super bright and when you just use the wand the other light on the handle is very bright and lights up the surface well in the dark. The hardwood floor genie is great. no loss in suction there. This works better than the sweeper head does on bare floor setting. This sweeper head is like it's self propelled. Not sure if I like this yet b/c it takes off on it's own. I only gave this 4 stars b/c of the price $298.00, but walmart was the cheapest at the time. IF you don't want the hardwood floor genie then you can order off shark site and get a free steam mop and crevice tools free for approx. $250.",
      "submissionTime": "2014-10-28T05:30:18",
      "title": "impressed",
      "upVotes": "37",
      "downVotes": "9"
    },
    {
      "name": "Shark Rotator Powered Lift-Away Bagless Vacuum, NV650",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "njf2013",
      "reviewText": "Excellent!! Better then I thought it would be!! I was speechless when I used it! And ask anyone, it takes a lot to make me speechless!!",
      "submissionTime": "2014-10-23T09:31:36",
      "title": "Excellent sweeper!!",
      "upVotes": "52",
      "downVotes": "33"
    },
    {
      "name": "Shark Rotator Powered Lift-Away Bagless Vacuum, NV650",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewText": "I saw the commercial for this Vacuum on TV and since I haven't found a vacuum that lived up to what they say I was looking into buying this one, when My Son purchased the same Vacuum and they showed how it worked. We purchased it and we have hard floors it does a real good job sucking up our cat dog fur that is sometimes out of reach, but the vacuum draws the dirt in even if you cant get near it. I like to use the hard floor attachment rather than the stand up position.",
      "submissionTime": "2014-12-08T13:07:47",
      "title": "Good Suction and Good Features",
      "upVotes": "19",
      "downVotes": "5"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.74",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "3"
      },
      {
        "count": "7",
        "ratingValue": "4"
      },
      {
        "count": "26",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "34"
  },
  "availableOnline": true
}
