{
  "itemId": 34524947,
  "name": "Sharp 2.2 Cu. Ft. 1200W Carousel Countertop Microwave",
  "salePrice": 170.99,
  "upc": "074000618855",
  "categoryPath": "Home/Appliances/Kitchen Appliances/Microwaves",
  "brandName": "Sharp",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSharp-R659YK-Carousel-2.2-cu-ft-1200W-Countertop-Microwave-Oven-Black%252F34524947%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSharp-R659YK-Carousel-2.2-cu-ft-1200W-Countertop-Microwave-Oven-Black%2F34524947%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_90546",
  "reviews": [
    {
      "name": "Sharp R659YW Carousel 2.2 cu ft 1200W Countertop Microwave Oven",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Bearwood",
      "reviewText": "Shipped via FedEx from Walmart.com, my SHARP R659YW came double-boxed with multiple styrofoam packing blocks that provided for excellent shipping protection. The weight of the unopened shipping box is 52.3 pounds and the oven's net weight is 46.1 pounds. This is a very large 2.2 cubic foot capacity microwave, so make sure you know your space requirements. While this microwave oven is 24.1 inches wide, 13.8 inches high and 19.8 inches deep, \"allow 4 inches of space between oven top, sides, rear and adjacent surfaces\" for proper ventilation---this is according to the SHARP operation manual. This R659YW microwave oven is significantly quieter than I anticipated, and the 1200 watt energy output quickly heats product. Cooking time, power level, indicators and current time are displayed in bright, yellow green, one-half inch tall digits that are quite easy to read. The bright interior light functions while cooking, turns off when cycle is complete and lights when the door is opened. That's correct, the interior oven cavity light shines when the door is open and immediately turns off when the door is shut. Like I said, the interior light is bright and allows one to easily view the entire cooking process. The oven door has a solid, proper alignment fit and is reasonably quiet upon opening or closing. The end of cycle notification is a three-beep alert. Also, any display entry is followed by a one-beep alert. This appears to be a very well-built, quality microwave oven offering from SHARP and I am a pleased customer. Thanks so much for offering this excellent product, Walmart!",
      "submissionTime": "2014-02-21T04:29:57",
      "title": "SHARP R659YW",
      "upVotes": "86",
      "downVotes": "9"
    },
    {
      "name": "Sharp R659YW Carousel 2.2 cu ft 1200W Countertop Microwave Oven",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "3"
        }
      ],
      "reviewer": "giraffelady2",
      "reviewText": "I had previously owned a Sharp microwave which after twelve years gave up and died. I had been very pleased with the old microwave so I decided to purchase another Sharp. This one sounded very nice so I purchased it. When it arrived I found it did not heat as quickly as my old one. I thought perhaps it was defective so I contacted Sharp. They said they had not had any complaints but that they would send me a new one. The new one arrived quite quickly and when I tried it I found it was only slightly better than the first. The customer service department at Sharp were very cooperative and helpful. This new microwave has a sensor cook and reheat button which I do not like. It overcooks all the items that I have tried it on. I just gave up on that and set my timer to what I feel I need to cook the food, and it has been much better. All in all this is a nice microwave but at 1200 watts it seems a little slow.",
      "submissionTime": "2014-04-15T17:25:09",
      "title": "Nice large microwave",
      "upVotes": "37",
      "downVotes": "3"
    },
    {
      "name": "Sharp R659YW Carousel 2.2 cu ft 1200W Countertop Microwave Oven",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "1"
        },
        {
          "label": "Meets Expectations",
          "rating": "1"
        }
      ],
      "reviewer": "YANDOL",
      "reviewText": "I spent an hour researching microwave ovens when our Sharp went out after 25 years. I thought this was the one, based on the reviews and the excellent service our old Sharp gave us. I bought one and when it arrived by FEDEX the glass was in a million pieces so I had to load it up and make a trip to Walmart. I tried to order another one but the website has issues for days. I finally ordered the second identical oven and when it arrived (it's heavy) I got it all unpacked and IT DOESN'T WORK! SHUTS OFF AFTER 3-5 seconds. I called Sharp (on a Saturday) and they said they would call me Monday morning first thing. I'm still waiting for that call. I am returning this and purchasing the PANASONIC from in the store. It has more features and costs $10 less and IT ACTUALLY WORKS! Walmart tried to make this better, but the bottom line is after ordering TWO Sharps and then it doesn't even work (and the Sharp lady sounded like this is a common problem???). BUY THE PANASONIC.",
      "submissionTime": "2014-04-28T11:19:07",
      "title": "BOUGHT TWO RETURNED TWO",
      "upVotes": "40",
      "downVotes": "7"
    },
    {
      "name": "Sharp R659YW Carousel 2.2 cu ft 1200W Countertop Microwave Oven",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "murphydog116",
      "reviewText": "This is the current stainless model of the black Sharp Carousel I previously owned that provided 8 years of great service. So far, the new microwave had worked as good as the one I'm replacing. I do like the stainless finish and worth the extra $20 bucks.\n\nOnly difficulty was getting all the plastic protection off the finish that the factory 'sealed' with. Overall, great value and super-fast (next day) delivery from Wal-Mart!",
      "submissionTime": "2014-03-08T19:49:46",
      "title": "Just what I wanted",
      "upVotes": "29",
      "downVotes": "3"
    },
    {
      "name": "Sharp R659YW Carousel 2.2 cu ft 1200W Countertop Microwave Oven",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "3"
        }
      ],
      "reviewer": "Nodlit",
      "reviewText": "Our 2001 1200W Carousel served us well for many years, but finally gave up the ghost. So we bought what seemed to be its successor. It does what it is supposed to do, but suffers from some hard-to-understand \"improvements.\" First, the very convenient \"minute plus\" button is no longer present. Instead, you can add 30 sec while cooking by pressing the start button - or a minute by pressing it twice. Second, the large door release on the older model, which was easily located and pressed, even in the dark, was replaced by a circular button which is not quite as convenient. Third, the new Carousel is quite a bit noisier than the older one - loud buzz while cooking. Fourth, it is a bit larger and requires more counter space. We like 1200 W, but would prefer a somewhat smaller oven. However, the oven works fine, and the little things that bug me might not bother anyone else, so I would recommend it with some reservations (mainly about the noise), and I will deduct only one star - mainly for the noise and the absence of the \"minute plus\" button.",
      "submissionTime": "2014-08-03T17:24:27",
      "title": "Ok, but a step down from its predecessor.",
      "upVotes": "20",
      "downVotes": "1"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.15",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "12",
        "ratingValue": "1"
      },
      {
        "count": "2",
        "ratingValue": "2"
      },
      {
        "count": "5",
        "ratingValue": "3"
      },
      {
        "count": "17",
        "ratingValue": "4"
      },
      {
        "count": "59",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "95"
  },
  "availableOnline": true
}
