{
  "itemId": 30250443,
  "name": "Shark Deluxe Sonic Duo Hard Floor and Carpet Cleaner",
  "salePrice": 152.23,
  "upc": "622356533614",
  "categoryPath": "Home/Appliances/Vacuums & Floor Care/Bagless Uprights",
  "brandName": "Shark",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FShark-Deluxe-Sonic-Duo-Hard-Floor-and-Carpet-Cleaner%252F30250443%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FShark-Deluxe-Sonic-Duo-Hard-Floor-and-Carpet-Cleaner%2F30250443%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_90548_4047",
  "reviews": [
    {
      "name": "Shark Deluxe Sonic Duo Hard Floor and Carpet Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "eckchela",
      "reviewText": "I was considering either having my light carpet dyed or replacing it due to the traffic area \"trail\" that never went away when cleaned with a rental steam cleaner. The Shark Sonic Duo was light weight and easy to guide...my husband actually wanted to use it! He cleaned the dining room carpet and so far no return of the traffic area \"trail\".\n\nThe Sonic Duo also works well on vinyl flooring. It cleaned in a fraction of the time when using my wet jet. I tested on a 13 inch black scuff mark and only needed 2 passes to eliminate the mark completely. Very impressive!",
      "submissionTime": "2014-01-09T07:03:04",
      "title": "Easy to use",
      "upVotes": "64",
      "downVotes": "3"
    },
    {
      "name": "Shark Deluxe Sonic Duo Hard Floor and Carpet Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "ukfannfl",
      "reviewText": "I have never taken the time to write a review. For this item, I had to. I have over 2000 sq ft of tile and laminate wood in my home. I hate cleaning all of those floors. This is THE BEST appliance that I've found for cleaning. I've had various steam mops and the Hoover Floormate Deluxe. Nothing cleans like this Shark Duo. The 1000 scrubs per minute feature really saves you time on cleaning. I love this Shark and would recommend it for hard floor cleaning. I also have a lot of area rugs, but haven't used this on those. I'm sure that it will do a great job on those too!",
      "submissionTime": "2013-12-26T10:13:54",
      "title": "Great cleaner for tile and wood",
      "upVotes": "65",
      "downVotes": "10"
    },
    {
      "name": "Shark Deluxe Sonic Duo Hard Floor and Carpet Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "LPBC",
      "reviewText": "My hardwood floors are looking wonderful.",
      "submissionTime": "2014-02-17T06:22:00",
      "title": "Light weight & easy to use. So glad I got it.",
      "upVotes": "22",
      "downVotes": "2"
    },
    {
      "name": "Shark Deluxe Sonic Duo Hard Floor and Carpet Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "3"
      },
      "reviewer": "SuperAmmi",
      "reviewText": "works nicely on kitchen and bathroom ceramic tile, laminate flooring. ok on my short pile carpet, can still see stains, maybe will improve with several uses. does not make my carpet look any brighter just notice a bit cleaner than before, but I have only used it once on the carpet.",
      "submissionTime": "2014-01-04T10:50:14",
      "title": "great for hard surfaces",
      "upVotes": "16",
      "downVotes": "0"
    },
    {
      "name": "Shark Deluxe Sonic Duo Hard Floor and Carpet Cleaner",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "HomeImprovementPrincess",
      "reviewText": "After reading mixed reviews I was hesitant to purchase the SonicDuo. I wanted a hard floor cleaner that would suck up the dirty water into a container, or a steam mop to sanitize my floors. Neither was an option as both types put out too much water to be used on a laminate floor. For years I've been cleaning approx 1000 sq ft of laminate/tile flooring with just a damp mop. The Shark was easy to assemble and use right out of the box. It's perfect for laminate flooring as the user controls how much water/cleaning solution is used. It's light weight and easy to maneuver, however it takes more effort to push it if you don't use enough liquid. It took less time to damp mop my floors than it did to do them with the Shark but my floors are WAY cleaner using the SonicDuo. The front scrubber pad was pretty dirty yet the back \"buffing\" pad was relatively clean which means the front pad picks up the dirt and I wasn't just spreading the dirt around. Don't expect the pad to pick up debris though, you have to vacuum the crumbs and pet hair before you start. My floors are sparkling clean with no streaks. The cleaning solution included was okay but ill probably revert to Mrs. Meyer's Clean Day All Purpose after I've used up the supply. I like the little lights on the unit, they help illuminate the dark nooks and crannies. The swivel design made it easy to clean behind and on both sides of the toilet.\nHaven't tried it on carpeting yet so I can't comment.\nI received my order in 2 day so the shipping was fast.",
      "submissionTime": "2014-04-16T18:46:39",
      "title": "had misgivings about purchasing but glad I did",
      "upVotes": "16",
      "downVotes": "2"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.1",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "1"
      },
      {
        "count": "2",
        "ratingValue": "3"
      },
      {
        "count": "6",
        "ratingValue": "4"
      },
      {
        "count": "10",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "20"
  },
  "availableOnline": true
}
