{
  "itemId": 30249562,
  "name": "SOG Vulcan VL-01",
  "salePrice": 102.95,
  "upc": "57NKKOkd2643",
  "categoryPath": "Sports & Outdoors/Outdoor Sports/Hunting/Game Management/Hunting Accessories",
  "brandName": "SOG",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSOG-Vulcan-VL-01%252F30249562%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSOG-Vulcan-VL-01%2F30249562%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4125_546956",
  "reviews": [
    {
      "name": "SOG Vulcan VL-01",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "Leonfrank",
      "reviewText": "It's an amazing knife. Only reason I'm not giving 5 stars is a weak clip. It broke very soon after buying the knife. I swapped over a clip from another sog knife, and it's all good now.",
      "submissionTime": "2014-12-24T22:05:51",
      "title": "Great knife",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "SOG Vulcan VL-01",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "EvilWizard",
      "reviewText": "A while back I was looking for a knife. The first SOG knife I saw was the Vulcan Mini. Nice knife, but it was too small for my hand. I could only fit three fingers on the handle. Then I tried the regular Vulcan. Perfect fit. My entire hand fit nicely around the handle. No slipping or any fingers hanging off the end.\n\nI would recommend this knife to anyone that wants a full size, locking blade knife that easily fits in your pocket. Obviously, if you want spring assist opening, this is not the knife for you, but I thought this was a great alternative to having to use a safety or having it accidentally open in your pocket.\n\nOne thing to keep in mind though. The blade does need frequent sharpening. Even with the super hard steel, it just doesn't hold an edge for long. Even still, I would buy another one of these in a minute.",
      "submissionTime": "2014-11-15T10:49:33",
      "title": "Works great and fits my hand perfectly",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "SOG Vulcan VL-01",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "BK1973",
      "reviewText": "I've owned my Vulcan for a few months now and without a doubt the best folder I've ever owned! On top of being unbelievably sharp, having thumb-studs as well as flipper separates it from other high-end folding knives. It's held it's edge quite nicely and to be honest, just looks better than most blades at it's price-point. I never hit the door without this on my person, in pocket or EDC pack. In a word, outstanding!\n\nBK",
      "submissionTime": "2014-11-11T07:29:23",
      "title": "Vulcan Supremacy",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "SOG Vulcan VL-01",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "DocReits",
      "reviewText": "I've had my Vulcan for about one year now. I told my son that I wanted a SOG knife for my birthday and he picked the Vulcan. I was a little leery as I had the Twitch XL as my daily carry and thought nothing would beat it or even match. Well, the Vulcan is presently in my pocket as my daily carry as I am typing this review.\n\nI like it over other knives because it is single hand opening and closing. It is balanced perfectly. Holding one finger just in back and under the blade lock release you find the center of balance. This is in the perfect spot as you hold the knife fully in your hand. It feels like an extension of your own hand.\n\nThe blade releases from the handle like warm butter. Holding the knife, clip pointing up and lock release towards the ground. Release the blade and it opens fully and locks with gravity...that is how smooth it is. There is absolutely no blade play. Try moving the blade to find a back and forth wiggle. None. Tight as a drum.\n\nThe blade looks mean and durable. It is. I have used it now for a year on different applications from box cutting to wood whittling and it holds its edge very well. I use a wet stone for sharpening and it is always impressive to friends and colleagues who ask to borrow my Vulcan. I warn them not to see how sharp it is by touching the blade because you can almost shave with this knife. Very sharp.\n\nThe clip is the perfect weight and size. I can easily withdraw it off of my pant's pocket and immediately open it single handidly with one smooth fluid motion. Other knives are too attached to remove without effort...not the Vulcan.\n\nI love this knife. I am a big SOG fan . I own Benchmade, Gerber, and others, but I tell my friends, \"Buy a SOG Vulcan\".",
      "submissionTime": "2014-11-11T12:44:45",
      "title": "Rad Vulcan",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "SOG Vulcan VL-01",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Dbzlegends",
      "reviewText": "I bought this knife and had exceeded my expectations. this knife opens fast left or right handed you can pull back the arc lock and flick it open and closed or just open with the thumb studs and flipper. the steel is nice too its a little harder than 440c super steel. the other nice thing is the metal frame under the plastic handle. the knife locks straight and tight.I carry a gerber parrbellum most of the time on my side everyday. this knife is comparable in versatility obviously not size but otherwise an awesome everyday carry.\n\nSog Makes a good overall product. I cant say I like all of the tools made by sog but all multi tools and knifes have their purpose and specific needs. this knife fits my needs but maby not all others. for instance the flash II is not good for things like widdling because of the plastic frame but the twitch or any other knife with a metal frame would be good because of the hard twisting motion that can cause the plastic to flex and make the lock fail. all full plastic handle knifes are good for cutting and slicing and defending yourself because they are light and more affordable. the point is don't use a knife out of the tools \"comfort zone\"",
      "submissionTime": "2014-09-10T10:16:28",
      "title": "Nice knife",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.89",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "4"
      },
      {
        "count": "8",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "9"
  },
  "availableOnline": true
}
