{
  "itemId": 39612198,
  "name": "Sony Cyber-Shot DSC-RX100 II Wi-Fi Digital Camera (Black) with 64GB Card + Battery & Charger + Case + Tripod + Accessory Kit",
  "salePrice": 599.95,
  "upc": "689466730210",
  "categoryPath": "Electronics/Cameras & Camcorders/Point & Shoot Cameras",
  "brandName": "Sony",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSony-Cyber-Shot-DSC-RX100-II-Wi-Fi-Digital-Camera-Black-with-64GB-Card-Battery-Charger-Case-Tripod-Accessory-Kit%252F39612198%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSony-Cyber-Shot-DSC-RX100-II-Wi-Fi-Digital-Camera-Black-with-64GB-Card-Battery-Charger-Case-Tripod-Accessory-Kit%2F39612198%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_133277_1166834",
  "reviews": [
    {
      "name": "Sony Cyber-Shot DSC-RX100 II Wi-Fi Digital Camera (Black) with 64GB Card + Battery & Charger + Case + Tripod + Accessory Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "MBBLA",
      "reviewText": "The RX100 II is a great little camera: pocketable: Zeiss lens, exceptional build quality, nice features, quality pictures for the most part. I also have a NEX7 with the 24mm Zeiss lens and expected similar result from the RX100 II in the scene mode for sunsets as an example. That's not going to happen unless you use a tripod. In that mode, the shutter speed and ISO make hand holding the RX100 nearly impossible. Always blurry pictures vs. the NEX 7 shooting in the same mode. I find that many times unless i really dial up the ISO I am getting shutter speeds at 1/30th which prevents super sharp pictures even with the steady shot feature turned on. It would be nice if the tele zoom went to 140- 150 MM and didn't go to f4.9 in the tele mode.\n\nSharing pictures and sending to a smartphone even with the memories app on an iPhone is not as easy as it sounds and it needs wi-fi vs. bluetooth.\n\nAccessories:\nThe camera needs a grip for man sized hands. Yet it is an accessory for $15. More important, The camera needs an accessory viewfinder for outdoor shots. The articulating screen is good and even set for daylight there is too much reflection to really compose the shot. The ACCESSORY VIEWFIDER is $449 or discounted by some stores at $349- still a great deal of money. At $699, the price of this camera is high and SONY should be making a good enough profit without gouging the customer on the viewfinder. The instruction booklet leave a lot to be desired. There's lot to learn about the capabilities of the camera beyond the list of features. The booklet that comes with he camera is not complete at all. So then you have to buy a book for $25. C'mon now. I expect more of SONY\n\nAll in all, a good camera. After all the reviews I read and spending nearly $1300 for the camera, viewfinder, battery charger, flash and grip, I probably could have considered a few other cameras. I'm going to keep it hough and continue experimenting as I believe it will probably be great....until the RX200 with built-in Viewfinder and longer telephoto range are available in June or July of this year.",
      "submissionTime": "2014-02-02T09:35:35",
      "title": "Great camera but....",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony Cyber-Shot DSC-RX100 II Wi-Fi Digital Camera (Black) with 64GB Card + Battery & Charger + Case + Tripod + Accessory Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "n781lc",
      "reviewText": "Downsized from DSLRs, lens, bags and accessories due to aging strength and stability. Advanced hobbyist skilled in Adobe software.\n\nResearched numerous Compacts with attached zoom lens equal to my most used 'big ones.' Several of the top major brands had a demo day at a local full service camera store . The Sony DSC-RX100 M2 with the great glass (Carl Zeiss f/1.8-4.6), 28-100 zoom (35 mm equivalent) lens, seemed to fulfill my \"wants.\" .. It has!\n\nWould give 5 stars if better documentation, very minimal.\n\nThis camera has all that they say, much more than probably will ever be used, but .. there needs to be a much more detailed explanation of the extensive menu options and such uses as e.g., wireless flash, that is available with other quality devices.\n\nWould recommend to a friend, with caveat that Sony is a VERY large and diverse company with minimum customer relations/service.",
      "submissionTime": "2013-12-27T18:14:32",
      "title": "Replaced my DSLRs",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony Cyber-Shot DSC-RX100 II Wi-Fi Digital Camera (Black) with 64GB Card + Battery & Charger + Case + Tripod + Accessory Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "3"
      },
      "reviewer": "jmknights",
      "reviewText": "The Good:\n36mb Excellent Resolution, color, sharpness.\n\nThe Bad:\nExtremely slow startup time.\nNoisy, slow focus, shutter actuation(after pushing shutter button takes extra ordinary time for shot to be taken.\nQuirky some times it show down right in the middle of a shot.\nReview button sometimes fails to activate.\nPoor battery life and expensive at $79.00\n\nI have A99,A77,A900,A700,A100, RX100 and Nex5 to compare it to. If could have the low light capability, 36mb,resolution, and speed of my A99 or A900 I would be a very happy camper. For landscapes, portraits etc.; it is a great camera for a sport photographer it just doesn't cut it!",
      "submissionTime": "2014-07-01T06:38:33",
      "title": "ILCE-7R NOT A SPORTS CAMERA - FAST ACTION",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony Cyber-Shot DSC-RX100 II Wi-Fi Digital Camera (Black) with 64GB Card + Battery & Charger + Case + Tripod + Accessory Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "Brette",
      "reviewText": "I own the RX100 and loved it except that I couldn't take pictures outdoors because the sun obscured the LED screen. I couldn't see a thing on a sunny day. Very fundamental! So I was excited to see that the RX100 11 came with a tilting screen and a viewfinder slot on top. But was so disappointed by the limited flexibility of the screen- I took the camera out on a sunny day and I still couldn't see the LCD screen, and what I could take was limited to the angles I could make the LCD flex in (up and down) .\nThe separate viewfinder is $400 plus and so big it negates the whole pocket camera concept. I wanted so much to love the RX100 11 - it does have all these xtra features but disappointed me on the fundamentals.\n\nSony, please give me the same camera with a built in viewfinder, fully flexible LCD screen (flip out 360) , more zoom- and a few fixes on button placement-",
      "submissionTime": "2014-02-28T16:04:30",
      "title": "Love the camera but DISAPPOINTED",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony Cyber-Shot DSC-RX100 II Wi-Fi Digital Camera (Black) with 64GB Card + Battery & Charger + Case + Tripod + Accessory Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "3"
      },
      "reviewer": "Ryan312123",
      "reviewText": "I owned and loved the RX100 but the RX100M2 has some really bad pitfalls.\n\n1) Their new \"autofocus\" is worse than in the RX100. It prioritizes the background and objects in the foreground are often out of focus. For example, I can be recording video in auto-mode with a person 2 feet in front of me and it will focus on the background half the time, even when the person takes up 90% of the frame. It makes no sense why the camera would focus on something that takes up 1/10th of the picture!\n\n2) Whites really, really throw off blacks. If someone is wearing a white shirt and black pants, their legs turn out like black shadows because it messes up the exposure. There 'should' be an option for backlight compensation or something that de-prioritizes whites and compensates for blacks. Blacks are always hard to pick up and this makes it that much worse.\n\n3) Wi-Fi is really spotty. I'm using a Samsung Galaxy S3 so maybe an iPhone is more consistent but when you start recording, it's very laggy and almost impossible to use the zoom function.\n\nThanks for hearing my feedback, Sony. Can't wait for the RX200!",
      "submissionTime": "2013-12-03T23:44:06",
      "title": "Needs major improvements",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.38",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "1"
      },
      {
        "count": "5",
        "ratingValue": "3"
      },
      {
        "count": "8",
        "ratingValue": "4"
      },
      {
        "count": "27",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "42"
  },
  "availableOnline": true
}
