{
  "itemId": 41515495,
  "name": "Sony HDRCX900/B HDRCX900B HD Video Camera w/ 1\" sensor + Two Sony 32GB & One Sony 64GB SDHC Cards + Tiffen 67mm Photo Essentials Filter Kit + Wasabi Power Replacement Battery for Sony NP-FV70 + Two",
  "salePrice": 1220,
  "upc": "616320845056",
  "categoryPath": "Electronics/Batteries/Batteries",
  "brandName": "Sony",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSony-HDRCX900-B-HDRCX900B-HD-Video-Camera-w-1-sensor-Two-Sony-32GB-Two-Son%252F41515495%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSony-HDRCX900-B-HDRCX900B-HD-Video-Camera-w-1-sensor-Two-Sony-32GB-Two-Son%2F41515495%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_3945_473219",
  "reviews": [
    {
      "name": "Sony HDRCX900/B HDRCX900B HD Video Camera w/ 1\" sensor + Two Sony 32GB & One Sony 64GB SDHC Cards + Tiffen 67mm Photo Essentials Filter Kit + Wasabi Power Replacement Battery for Sony NP-FV70 + Two",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "neco31",
      "reviewText": "Sony is best. But Had it s-log2 gamma It would be nice :)",
      "submissionTime": "2014-09-29T08:02:44",
      "title": "Great camcorter",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony HDRCX900/B HDRCX900B HD Video Camera w/ 1\" sensor + Two Sony 32GB & One Sony 64GB SDHC Cards + Tiffen 67mm Photo Essentials Filter Kit + Wasabi Power Replacement Battery for Sony NP-FV70 + Two",
      "overallRating": {
        "label": "Overall",
        "rating": "3"
      },
      "reviewer": "Slack",
      "reviewText": "I bought this unit to replace my aging HDR SR12, which I loved, and I must say I don't see any difference in image quality. Sure, this one shoots 60p, which is great for slo mo, but as far as noticeable improvement in image quality with this 1\" sensor? I just don't see it.\nAnd, for the life of me, I can't figure out how to record 5 channel audio. This was the default mode on my old one, but I can't get anything other than 2 channel out of this one. And forget about getting a response from their Customer (non)Support options.\nI've used some of the newer lower end models and, frankly, I think you're better off buying 2 or 3 of them for the price of one of these. The image quality is comparable.\nBottom line: either step up to the 4k or buy the sub $500 models.",
      "submissionTime": "2014-09-26T14:54:45",
      "title": "Don't really see the difference",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony HDRCX900/B HDRCX900B HD Video Camera w/ 1\" sensor + Two Sony 32GB & One Sony 64GB SDHC Cards + Tiffen 67mm Photo Essentials Filter Kit + Wasabi Power Replacement Battery for Sony NP-FV70 + Two",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "RedmanGA",
      "reviewText": "This Sony model takes great video at each frame rate option (though auto focus is a little slow). However, there appears to be a technical issue with recording at 60p (and only at 60p)-- the sound recording is clipped/cuts in and out and also has a loud hiss. I have tested it in numerous indoor and outdoor settings including a quiet closet and it happens every time at 60p. I sent my original camera back to the retailer thinking that I had a bad model. Got the replacement and it does the exact same thing. I tried adding an external mic (Sony ECM-XYST1M) and the clipping and hiss sound goes away. So . . . do not plan on recording with the CX-900 at 60p without an external mic. I called Sony Support and reported my experience - but it was a quick conversation. It was hard to tell if they already knew about the issue and they provided no operational suggestions. Seems to be a great camera with that exception. Would be interesting if others could test and see if they have the same problem.",
      "submissionTime": "2014-05-22T09:37:33",
      "title": "Great video but problem with 60p sound",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony HDRCX900/B HDRCX900B HD Video Camera w/ 1\" sensor + Two Sony 32GB & One Sony 64GB SDHC Cards + Tiffen 67mm Photo Essentials Filter Kit + Wasabi Power Replacement Battery for Sony NP-FV70 + Two",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "AaronH",
      "reviewText": "First off, please ignore the reviewer who stated that the camera does not have zebras. As he indicated, he did not have the camera in his possession, nor had he used one, so his review is pretty meaningless. The camera DOES have zebras.\n\nThis camera packs a lot of functionality and artistic latitude into a... not-so-small package. It may seem like your average Handycam at a glance, but it's about twice the size. The bulk and weight of the big glass is noticeable, but not uncomfortable. My only regret is that the hip holster I've enjoyed using with my smaller Handycams won't work with this one -- a minor complaint, really.\n\nLow-light performance is very good, as you'd expect from a large sensor and a downscaled image. The picture is very sharp, and the depth of field is shallow enough for rack-focus shots while remaining deep enough that small focus errors aren't a total catastrophe. Manual controls are accessible, and full-auto mode yields nice results.\n\nThere is some confusion around the use of XAVC-S with Adobe Premiere CS5.5, and many are claiming that XAVC requires Premiere CS6. This is not correct. The XAVC-S 50Mbit/S from the CX900 loads right up in CS5.5 and edits without a hitch. And looks awesome.\n\nIn short: If you're prepared to fork out a bit more and don't mind a slightly bulkier camera, the CX900 will reward you with top-notch control and a crazy-good image.",
      "submissionTime": "2014-05-16T23:12:22",
      "title": "Brilliant",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony HDRCX900/B HDRCX900B HD Video Camera w/ 1\" sensor + Two Sony 32GB & One Sony 64GB SDHC Cards + Tiffen 67mm Photo Essentials Filter Kit + Wasabi Power Replacement Battery for Sony NP-FV70 + Two",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "JoeD",
      "reviewText": "I am very happy with the HDR CX900 after one intensive week of shooting with this camera and editing in Final Cut Pro 10. First I’ll tell you what I like and then I’ll list my most important nitpicks.\n\nHere are the best features of the Sony HDR-CX900 in order of importance to me:\nLarger sensor, lens and video codec that result in significantly better video than my very highly rated (by rating professionals) Canon HF G20.\nPhysical buttons, dials and menus make it easy to get the specific settings/results that I want when conditions are changing fast.\n12X zoom range which is about as right as any prosumer camcorder delivers.\nXAVC-S codec allows more refined color correction in post than AVCHD.\nND filters are a wonderful addition (not seen by me on any other “consumer” camcorder) to control light and achieve narrower DOF in combination with larger than normal-camcorder sensor.\nLarge still photo format that can be used for Ken Burns style pans and zooms in videos.\n\nThese points are based on my 14 years as a video hobbyist owning 7 different video cameras. I'm not a pro, but my youtube channel is approaching 500,000 views. My judgements are also based on one week of intensive study, shooting and editing so that I can make sure that this is a camera for me. It’s keeper. I was, and may once again become a fan of Canon, but owning the combination of the Sony RX100 and HDR CX900 provides a great combination.\n\nIf you have read this far, next you will read what could and should be changed. These points are nitpicks.\nThe multi-interface shoe will not hold standard shoe accessories without a Sony adapter.\nI love the My Button feature (which should be called My Buttons) but Sony should and could have programmed six My Buttons instead of three.\nSony released the camera without a decent manual. The one that comes with the camera is too short to be useful. This problem will go away with time, but according to Sony Support, the full User Manual won’t be out until April 15th and support is handicapped until then. I downloaded the English European version from here: http://download.sony-europe.com/pub/manuals/consumer/FDRAX100_CX900_HG_EN.pdf. It proved to be very useful.\n\nHope this helps you decide what is right for you.\nJoeD",
      "submissionTime": "2014-03-29T08:16:24",
      "title": "Great camera based on one-week of intensive usage.",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.27",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "3",
        "ratingValue": "3"
      },
      {
        "count": "2",
        "ratingValue": "4"
      },
      {
        "count": "6",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "11"
  },
  "availableOnline": true
}
