{
  "itemId": 35524423,
  "name": "Sony POV Action Cam HDR-AS100V/W White HD Camcorder with Display Panel, SteadyShot Image Stabilization and Built-in GPS",
  "salePrice": 299.99,
  "upc": "027242869738",
  "categoryPath": "Electronics/Cameras & Camcorders/All Camcorders",
  "brandName": "Sony",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSony-HDR-AS100V-W%252F35524423%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSony-HDR-AS100V-W%2F35524423%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_133277_4549",
  "reviews": [
    {
      "name": "Sony POV Action Cam HDR-AS100V/W White HD Camcorder with Display Panel, SteadyShot Image Stabilization and Built-in GPS",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "MMC1",
      "reviewText": "Bought the HDR-AS100 bundle with he live view and its been fantastic so far.\nBut there's a need for an additional tripod adapter when setting up multiple locations. Really surprised this adapter cannot be bought from Sony.\n\nIt would act similar to my tripod plate where once its set I can mount and dismount and not disturb filming angle.\nSome portable mounting locations don't use big tripod plates and the small tripod adapter is perfect for such applications.\n\nPlease Sony make this accessory available to purchase.",
      "submissionTime": "2014-08-23T16:35:05",
      "title": "Great cam but needs more mounting acc options",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony POV Action Cam HDR-AS100V/W White HD Camcorder with Display Panel, SteadyShot Image Stabilization and Built-in GPS",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "reviewer": "Guru22",
      "reviewText": "The camera has excellent specifications. However, because of the form factor, it is useless as an action. The camera cannot be attached to clothing. To attach the camera, you need to buy additional bulky and heavy mount adapters. For this reason, the small weight of the camera is irrelevant. The camera cannot be used while fishing, hunting, walks in forests and mountains. Fishing line, bushes, tall grass catch on the camera adapters. It is not possible to attach camera onto the windshield of the car, as well as to use it as a dashboard camera. HX-A500H Panasonic camera’s form factor is much better.\nSorry.",
      "submissionTime": "2014-12-10T17:23:44",
      "title": "The camera has a terrible form factor.",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony POV Action Cam HDR-AS100V/W White HD Camcorder with Display Panel, SteadyShot Image Stabilization and Built-in GPS",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "withawye",
      "reviewText": "All cameras in this segment have their strengths and weaknesses. The competition is popular but has poor battery life, blows the colors out, and the form factor has its strengths and weaknesses.\n\nI have both the competitor and the Sony with the wrist remote. I would disagree with the other comment on the form factor. The linear orientation is great on a helmet, side of the car, fishing pole, etc All the areas the competition is weak. The perpendicular orientation of the competition is weak in these areas but great against the body or against a flat object. Once again it all depends on how you want to use it.\n\nChest mount is available. Another mount available for the Sony and not the competitor is the shoulder strap mount that lets you mount the camera to a backpack or camera bag. I haven't purchased it yet but it looks great.\n\nThe lack of field of view options can be limiting on the Sony compared to the competition however, the GPS and image stabilization are excellent features that depending on your needs may outweigh the extra wide or wide vertical options provided by the others.\n\nThe battery is significantly better on the Sony.\n\nI find the color truer on the Sony but poorer in low light conditions.\n\nThe GPS and Image stabilization, wrist remote, and great battery life make the Sony a great option if you want something that will record a more typical camcorder image.\n\nhttp://youtu.be/gbOASlm7bLQ\nsome video the Sony Action Cam on my dogs back. It's a bit too jerky to really evaluate the camera but right now it's all I have.",
      "submissionTime": "2015-01-26T23:32:45",
      "title": "Good and Bad",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony POV Action Cam HDR-AS100V/W White HD Camcorder with Display Panel, SteadyShot Image Stabilization and Built-in GPS",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "Joegadget",
      "reviewText": "Great small camera with big camera picture and sound. It even fits in your shirt pocket. Mine is the: HDR-AS30VW. There was no option to register this model on Sony's Web Site. If you want to mount this camera on a tripod you must use the waterproof case to mount it. Also you cannot edit or delete a video or portion of a video. Your only two options are: all or none. To erase you must reformat the memory card. Over all I am very happy with this video camera.",
      "submissionTime": "2015-04-28T06:17:39",
      "title": "LIGHTS, CAMERA, ACTION",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Sony POV Action Cam HDR-AS100V/W White HD Camcorder with Display Panel, SteadyShot Image Stabilization and Built-in GPS",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "jperk",
      "reviewText": "The as100 works great, steady shot is a wonderful addition not avail on the gopro. heres a short time lapse",
      "submissionTime": "2014-06-01T08:27:48",
      "title": "HDR-AS100V",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "3.41",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "8",
        "ratingValue": "1"
      },
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "3",
        "ratingValue": "3"
      },
      {
        "count": "5",
        "ratingValue": "4"
      },
      {
        "count": "12",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "29"
  },
  "availableOnline": true
}
