{
  "itemId": 10324968,
  "name": "Spring Valley VIT C 500MG OJ 60",
  "salePrice": 3.97,
  "upc": "681131573719",
  "categoryPath": "Health/Vitamins/Vitamins",
  "brandName": "Spring Valley",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FSpring-Valley-VIT-C-500MG-OJ-60%252F10324968%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FSpring-Valley-VIT-C-500MG-OJ-60%2F10324968%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "976760_1005863_1001553",
  "reviews": [
    {
      "name": "Spring Valley VIT C 500MG OJ 60",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "1"
        },
        {
          "label": "Meets Expectations",
          "rating": "1"
        }
      ],
      "reviewer": "KARENINVT",
      "reviewText": "In the past I have gotten this same brand of Vitamin C in a bottle of 180 tablets or more. This is the orange juice flavor & chewable that my husband loves. Now it is packaged only as 60 & I am not happy. It is way too expensive. PLEASE BRING BACK THE SPRING VALLEY CHEWABLE VITAMIN C 500MG IN ORANGE JUICE FLAVOR!!!!!!",
      "submissionTime": "2012-12-14T05:14:43",
      "title": "14 December 2012",
      "upVotes": "17",
      "downVotes": "3"
    },
    {
      "name": "Spring Valley VIT C 500MG OJ 60",
      "overallRating": {
        "label": "Overall",
        "rating": "2"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "3"
        },
        {
          "label": "Meets Expectations",
          "rating": "2"
        }
      ],
      "reviewer": "Hairsteezalist",
      "reviewText": "This used to be my favorite chewable vitamin c. But the last bottle I bought had a completely different flavor & it's not good anymore. It also used to come in a large bottle size & be more affordable. What's going on Spring Valley?",
      "submissionTime": "2013-07-08T22:38:12",
      "title": "They changed the flavor",
      "upVotes": "9",
      "downVotes": "1"
    },
    {
      "name": "Spring Valley VIT C 500MG OJ 60",
      "overallRating": {
        "label": "Overall",
        "rating": "1"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "1"
        },
        {
          "label": "Meets Expectations",
          "rating": "1"
        }
      ],
      "reviewer": "UNCLEBOB1955",
      "reviewText": "Wal Mart apparently no longer sells the bottle of 180 vitamins. They also changed the taste. If you liked the original orange juice flavor, you're not going to be happy with these.",
      "submissionTime": "2014-04-28T16:28:03",
      "title": "WHY DID WAL MART CHANGE A GOOD THING?",
      "upVotes": "4",
      "downVotes": "0"
    },
    {
      "name": "Spring Valley VIT C 500MG OJ 60",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "SweetMissAnon",
      "reviewText": "Hi! I have been buying this vitamin c supplement by Spring Valley for a few years now! I swear by it.\n\nI had to come and write a good review because I have physically felt an improvement in my health that is dramatic and positive when I take these.\n\nDuring times when I did not take these regularly, I notice my health and other symptoms were not as good.\n\nAlso, I think it is very important to clarify something another reviewer posted about this supplement, and she was wrong.\n\nShe claimed that the flavor changed and the formula changed and that it was terrible. But what happened to a lot of people, like me, who love this supplement, was the store and website started offering two different kinds of Vitamin C in this brand.\n\nThis one is the good one! It is orange flavored and does not contain rose hips, which taste like soapy poison in my opinion.\n\nThe new version contain rose hips, and they do taste like soapy poison.\n\nI like this one because it does not contain rose hips at all.\n\nI hate the rose hips version.\n\nThe bottles may look very similar, but it is really important that you read carefully on the bottle what you bought, both front and back of bottle, and close up.\n\nHave a great day and thank you so much to Walmart for making this product available. I can not even count the number of people who have started using the product since I recommended it to them. They all agree that the true orange ones are good and the rose hips version is disgusting and gross.\n\nRose hips are gross! Oranges are yummy! I don't want to eat flowers! LOL.",
      "submissionTime": "2015-02-02T08:42:09",
      "title": "Perfect Vitamin C Supplement - Orange Vitamin C",
      "upVotes": "1",
      "downVotes": "0"
    },
    {
      "name": "Spring Valley VIT C 500MG OJ 60",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "LelaR",
      "reviewText": "I wholeheartedly agree there is no better tasting Chewable Vitamin C that Spring Valley makes, then this one. My husband & I have been using this product for awhile now and love it. We take it everyday and we feel healthy. I love the tangy orange flavor which tastes so good!!!!! I mistakenly bought a bottle of their Vitamin C with Rose hips and there is no comparison, how good tasting this product is. I also hope that one day soon Spring Valley will sell this product in a bottle larger then 60 tablets. What a perfect idea that would be. Love this product Spring Valley!!!!!!!!",
      "submissionTime": "2015-02-08T14:32:41",
      "title": "I Love The \"TANGY\" In My C",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "2.5",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "3",
        "ratingValue": "1"
      },
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "2",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "6"
  },
  "availableOnline": true
}
