{
  "itemId": 29471966,
  "name": "Travelers Club 20\" Rolling Tote",
  "salePrice": 14.58,
  "upc": "015272750201",
  "categoryPath": "Home/Luggage/Luggage Sets",
  "brandName": "Travelers Club",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FTravelers-Club-20-Rolling-Tote%252F29471966%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FTravelers-Club-20-Rolling-Tote%2F29471966%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "4044_444253_651265",
  "reviews": [
    {
      "name": "Travelers Club 20\" Rolling Tote",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "lovemyQTs",
      "reviewText": "What a great product! Much bigger than expected, which is great since I can fit almost everything in this bag. This bag has become my 'office' since i travel to several offices daily. I can fit my laptop, ipad, 2 binders (large), 2 chargers, mouse, and my lunch bag. I can even fit my purse in it! The rollers are so smooth and even though they are small, they are so durable. I tend to be so focused as I walk into these facilities, and the poor bag gets the curbs, rocks, bumps, and amazingly enough withholds all of these accidents! I am petite (5'2\" 103 lbs) so the telescopic handle is perfect for me to be able to pull/push, and easy to push handle done to fit in the front seat of the car. Best part, it NEVER falls over! I've had several bags that would just fall due to the unsteadiness of the items in the bag (how in the world do you have time to balance that?!?!?) stays upright to allow me to take out my hardware and binders. It's also lined for easy clean-up. This bag has become my 'buddy', I can't live without it.",
      "submissionTime": "2014-02-08T04:59:41",
      "title": "On the road",
      "upVotes": "26",
      "downVotes": "2"
    },
    {
      "name": "Travelers Club 20\" Rolling Tote",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "4"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "Valls",
      "reviewText": "Bought the blue/black color and looks very neat and professional. Good quality, heavy canvas-like exterior finish which seems very durable. Outside zip pocket and two open side mesh pockets are all deep and spacious, interior zip is smaller but still quite a nice size and should easily accomadate even a large wallet. Liner is light gray (at least it is in the blue/black exterior model I purchased) and zips open - light color is good as it helps me to easily see what is in the bag (as opposed to typical dark liners which turn bag interiors into the black hole of Calcutta) - liner is a bit thin, but most rolling totes don't even have a liner, so I'm happy. Comfortable fabric handles and zip top on the extending metal handle are nice features - even better, the metal handle has 2 bars for stability and actually locks open properly so this rolling tote can be both pushed and pulled - a huge plus when maneuvering in tight spaces and when walking so I can switch between pulling and pushing when I get tired. Main compartment is good size and reasonably spacious - will hold from 2 to 3 grocery bags, maybe 4 or 5 if you leave the top unzipped and stack. Build quality is not as solid as I had hoped for, but still very good and a bargain at $14. I don't think it is up to heavy loads - I used it to transport two 28 pound boxes of cat litter from the car to my front door and it could barely handle that load, and that was without attempting the steps - I didn't dare as I feared the handle and/or wheels would break. On the other hand, today I loaded the tote with 2 gallons of water, vegetables, bread, etc. and it was fine - I would guestimate the maximum weight this tote can cope with on a regular basis to be around 40lbs.\n\nSo, a great tote for small weekly shopping trips and to transport books, notes etc. to class. But if you need to transport more than 40lbs. on a regular basis, I would suggest looking elsewhere. So far this bag fits my needs very well and I am very happy with my purchase.",
      "submissionTime": "2014-01-29T13:40:41",
      "title": "Great for the price",
      "upVotes": "16",
      "downVotes": "0"
    },
    {
      "name": "Travelers Club 20\" Rolling Tote",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "mrblueu",
      "reviewText": "I didn't see this mentioned any where but it also has an inside zipper that begins at the very bottom inside and goes up the back side. It took me a couple of minutes to realize it's purpose. You can unzip that area and store more items in the back behind the actual inside! This item is more than worthy of it's under $14 price. It is primarily made of a canvas and therefore durable. I have the fuchsia and waiting on the blue. My main purpose intends to be for yarn, crochet, knitting tools. I don't have plans to take these any where other than inside my house. Their great for storage and can store easily flat or upright. The handle also hides inside a zipper compartment...you can carry the bag by it's strap or unzip the handle area to extend the handle. It rolls extremely easy and smooth. There is one small zipper pocket inside. Outside has a tall mesh pocket on each side....water bottles or even an umbrella could go in those. There is the large deep zipper pocket on the front. I think these are addictive and would make great gifts too.",
      "submissionTime": "2014-03-28T09:06:15",
      "title": "Includes Hidden Inside Compartment",
      "upVotes": "14",
      "downVotes": "3"
    },
    {
      "name": "Travelers Club 20\" Rolling Tote",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        },
        {
          "label": "Durability",
          "rating": "5"
        },
        {
          "label": "Appearance",
          "rating": "5"
        }
      ],
      "reviewer": "MikeysDi",
      "reviewText": "Bought this for my 85 year old Mom, so she could put her portable oxygen tank and spare in it, to walk with her friends at the mall. She wouldn't have been able to carry it for that long. The bag is great...nice size, looks good, has good wheels, and worked perfectly for her!",
      "submissionTime": "2014-02-01T13:16:17",
      "title": "Great for my Mom's oxygen for mall walking",
      "upVotes": "3",
      "downVotes": "0"
    },
    {
      "name": "Travelers Club 20\" Rolling Tote",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Gottaseeit",
      "reviewText": "Actually this could be smaller--a lot smaller, for my purpose. I needed something on wheels that would fit inside a locker at the Y. Was pretty sure this wouldn't fit and almost returned it. But the zebra and pink was so cheerful, it was well made and certainly priced right so I decided to give it a try.\n\nLove it. It does fit inside some of the lockers. Rolls smoothly, stands on its own, fits standing up on the floor behind drivers seat. That's not so important now, when I could easily plop it on the seat, but come winter when the bottom/wheels get full of snow, it will be nice to stand it on a mat on the floor. And speaking of plopping it somewhere, I really like the cup handle built onto the bottom that makes it so much more balanced and easy to lift. Important if carrying something heavy.\n\nI'm thinking another would be nice for the farmers market. So much nicer than those carts people walk around with hitting peoples ankles.",
      "submissionTime": "2014-09-16T19:18:04",
      "title": "A really big bag!",
      "upVotes": "3",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.77",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "2",
        "ratingValue": "3"
      },
      {
        "count": "9",
        "ratingValue": "4"
      },
      {
        "count": "46",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "57"
  },
  "availableOnline": true
}
