{
  "itemId": 15751828,
  "name": "Vantec NexStar CX NST-200S2-BK Hard Drive Enclosure",
  "salePrice": 13.14,
  "upc": "844767012513",
  "categoryPath": "Electronics/Computers/Computer Components/Hard Drive Accessories",
  "brandName": "Vantec",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FVantec-NexStar-CX-2.5-SATA-to-USB-2.0-External-Hard-Drive-Enclosure%252F15751828%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FVantec-NexStar-CX-2.5-SATA-to-USB-2.0-External-Hard-Drive-Enclosure%2F15751828%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_3951_1073804",
  "reviews": [
    {
      "name": "Vantec NexStar CX 2.5\" SATA to USB 2.0 External Hard Drive Enclosure",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "SanAntonioGuy",
      "reviewText": "I bought this product after reading reviews about the NexStar TX. I needed to get the last files that I had not backed up on my old laptop before it died. This one was only $10 and I must say that I got my money's worth. It is an extremely durable product. My old 2.5 laptop hard drive sits encased in a heavy duty aluminum casing. The hard drive screws down to a metal board that slides in and out of the case. This prevents the drive from moving at all inside the enclosure. The metal board attaches to a plastic cap which then screws to the metal frame making a clean sleek external hard drive. And on top of all this, it actually works. It is simply a great product priced very reasonably",
      "submissionTime": "2011-05-28T07:29:58",
      "title": "Excellent Low Cost Enclosure",
      "upVotes": "6",
      "downVotes": "1"
    },
    {
      "name": "Vantec NexStar CX 2.5\" SATA to USB 2.0 External Hard Drive Enclosure",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "Swimswithalligators",
      "reviewText": "My Gateway laptop unexpectedly died and the worst part aside from losing a perfectly good computer before it's time was losing files. The Geek Squad at Best Buy would recover my files for $99.00 but I was feeling broke after having to buy a new computer. I researched and purchased this product. I removed the hard drive, inserted it in the adapter, connected it to the new computer, and transferred all my files. All for $12.00. I am over fifty, female, don't tinker with the insides of computers, and I did it all by myself in a short amount of time. It was well worth the price.",
      "submissionTime": "2011-07-15T17:34:53",
      "title": "Life saver",
      "upVotes": "4",
      "downVotes": "0"
    },
    {
      "name": "Vantec NexStar CX 2.5\" SATA to USB 2.0 External Hard Drive Enclosure",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "Ngineer",
      "reviewText": "I bought this after our laptop died a slow and painful death. The only thing worth salvaging out of the old beast was the hard drive, so this product was the solution for retrieving the files off of the drive. I received the product quickly after my order and it has worked as advertised so far. The black aluminum case with plastic ends looks decently well built and is not much bigger than the drive. My hard drive was a Very snug fit in the enclosure. In fact, I'm not sure I'll ever be able to get it back out, but I can't imagine why I would need to so I guess it's a moot point. The only issue I had was that it takes up two usb ports (I'm assuming the extra USB is needed for power). This wouldn't be a problem except that now that the laptop is dead, all I have is an ancient desktop PC that only has two usb ports, so I have to unplug the printer if I want to use the drive. Other than that, it works great.",
      "submissionTime": "2011-06-03T13:58:07",
      "title": "Works as expected",
      "upVotes": "4",
      "downVotes": "1"
    },
    {
      "name": "Vantec NexStar CX 2.5\" SATA to USB 2.0 External Hard Drive Enclosure",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "reviewer": "tomondl",
      "reviewText": "This product is of excellent design. The hard aluminum shell is of great protection for any hard drive or SSD. The instructions are not very good and need expanding instead of being in so many languages there is not enough room for all the instruction needed. I would recommend this product to friends and clients.\n\nOne extra not related to the product itself. Be very careful of the shipping by Walmart. Even to the store the tracking is so bad you never know when the store will get it.",
      "submissionTime": "2014-11-23T03:40:24",
      "title": "Excellant Product",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "Vantec NexStar CX 2.5\" SATA to USB 2.0 External Hard Drive Enclosure",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "krissyg89",
      "reviewText": "This product is very easy to use, very professional looking, and it allows me to quickly swap drives if I need to. The drives I used with this were 80GB, and it had no issues handling them. My only concern is that mine didn't come with a screw driver for assembly. I recommend you have a small one handy if you buy this. I also don't recommend you use it for more than a couple minutes at a time. I used mine just long enough to grab old files off and put new files on. The drive gets hot quickly, and the enclosure doesn't have a vent. Other than that, like I said, very easy to use. You just plug it in and it is ready to go.",
      "submissionTime": "2011-08-08T08:35:09",
      "title": "Great",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.64",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "4",
        "ratingValue": "4"
      },
      {
        "count": "7",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "11"
  },
  "availableOnline": true
}
