{
  "itemId": 21989683,
  "name": "Vivid Allon EB021 Eco Bag - Cherry",
  "salePrice": 21.11,
  "upc": "841627005395",
  "categoryPath": "Party & Occasions/Crafts/Craft Storage",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FJanetBasket-Cherry-Eco-Bag-18-x-10-x-12%252F21989683%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FJanetBasket-Cherry-Eco-Bag-18-x-10-x-12%2F21989683%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "2637_667479_1021741",
  "reviews": [
    {
      "name": "JanetBasket Cherry Eco Bag, 18\" x 10\" x 12\"",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "NANNADLM",
      "reviewText": "This bag is great! I initially purchased one for my granddaughter for christmas. Then when it arrived I immediately purchased one for myself. The interior has lots of different size pockets for items and there is a zipper pocket on the outside of the bag. The bag zips up two different ways. You can close the outermost zipper and it looks like the picture with the tapered top. There are also two flaps inside that can be zipped up instead of the outermost zipper and you can hold a large project inside this bag - like a crocheted blanket or something. I am currently using it for a cross stitch namesake and it holds everything including the 10\" ring, a light and a clip on magnifyer. There are also four rubberized \"feet\" on the bottom to protect the bag - and it's all very light weight. Again - this is a great bag!",
      "submissionTime": "2013-01-03T11:17:05",
      "title": "Best Bag I've Found for Crafts",
      "upVotes": "6",
      "downVotes": "0"
    },
    {
      "name": "JanetBasket Cherry Eco Bag, 18\" x 10\" x 12\"",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "KimS",
      "reviewText": "This a very roomy bag for your crafting (or in my case knitting!) projects!!! It has awesome, spacious pockets on the inside, along with the option to close it the regular way or along the top for your bigger projects! It is made VERY well and will last!",
      "submissionTime": "2015-03-04T14:56:28",
      "title": "Awesome!!",
      "upVotes": "0",
      "downVotes": "0"
    },
    {
      "name": "JanetBasket Cherry Eco Bag, 18\" x 10\" x 12\"",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Nancy",
      "reviewText": "I purchased this bag to transport all my knitting gear to and from classes and to our camper at the lake. It has lots of room! I can fit a full-size ring binder full of patterns, a a couple of knitting books, an Addi interchangeable and two knitters pride interchangeable needle sets, a plastic case full of crochet hooks, 2 more cases with 10\" bamboo and 14\"aluminum knitting needles, a case with other notions, pens, pencils, scissors, and two project bags with yarn and unfinished projects in them. And there is still room for more, like my wallet and a water bottle. The velcro that some reviewers were worried about is not a problem, as the strap covers it up. It also has 2 sets of zippers on top so you can zip it one way if it's not too full, and another way if it is very full. You can actually skip the zipper and just velcro the handles together and it stays closed well enough.",
      "submissionTime": "2015-05-09T10:51:49",
      "title": "Great Bag for Knitters or other needle arts!!",
      "upVotes": "0",
      "downVotes": "0"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "5.0",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "3",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "3"
  },
  "availableOnline": true
}
