{
  "itemId": 28132398,
  "name": "XM Satellite Radio XEZ1V1 Onyx EZ Dock and Play Radio with Vehicle Kit",
  "salePrice": 35.57,
  "upc": "884720013126",
  "categoryPath": "Electronics/Audio/Satellite Radio/SIRIUS XM Satellite Radio Accessories",
  "brandName": "SIRIUS",
  "productTrackingUrl": "http://linksynergy.walmart.com/fs-bin/click?id=|LSNID|&offerid=223073.7200&type=14&catid=8&subid=0&hid=7200&tmpid=1082&RD_PARM1=http%253A%252F%252Fwww.walmart.com%252Fip%252FXM-Satellite-Radio-XEZ1V1-Onyx-EZ-Dock-and-Play-Radio-with-Vehicle-Kit%252F28132398%253Faffp1%253Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%2526affilsrc%253Dapi",
  "productUrl": "http://c.affil.walmart.com/t/api06?l=http%3A%2F%2Fwww.walmart.com%2Fip%2FXM-Satellite-Radio-XEZ1V1-Onyx-EZ-Dock-and-Play-Radio-with-Vehicle-Kit%2F28132398%3Faffp1%3Dl1dAKNLrNlFLqxAnUYUMtwzELl3x1lA0ev6C4H5U2XY%26affilsrc%3Dapi%26veh%3Daff%26wmlspartner%3Dreadonlyapi",
  "categoryNode": "3944_133251_133254",
  "reviews": [
    {
      "name": "XM Satellite Radio XEZ1V1 Onyx EZ Dock and Play Radio with Vehicle Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "TinfoilTiara",
      "reviewText": "VERY simple setup and it works great! I don't know why anyone would pay more for a satellite radio. It has all of the features you need. At 37 bucks, it's extremely affordable! The only difference I could find between this unit and the super expensive ones is that you can \"pause\" the song/show on the expensive units.",
      "submissionTime": "2014-07-25T10:13:51",
      "title": "Excellent Radio, Great Price!!!",
      "upVotes": "15",
      "downVotes": "0"
    },
    {
      "name": "XM Satellite Radio XEZ1V1 Onyx EZ Dock and Play Radio with Vehicle Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "IlsaT",
      "reviewText": "I have had this radio for 3 years and have it on constantly. It serves the purpose for a Sirius radio. If I have to turn it off for local weather reports, I have to remember to turn the channel on the radio first, then turn off the Sirius XM. If I turn the Sirius XM off first, and I have no idea why it does this, but it loses my channel and I have to reprogram it. Then every time you turn the car back on, it comes back to the same menu channel, telling me what is on where. It does this for several times, then it will stay on your channel. It's not that big of a deal. I have a speed dial set. It just gets annoying. Just remember to change the channel first, then turn off the radio. Then do the same when you turn it back on - change the channel on the radio first, then turn on your satellite radio.\nIt was my first satellite radio so even after 3 years, I am learning. To me, it seems like it's a little difficult to program. To someone that isn't technologically challenged, it will probably be a snap.",
      "submissionTime": "2013-12-04T12:21:12",
      "title": "Great for a beginner",
      "upVotes": "8",
      "downVotes": "0"
    },
    {
      "name": "XM Satellite Radio XEZ1V1 Onyx EZ Dock and Play Radio with Vehicle Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "5"
        },
        {
          "label": "Meets Expectations",
          "rating": "4"
        }
      ],
      "reviewer": "carlp1",
      "reviewText": "The package has ALMOST everything needed to play in the house and car. It needs AC power cord for the house. It works well through the auto FM radio with plenty of channels in the preset if you are traveling and there is a local station on the channel which you have the unit set for. Walmart has the best price on the unit that I could find.",
      "submissionTime": "2014-09-28T15:44:50",
      "title": "Does what it is suppose to, receives sat radio.",
      "upVotes": "4",
      "downVotes": "0"
    },
    {
      "name": "XM Satellite Radio XEZ1V1 Onyx EZ Dock and Play Radio with Vehicle Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "4"
      },
      "productAttributes": [
        {
          "label": "Value",
          "rating": "4"
        },
        {
          "label": "Meets Expectations",
          "rating": "5"
        }
      ],
      "reviewer": "SantaFe2009",
      "reviewText": "I've continuously maintained the XM packet in my stock manufacturer radio of my '09 Hyundai Santa Fe since purchasing the vehicle new. Recently, the XM function of the car radio froze up (the rest of the radio unit-FM/AM, CD) continued to work fine. After a trip to the dealership, I was informed that it would take a whole new stock radio to have XM function fix--- a cost over $700... not an option for a five year old vehicle I may only keep another year or two.\nBecause XM rolls over existing contracts automatically and with my roll over just last month and wanting to continue to enjoy XM, I opted to purchase this little XM Onyx model. For a small $15.00 signal transfer fee by XM from the car stock unit to this unit, I was back to good listening with no issues in quick time... I ordered the radio online at Walmart.com and picked up and installed the following day with a five minute call to XM to transfer the contract.\nAs far as installation... well, it's almost self explanatory. The longest time in set up was running the antenna wire through the car under seats. You have to plug the antenna into the unit; the power cord into your lighter/aux power source; getting speaker sound is by plugging the unit line into an aux port (usually near a USB port on newer models).... that's it for installation and you're set. The only other worry in installation is how you mount the unit (you have a dash mount option or clips on to a AC vent). I, personally, did neither and found that it would sit nicely in the opened ash tray allowing me to quickly unhook the unit to stow in a glove box when I'm away from the car for extended times. The only draw backs are the XM sound piped through the aux port for the vehicle speakers has a slight affect on the sound level requiring the car speakers to be at a higher setting for my normal listening levels; and having the wires in plan view... Otherwise, I'm very pleased with this model and would recommend it to somebody in the same situation as mine or to someone interested in first exposure to XM on an older vehicle without XM radio capacity. (as others have pointed out, a new person to XM will need to call to purchase a contract with them).",
      "submissionTime": "2014-07-31T17:54:08",
      "title": "Replacement radio",
      "upVotes": "4",
      "downVotes": "0"
    },
    {
      "name": "XM Satellite Radio XEZ1V1 Onyx EZ Dock and Play Radio with Vehicle Kit",
      "overallRating": {
        "label": "Overall",
        "rating": "5"
      },
      "reviewer": "Wesley8417",
      "reviewText": "OMG! that is all i can say. first of all i was well pleased with walmarts ship to store service. I decided to try it for this product and the speed getting to the store was absolutely wonderful. I believe in giving credit where credit is due. My product was at the store the next day, they notified me promptly in a timely and efficient manner. the price is just unreal i could not believe how great the priciing was on the product. Initially i wanted to try the free trial subsciption with the product. Had the product installed and it works perfectly. no issues what so ever. i liked not only the great product, the great service walmart gave me and the music so much that i am going to purchase the whole year subscription. Honestly i usually get my audio electronics from a reputable electronics retailer but i could not pass up this deal and the store is less than 3 miles from my house. Walmart you are still King in my book when it comes to retail! Please accept my heartfelt kudos to everyone from the CEO of the company down to the janitor who does the floors. You guys are not one of the top retailers in the world for nothing!You all do a great job making sure we get great products at everyday low prices.",
      "submissionTime": "2014-09-13T19:37:52",
      "title": "OMG!",
      "upVotes": "4",
      "downVotes": "1"
    }
  ],
  "reviewStatistics": {
    "averageOverallRating": "4.44",
    "overallRatingRange": "5",
    "ratingDistributions": [
      {
        "count": "1",
        "ratingValue": "1"
      },
      {
        "count": "1",
        "ratingValue": "2"
      },
      {
        "count": "2",
        "ratingValue": "3"
      },
      {
        "count": "8",
        "ratingValue": "4"
      },
      {
        "count": "22",
        "ratingValue": "5"
      }
    ],
    "totalReviewCount": "34"
  },
  "availableOnline": true
}
